["\nLoved every minute at this beautiful hotel, staff were so friendly and helpful and the massages are to die for! Great for families if your not wanting to stay in busy kuta. Only thing a little disappointing was the food selection.\n", "\nFar from the Centeral Bali which is Kuta but a nice Hotel Resort on the Beach and amazing Getaway. Relaxing ! THe Pool and the Beach Dinning experience made it even better.", "If you are in Bali and need to slightly far from Centeral area nice place to be. All the better resorts and good hotels in this area which is new developed.\n", "\nA most idyllic resort. Friendly informative reception-Superb cuisines, relaxing atmosphere and excellent service.", "Not a thing to criticize.More than highly recommend. Close to airport and cruise port. ", " ", "\n", "\nThis property is very old now and even the refurbished rooms feel dated and shabby. ", "The hotel staff do try but they don't have much to work with in terms of quality of rooms or the food. The only place with decent food is their Raja restaurant. ", "\n", "\nGreat R&R location and far from the madding crowd, The adjacent beach strip both North and South continually improves with more peer group establishments. ", "However the Palace Club team provide exceptional service and make it hard to think about staying anywhere else,", "Will be back later in the year.", "Will see you all later this year,", " ", " ", "\n", "\nI had my bestest holiday getaway with Nusa Dua Beach Hotel. Lovely atmosphere, warm staff, everybody so sweet and helpful. The ambience was amazing and our room for the honeymoon couple suite was very well looked after.", "We had access to the private beach and few restaurants located inside the hotel. daily lavinsh breakfats spread and 3 hours long spa and facial was an icing on the cake.", "I thoroughly enjoyed my stay in this hotel and never wanted to leave from there. So beautiful experience and value for money, that I would love to come to bali every year just to stay in this hotel :)\n", "\nWe went there for honeymoon in Nov mid and I find this place amazingly beautiful. we received warm welcome at reception and room was also decorated for the special occasion. We got complimentary wine and fruits in evening as well. Though the beaches were terribly hot in day time it was pleasant in night. In night, resort lightings made our mood romantic. It is advice to the travellers that if you don't like resort's food then there is no option nearby as well! We tried to went outside for some romantic place for dinner but it was all in vain. Resort restaurants are quite expensive. Also make sure you are not hiring any cab from Hotel as it is almost twice or thrice the cost available outside. Just walk down 200-300m from resort and you will find can stand from where you can bargain up to 60-70%. Bargain is must in BALI in everything. Resort amenities and ambience are both worth mentioning. Rooms were very clean and staff was courteous enough to quickly respond to any help.\n", "\nI couldn't pick a thing! May be more entertainment otherwise perfect! It was my first time in bali and it was great to escape husle into our little paradise. We enjoyed our monday night the most dinner and show in the outdoor theatre was like a dream !", " ", "\n", "\nOur family (two adults, two kids) loved the hotel and atmosphere. The service was great with one exception: when we checked in second room of ours was not ready. It was cleaned and otherwise ready but it seemed an employee of the hotel has used the room: there was half eaten fruits on the table and clearly someone has been taken naps in the bed. The luggage boy was very sorry and asked us to wait in the kids room while they are cleaning the room. But it took one and half hour to clean it and we were very tired after travelling. And we didn't get any compensation, just apologies. But otherwise our seven days staying in Nusa Dua beach hotel was very satisfying.\n", "\nGreat resort with all the facilities you need and in a true Balinese style. Stayed in the Palace Club with was amazing and definitely worth the upgrade. Staff were lovely and always helpful. Only downside is the slipery-ness of the floors in the guest rooms. Whilst it looks amazing, we did slip a few times as its so polished! But would stay here again and recommend to anyone travelling to Nusa Dua", "\n", "\nOverwhelming in all respects.", "With the sole exception of a lack of clear identification of the location of our room, there was nothing that we could fault, from the time we were collected at the airport, until we checked out.", "All, repeat all, of the staff that we came into contact with, were courteous and helpful.", "\n", "\nDefinitely worth a stay! Top service, breakfast and a lovely hotel. Not anything to do or to eat outside the hotel (if your not driving), and the beach was ok! But I will definitely recommend it to my friends!", "\n", "\nThis is our second time staying in this hotel, once again we enjoyed a great time here. Styaffs are freindly, fun pools for my two little ones. My little girl loves sitting at the pool bar drinking coke( which she is not allowed normally). Everyafternoon, while our 20months son goes to sleep, our 4 year old daughter will go to the kids centre for some art craft activities. They both enjoyed feeding the fishes, squirrels, birds, ducks... The only draw back is the air con in is a bit noisy. However, we will still be coming back to this hotel when we visit Bali agian. 非常好的酒店，很适合有小孩的家庭。我会推荐给去巴厘岛度假的朋友的。我们自己住了2次，以后也还会去。里面有很多小动物，非常亲近自然，泳池也非常多样化，适合各类人群。里面的建筑也非常有传统风味，住过旁边WESTIN， 还是觉得这里好。听说是努沙杜瓦海滩最早的一家酒店。怪不得里面的服务员有很多年纪都很大了呢", " ", " ", " ", "\n", "\nI like this hotel as it is very clean and with nice beach and view. However, the only regret was the raining when we spent the day in the hotel... But I will choose this hotel again if I have another chance to come.", "\n", "\nThe property is very well kept it is tropical with with beautiful gardens with streams , waterfalls, ducks, squirells and the architecture is amazing.", " All the management and staff were very professional, and caring considering that I was meant to go with my husband and due to unforseen circumstances went alone .They went out of their way to accomodate me and make me happy!They were very caring I was allocated a room with a shower and moved me to one with a bath when I requested it.", "They have entertainment almost every night and the food is high quality and delicious. I am going back before the end of the year and would highly commend the Hotel to anyone who likes to be right on the beach.I also enjoyed the sea there as there are parts of Bali that one cannot swim in the sea at the resorts.\n", "\nWas there on our 12th Honeymoon. Nothing can say about accommodation which was absolutely great. Great atmosphere to enjoy. Best choices of restaurants with great delicacies and theme dinner. The staff was very friendly,helpful and professional. Friendly resort for both families and couple. Highly recommended. ", "\n", "\nHad ten days at Nusa Dua and enjoyed every minute staff are wonderful nothing is too much trouble,breakfast is excellent and varied,grounds are immaculate .If I had to nitpick I would say the room was a bit tired and the heavy wardrobe doors would slide back and nearly take your fingers off but overall a lovely hotel in a beautiful area with a nice beach and wonderful staff.\n", "\nWe haven't even finished our holiday here yet and feel compelled to write something! We are having the most beautiful, relaxed time. We are on night 3 out of 11 and have many good things to say about the hotel....", "First, the staff are just gorgeous. They are friendly, very polite, have a great sense of humour, helpful and so eager to go above and beyond to ensure guests are well taken care of. ", "A special mention goes to Yoga who works at The Chess Bar. He remembers our names and what we like to drink and is excellent at his job. He is genuinely interested in people and cares about the quality of our holiday, making suggestions and recommending various places of interest. 10/10 to you, Yoga! Thank you for contributing to our relaxing time away!", "Second, the resort itself is very comfortable, extremely clean (staff constantly working to keep it clean) and the ambience is very relaxing. It's therapeutic just to sit by the pool, near the beach, in the gardens, or listening to the beautiful singers in the evening by the bar......there is simply no room here for stress, worry or concerns.", "Third, the food is delicious. Starting with buffet breakfast, there is a nice range to choose from without being overwhelming, I particularly love the omlettes made to order and crepes. The tropical fruits sourced locally are amazing. Jackfruit is my new found favourite fruit, but also the guava, mango and sourstrop are a delight to the tastebuds. We have found that breakfast keeps us going until dinner. The variety of food on offer is good and we have not been disappointed. Servings are sufficient to be satisfying. We are yet to attend the three dance shows/buffet dinners, so we can't comment on those yet, but expect nothing less than excellence!", "The cost of food and drinks in the resort is a little pricey for what we would have expected to pay in Bali. We cannot comment yet as to whether there are good restaurants out of the resort precinct that are easily accessible, which may be an option if wanting to spend less on food or drinks, however, in saying that, this minor critique has not in any way dampened our holiday or diminished the quality of our stay here.", "It is disappointing to read some negative comments on trip advisor about Nusa Dua Hotel. Perhaps some people are used to high end luxury that we have only some experience of and are making comparisons in that way, or perhaps some people can just never be happy and must find something to complain about. I don't know, but the minor complaints I've noticed people mention here, I haven't even noticed. I guess some people are just impossible to please.....", "We love it here and highly recommend Nusa Dua Resort to anyone who needs a break away.", "PS... As a professional singer, the harmonies these three fellas are singing at The Chess Bar are just magic!\n", "\nThis is by far the best Hotel in Bali ", "The GM Mr Klee definitely knows how to look after each and every guest the Director of sales Rubi", "Is flawless. The staff so kind and friendly . The food and service Manager goes beyond the call of duty and all the other Mangers and staff are so helpful a huge huge thankyou, I have had so much stress in my life, your kindness empathy has truely brought me to tears. Your hotel is definitely 5 star but to me the staff rate 10 stars, I am tearing up just writing this review on your beautiful hotel. ", "From the people that clean our room to the front line staff all so efficient with beautiful smiles . ThankYou so so much for making my stay such a beautiful experience . To all who helped organise my 50th Birthday ThankYou so so much , sad as the day was for me due to my daughter being unwell. I will treasure what you beautiful people did for me . Mr Klee and Rubi I owe you both so so much for all your kindness and empathy . . I do hope the owner of this beauful resort reads this as he should be so proud of the staff he has hired. Not only do they do a fantastic job, but they go way beyond the call of duty and they did that with me . I cannot recommend this hotel enough to people as it is world class. So professional so flawless ThankYou everyone I was blessed this week ", "Kind Regards ", "Jennifer Solomons .\n", "\nVery good beach, service, shows and the complex is really fantastic. The restaurant for breakfast has a wonderful lake, the lobby is beautifull, a theater in the middle of the complex where you can take diners with shows, a bar on the beach with live music. I reccomend it", "\n", "\nThe hotel carries a balinese feel. Most decor n room furnishings are wood crafted. Grounds are very clean, neat n tidy. Highly recommend Raja's restaurant. Excellent Balinese food with a twist. Only disappointment is the Spa. The Spa is located in a superb surrounding with a nice isolated pool away from main building. The therapist tho lacks training. Very mediocre... very average... below average.\n", "\nWe have travelled around the world the past 20 years and rate our stay at Nusa Dua Beach Resort one of our most memorable.I strongly recommend upgrading to The Palace Club as the privacy and service was excellent.", "All staff in the club were very caring and helpful, particularly Nona and Nyoman. The club offers great value for the money spent upgrading.", "Ron and Annette .\n", "\nWe have just enjoyed a lovely all inclusive 7 day luxury escape at NDBH&S in a Premier Room. Beach is better than others in Bali, grounds are immaculate and nothing too difficult for the staff. Will come back!\n", "\nIf you're looking for somewhere to just kick back and relax - look no further. This resort is one of the first established but still holds its own in both facilities and definitely price compared to some of its rich cousins along the famous Nusa Dua 'millionaires row'. The rooms are well appointed and comfortable and we would recommend getting one overlooking the pool/beach area as this is the heart of the resort. But surely staying in a resort isn't about your room, right? A room is for sleeping and the rest of the resort is for playing! Some great restaurant options, two fantastic pools and a beautiful beach - all a few steps from your bed... that's the beauty of this resort. The staff a wonderful which is the icing on the cake. Our day consisted of feasting on the great breakfast, down to a deck chair at the beach for the wonderful views and a swim at high tide, lunch on the beach or beside the pool, then back to a deck chair at the pool for happy hour (which goes for three hours). Dinner at the resort or venture outside the gates to a place like The Tavern when you're ready or if you care. A highlight of this resort is the wonderful pool bar - does life get more relaxing than sitting on a chair waist deep in water enjoying a beer or cocktail and simply plunging back for a swim to cool off every now and then. We met some great people as well which only enhanced the experience. Spa massages were great and just added to the relaxation factor! Great path along the front of all the resorts allows you to get a little exercise each morning - if you want! We took the Luxury Escapes package and it was great value. Will everything go smoothly on your stay - nah, this is Bali. Will you leave relaxed and satisfied overall - absolutely. Well done Nusa Dua Beach Hotel and Spa. Thanks for a great stay and we will be recommending you to anyone who asks!\n", "\nBrilliant.", "Whilst the breakfast bar and buffet were overcrowded the rest of the facility was great. Good service, good amenities and a couple of first class restaurants. The ability to work whilst away from the office was also a bonus.", "Thanks", " ", "\n", "\nwe have stayed many times as palace club guests at the resort and just love the place. We stayed 10 days and every day was a delight.", "The staff are very attentive and accommodating, nothing is too much trouble and we always feel very welcome.(We look forward already to our return )", "The rooms are spacious, clean and comfortable with a great atmosphere and the grounds are delightful and beautifully maintained.", "Only complaint we would have is that the pool is a bit warm , but that's out of their hands.", "We highly recommend the Nusa Dua Beach Hotel for a peaceful, relaxing,enjoyable holiday .", "\n", "\nExcellent value for a beach side resort in this area. Great open-air common areas, nice room for the money and good overall facilities. Restaurants were a bit pricey, but good quality food overall. Beach was well maintained, but quite a bit of seaweed, so not that great during low tide. Service was good, although I was a bit annoyed that they wanted us to pay for a late checkout; after a one-week stay and a generous tab that we'd run up I think they could have spotted us the room as a general 'thanks'... the place was not booked up. Couple of minor complaints: the pools close down at 7 pm (not sure why) and the concierge was not very helpful in helping use determine restaurants to go to in the surrounding area.\n", "\nThis was a very enjoyable experience. The Nusa Dua area is a tourist precinct that retains a lot of the true Balinese spirit - friendly helpful staff and a truly relaxing ambience. You can as we did, use this as a base for day trips to all parts of the island and then as a welcome respite after travelling through the absolutely chaotic but slow traffic - there are no shot cuts or quick routes to anywhere in Bali ! or you can while away the days poolside and on the beach. There is an excellent spa and exercise centre - air conditioned of course and again the staff are very helpful and friendly.\n", "\nwe stayed for six nights at the end of January in two adjoining rooms , not overly spacious but had enough storage and bathrooms great, pools are lovely with plenty of space and sunbeds ,Breakfast is great with good selection but other restaurants a bit of a disappointment with not a great choice and average quality for the cost, we used the gym and the spa pool also the early morning yoga which was a great experience, Wifi was good around the hotel ", "I was also disappointed in the customer service as we accidently left some things in the room which they said they never found\n", "\nWe booked a family deluxe room which were two inter connecting rooms. very satisfactory for adults and kids. The rooms and bathrooms were in need of updating, \"tired,\" the expression others have used. There was only one chair to sit on so television was watched from a very comfortable bed and wonderful pillows. There were two chairs on a rather squashy balcony which were a bit grubby and often wet from heavy showers. We had no curtains in the main bedroom so the morning light streamed in very early but I rang house-keeping to ask if the curtains could be put up again and they promptly arrived although only one curtain was available but it helped,Ok apart from those few negative observations it is a lovely resort in a perfect position on the beach. plenty of lounges, (needing wiped down by staff, but never happened!)under shady trees and umbrellas,The staff are delightful, helpful and courteous.The tropical gardens are beautiful and well maintained as are the lovely Balinese public areas.The Gecko kids club lacks a little enthusiasm from some of the helpers, at times.", "Breakfast was ample but never varied for the nine days we were there.We had one theme dinner , The Fire Dancers, were brilliant but not so the buffet meal. ", "Nusa Dua is a peaceful area and the Resort a good choice for a family holiday\n", "\n23 years ago whilst travelling to New Zealand with my mother-in-law, we stopped at the Nusa Dua fBeach Hotel or an overnight break. Our time in Bali left a lasting impression on my mother-in-law that during a return trip to New Zealand this year we decided to revisit Bali as a surprise for her. Naturally there was only one place we would stay.", "The friendlyness of the staff complete with their devotion to serving their guests made for a very enjoyable stay. It was worth the extra expense staying in the Royal club, which provided a welcome haven. Breakfast watching the ducks, squirrels, monitor lizards and other wildlife was so relaxing and provided calming oasis that was so much needed.", "The afternoon tea and evening cocktails were an added bonus as was the free Balineese massage and a cultural evening, which turning out to be an incredible sea-food BBQ.\n", "\nNice resort. Good location. We had a premier room which was lovely and short walk to pool. Unfortunately they are undergoing building works when we stayed there (end ofbFeb 2015) around the main pool and the noise was a bit of a nuisance if you plan to sit around or eat lunch by the pool during the day.", " ", "\n", "\nJust returned from a four day stay at this magnificent Hotel. From check-in so efficiently taken care of by Ms.Dian to departure where we wished a safe travel home by the Assistant Manager, our stay was one we will treasure. We upgraded to Club Lounge which I thoroughly recommend for the small extra charge. All the staff at Club Lounge were exceptional and a pleasure to meet. The Hotel is set in beautiful extensive grounds with a private beach, several pools etc. etc. We met the Manager at a small cocktail party, he was most charming and must be commended for running this Hotel to perfection. We were very sad to say good-bye to this Hotel and its wonderful staff.\n", "\nThe facilities are excellent. This is our second visit and it was outstanding, The spa is one of the best we have experienced.A most relaxing and enjoyable week. Your staff are very polite and most attentive, especially in the Palace Club.", "\n", "\nThis was the second time we have stayed at Nusa Dua Beach Hotel.", " ", "What can I say but we will return. We used the Luxury Escape Voucher, it is great value for money.", "The hotel and staff are the best.", "It was so good to come home to Nusa Dua after visiting other areas in Bali", "\n", "\nGreat place to stay, a very couple/family orientated hotel. Relaxing environment, staff are very quick to help with any request. The spa, pool and beach facilities were brilliant. ", "It was lovely to attend a number of cultural/theatre evenings within the resort. It really is a fantastic place to stay.", "\n", "\nEnvironment is good. Crew help very much. Room quite good but can be improve. Swimming pool already in renovation, what a a shame. Beach is quite nice. The wedang jahe restaurant was my favorite. Keep improve.", " ", "\n", "\nIt has a separate beach and a large swimming pool. And this a resort-style hotel has a variety of restaurants inside. You can enjoy a meal and soft drinks in the restaurant and then you can be able to spend a romantic time to walk to the beach. Swimming pool is consist of variously, and It have children's play area, spa system. So, this hotel is good place to stay with kids and parents.\n", "\nOur first trip to bali in March 2014. We were pleasantly surprised to walk into Nusa Dua hotel and spa and be treated like royalty, we stayed in a palace suite which was beautiful, staff were our favourite in the palace club. The hotel pools were so clean and staff cleaning the paths and the beach made it pretty all the time. There is also excellent security, we felt very safe. Breakfast and the dinner shows with amazing buffets were the best. Loved it can't wait to come back in June.\n", "\nWe spent 8 days at the Nusa Dua Beach hotel, staying in an ocean view Palace Club suite. Our room was very comfortable, the rooms are a little tired and the shower head could do with replacement. The grounds are immaculate and breakfast each morning at the Palace club was a wonderful way to start the day. The pools are good , great towels and shade is easy to find. ", "The Spa was wonderful, the range of services was excellent and quite good value.", "The restaurants are OK, Maduro has some tasty food but the Sashimi Chef needs a sharper knife! Dinner on the sand at the Chess Bar was a lot of fun.", "One real high point was the staff, wonderfully attentive, polite and very welcoming. You don't necessarily get the REAL Bali in the Nusa Dua enclave but what you get is a great base to explore from.", "Happy to recommend.\n", "\nWe loved the place, the atmosphere and the facilities. The staff are very courteous too. It's nice to have everything you need at the hotel. They even have an atm inside the property. ", "I prefer this hotel than Sofitel which has contemporary design.", "The driver who fetched us from the airport and who took us for two day trip was very knowledgeable of Bali and very polite too.\n", "\nAn Extremely peaceful &relaxing place to stay.----beautiful grounds which are so well kept & staff that are so pleasant,friendly & SO WILLING TO PLEASE.", "Food is well presented with some interesting choices.", " ", " ", "\n", "\nWe were very happy to find that the superb level of service & amenities was consistent with our first stay & highly recommend to anyone who is looking for great value in a resort style holiday. The staff are excellent & we love the extra attention staying in the Palace club. We look forward to returning on our next trip to Bali\n", "\nNusa Dua Beach Hotel & Spa is all time favorite Hotel in Bali for me & my family, so memorable. Nusa Dua is not far from the Ngurah Rai Airport, if you need airport pick up from hotel do not forget to mention to reservation team. What I love about this hotel is the hotel design & its has private beach. You will amaze with hotel design & decoration that show Balinese tradition. Nusa Dua Beach Hotel & Spa is old if you compare to another hotel in Nusa Dua but its still look excellent. The private beach is very quiet, you can do sunbathing or swim at the beach. Nusa Dua Beach Hotel & Spa has great swimming pool. The staffs are very friendly, they always greet you & smile to the guest hotel. The breakfast buffet is super complete & delicious, I love their pastry & ommelette. If you plan to spend time with your children at Nusa Dua Beach Spa & Hotel do not hesitate because they have facility like a children day care & they have a swimming pool for children. Oh ya, I suggest you to request the room at 1st floor with pool view, really recommended.\n", "\nNo bath in the room. Furniture is old, at the balcony always wet because of rain.no welcome drinks/ fruit. At the breakfasts only bacon and sausages. Stuff is really great! Hotel is good for children..", "\n", "\nThe beach restaurant was under construction so there was some noice when you were laying at the beach and at the pool.", "The restaurant staf from breakfast restaurant en Italian restaurantis not capable to work there. Touching our food with their fingers, not very hygienic.\n", "\nwe have spend our Chinese new year Holidays over there Which was fantastic. We are return guests and we really love the place. Fabulous service, great atmosphere, excellent location. We will be back soon\n", "\nThe spa was great and more than we expected.This will be the main reason for our return.The location is conducive to rest.The package for 8 days was good value.An option to increase the length would have been good.\n", "\nLovely setting. Wonderful garden areas. First room given was overlooking major building works. We requested a room change. This was arranged quickly and efficiently. This visit was arranged as part of a package together with a cruise.", "\n", "\nEverything about this hotel is excellent. The Palace Club facilities are well worth the upgrade. Breakfast,afternoon tea and cocktail hour all help toward a really wonderful stay. The room was so spacious and the hotel is well run. The beach location is perfect", "The staff are so helpful and friendly. A further visit will be on our agenda for the future", " ", "\n", "\nWe have stayed at the Nusa Dua Beach hotel on several occasions and it's an remarkable hotel in a superb setting. Very good service and the friendly Bali smile from all staff. On this occasion there was an unpleasent incident during the night by a group of fighting Russians and the management took immediate professional action and expelled the group from the hotel.", "We'll for sure return again !\n", "\nsuch a beautiful hotel location and staff. So relaxing we didn't leave the hotel. We loved the lap pool and we loved the change room facilities. Being in the Palace club was wonderful breakfast fantastic.", " ", "\n", "\nIn overall we enjoyed our stay at Nusa Dua Beach Hotel and Spa.", "Check in and getting rooms were a bit slow as they accommodate large groups prior to attending to our room. But from then on everything was smooth. Room was excellent. Our room was close to the pool. Pool was really nice. the water is warm enough that you dont shiver when first dip in the pool. Playground facilities by the beach to entertain kids. The atmosphere at the beach was very calm and relaxing. Be careful when you order room service though. We got a mixed up order. Just ensure you've double checked that the order is right before signing the bill.\n", "\nBeautiful hotel located on peaceful stretch of beach. Stayed every year since 1996 and never disappointed, this trip we stayed for a month. The Palace Club is well worth the extra with larger rooms and private service away from the main dining area of the hotel. Staff are wonderful and make everyone feel special whether its their 1st or tenth visit. This hotel is one of the few at Nusa Dua that you step inside and feel like you are in Indonesia decorated with classic Indonesian feel. This hotel will not disappoint with many restaurants, kids club, spa centre, gym and much more. Great for families.\n", "\nI have stayed here 4 times now. I just adore the architecture & layout of the grounds. The spa area is fantastic. They have a wonderful lap pool next to the fitness center & spa to use. The gardens are beautiful & create a delightful atmosphere. It's very large but I don't notice it except sometimes it is very busy at breakfast! It's the first hotel in this area & still reigns supreme for me! The spa does need new free weights & I know they are going to replace the old flooring. The staff are all very friendly & helpful also!\n", "\nWe had our honeymoon trip to Bali and this was the resort we stayed in...excellent facilities, serene and calm ambience and all too friendly and courteous staff....it made this trip a truly memorable one and we will cherish the memories forever.\n", "\nStayed after far east cruise. Large open plan hotel. Rooms in various blocks eg garden, pool or sea. View. Restaurants include Italian, Indonesian and Asian, also one right on the beach with beautiful sea views. Staff very helpful and friendly. Short walking distance to local market and some bars and restaurants. Lovely place to finish our holiday\n", "\nExcellent facilities and staff who strive to please. The Club option is well worth the dollars spent with breakfast, afternoon tea, canapes and cocktails on a daily basis. The theme dinners were great", "\n", "\nEverything was excellent except for a pharmacy emergency they didnt know what to do and kept transferring my call to the hotel shop. No transportation available to the pharmacy only by taxi we had to walk to the sho pping center. Very friendly and attentive staff and relaxing facilities. Very good food with a lot of variety.\n", "\nThe resort was very nice, excellent staff and service, but I booked my stay online specifying that we needed a room for 3 persons and upon arrival was charged double the price. was not happy at all with my experience with this resort as I had called beforehand to settle all these details and apparently they were ignored.\n", "\nStayed at the Bali Nusa dua hotel and spa, the hotel is ideally situated surrounded by lush gardens , ocean and a magnificent pool. The service is outstanding and our room was beautiful and clean . The hotel had numerous restaurants , we tried them all and couldn't fault anything . If your going to Bali this hotel is definitely worth a stay .\n", "\nThe surroundings and atmosphere was beautiful and the staff friendly and attentive. We had the misfortune of losing some of our luggage during the flight to Bali - the staff went out of there way to assist us with many phone calls to the airport and baggage service. After the four days without some of our luggage we were surprised when a basket arrived containing shirts, bikinis etc - a very welcome and unexpected gift. We were also very impressed to see the manager during busy breakfast periods assisting the staff in the dining area. I didn't mention the breakfast dining - the food was wonderful and there was such a variety. The Nusa Dua Beach Hotel is truly a little piece of heaven.\n", "\nHad a lovely week at the Nusa Dua Beach Hotel and Spa. The staff were friendly and welcoming. The food at the hotel was, in the main, very good - particularly the breakfasts and Raja Balinese restaurant. It was peaceful and relaxing and great value.\n", "\nStaff friendliness, location and hotel facilities were all excellent could not fault any aspect. The various swimming pools were large with ample space and the hotel was right on the beach it was a wonderful experience to stay at the Nusa Dua Beach & Spa Hotel.\n", "\nLove the hotel atmosphere, environment and beauty together with the upkeep of the hotel. I will definitely come back to this hotel as the personal touch the housekeeper did for my daughter as well.", "The only thing is that the breakfast spread need to have more varieties as choices are limited.\n", "\nCourteous & friendly staff, prompt service, neat & clean & great location. A couple of Indian/Mughlai/Chinese dishes in the restaurant's menu would have added to our delightful experience. Had a great time...:)", "\n", "\nEverything was fabulous from A to Z; except suggesting to add different varieties of halal food additional to the restaurants available on the hotel. As well, having a dock to connect our devices (pods,pads& iPhone) to be able to listen to music :) ", " ", " ", " ", "\n", "\nOur stay was part of a package- 3 days after a cruise. What an excellent end to our holiday. Grounds are extensive, very well kept and provide a place for all.", "Dining on the beach was just one highlight. Good pools and beach amenities. Very polite and helpful staff.", "\n", "\nIt is a great location, good swimming pool and excellent garden. However, the air conditioner could not make my room dry. I always felt little high humidity in the room. After midnight, you would be wakened up by a bird's shouting occasionally (three or four times per night). In my stay, I did not get a good sleep. The breakfast is so so. You may not find any good main course.\n", "\nStayed during Chinese new year, utilized vouchers that were won....needed an extra room and extended stay, resort accommodated our request to the tee....definitely stay in the palace club, breakfast there is great with a nice relaxing view of the gardens....beach is great, semi private and not crowded...pool area is well kept, and staff are willing to meet any request, definitely will stay here again in the future\n", "\nThis is one hotel where an upgrade to a club room is well worth it. Brilliant staff, exquisite breakfasts and some of the best classic cocktails during cocktail hour. But it doesn't end there, at check-out, with your Limo waiting to take you back to the airport there is even an offer to send an extra hotel person with you to help you with the airport departure. The GM's namesake might have been a brilliant abstract painter, but there is nothing abstract about his management of his hotel - perfect bliss, try it for yourself.\n", "\nStaff friendliness, food quality, location and hotel facilities were all excellent could not fault any aspect.", "The various swimming pools were large with ample space and the hotel was right on the beach it was a wonderful experience to stay at the Nusa Dua Beach & Spa Hotel.", "\n", "\nHad the chance to spend 5 days on this amazing hotel; was upgraded to the palace club room n it killed it all. All what I can ask for more option for \"Halal food\". Special thanks to everyone at the hotel starting with reception \"front desk\" & ending with housekeeping .. Suggest focusing more on the cleanliness of the toilets ..\n", "\nThe Balinese restaurant was great and I was happy to see gluten-free pizza available. But other than these the food is not great. There was a miscommunication so we didn't get picked up at the airport but they were quick to upgrade our room and offer free return transport to the airport. There was also some construction going on right between the pool and the beach which wasn't indicated at the time of booking. ", "\n", "\nNusa Dua Beach Hotel & Spa is a wonderful place to stay with lots of opens space, greenery and a beach adjacent to the hotel. Gr8 swimming pools and lovely staff to assist. Very comfortable - though on the dining part was looking forward to some Indian dishes. Tad disappointed at that.\n", "\nWe didn't choose this hotel ...it was booked as an add on package to a cruise.", "We were delighted when we arrived and it made a wonderful end to our holiday. We stayed for three days at this exceptional hotel. All the staff were very friendly and helpful. The grounds were beautiful, the public areas were well laid out and stylish, the pools and beach were stunning. We tried all the restaurants and the food and service was outstanding. When we arrived we were delighted that our room was upgraded to a suite...it was superb.", "Thank you for a wonderful stay.", "Ruth and Stephen White\n", "\nExcellent stop over to complete our holiday. Comfortable and plenty of facilities. Only used as day room but facilities were exactly what we needed to refresh and relax on way to airport. Felt we had the same service for our short visit as we would have had for a longer stay.", " ", "\n", "\nStayed in this hotel for 3 days following a cruise. A lovely way to end the holiday. Hotel grounds beautiful and fabulous access to the beach. Rooms were spacious and comfortable. Buffet breakfast was very good and we were lucky enough to be there for Chinese New Year when there was a buffet and stage show in the gardens. Very memorable.\n", "\nOutstanding hotel to go with a family. Palace club suite have us plenty of room for 3 adults and 2 children. Would definitely come back. If I had to find a negative, apart from the eggsat breakfast the hash browns and other sides come out cold. Be nice if all the breakfast was hot\n", "\nWe stayed at this hotel for 5 days whilst travelling back from a month long tour of New Zealand. The staff are very obviously well trained and extremely polite to guests. However, the hotel room we had was very old and in dire need of renovation. The furniture was chipped and scratched, the terrace furniture cushions heavily stained and the bathroom had not been updated for many years. I was reluctant to even use the grey, old towels and face clothes.", "We also encountered another issue which was totally outside of our experience of staying in hotels. Due to the Chinese New Year there were many Chinese guests at the hotel who insisted on spitting and snorting into the swimming pool and picking food up from the breakfast buffet to smell before they decided to put it on their plates! ", "Not a pleasant experience I'm afraid and certainly not one to be repeated.\n", "\nThis was our second time visiting this resort, 15 years after our first visit. Why did we ever wait this long.... Since our last visit, it has been transformed and revitalised. ", "The food was fantastic, the rooms extremely comfortable, with the beds and pillows out of this world! We have not slept like that in years!!!", "With the people and staff we met during our stay, we had the best 10 days in a very long time.", "Thank you and see you soon :)", "\n", "\nThis is a great property with excellent staff. But the infrastructure badly needs maintenance. However, if it is all refurbished, the room tariff would probably be at twice the prices you will find them for now. Currently staying at the hotel and it is great for kids. We have an excellent babysitter and are enjoying ourselves here. However, the room we have is tiny and this is after we were told we had gotten an upgrade. They charge for wifi and after a few days, the food options can seem limited. But the food is delicious and is always well prepared. Would love to come back, but would hope to get a larger room for our stay.\n", "\nWe have stayed i Nusa Dua Beach hotel & spa 4 times in the last 15 years. It is the best hotel in Bali. The hotel staff is excellent and verry kind. We love the beach and enjoy very much the spa. The palads Club is absolut a very great experience.You vil never find a better place to stayed in Bali.", "\n", "\nhad a very great experience and everythng in hotel is very convenient. from open fish aquarium till open beaches evrything was great. 2 swimming pools is also great attractions", " i recommend this hotel to evryone the one in group tours or couples the best place\n", "\nI dont know why I didnt do this review 7years ago!!!", "We got married on the beach here and it was just amazing, the wedding co-ordinator arranged everything for us and went above and beyond to make sure our day was perfect. We had a romantic seven course meal on the beach in the evening which put the cherry on the cake.", "The staff at this hotel are brilliant always smiling, the room was beautiful and the grounds truly wonderful, we had a week before our wedding to chill and five days after ..... could have stayed longer. We went to seminyak twice for a feast on the beach of fresh fish caught that day, you select your fish and they cook it for you, plus you have the bonus of an amazing sunset. You can get a taxi to take you around the whole place for the day and it is so cheap to do just that. I wouldnt want to drive there myself as it is a bit chaotic - with whole families perched on mopeds coming at you from every direction", "I really hope we can go back there again soon.", "We went in October 2008 and the weather was glorious\n", "\nafter reading great reviews, we booked this hotel 4 3 nights. we arrived to a gorgeous lobby n excited bout our stay. that's until we arrived in our room, the deluxe room was small, not clean, cramped, when u sat on the toilet, one elbow hit the shower screen, the other the bench, it was tiny! the outdoor balcony chair cushions were saturated from the previous days rain. we called reception & after repeating myself 3 times, she finally understood & said she'd sent more cushions up, 45 mins later, I called again to tell them no one had come and spoke to a guy who couldn't understand English then another girl who I had to repeat what I was saying 3 times, finally she understood and sent someone up to change them. ", "the bath was very high and it was difficult for my mum to get into the shower, the place was tidy but not properly clean, we had no free wifi in our rooms which was a requirement for us when booking, infact it was an extra AUD11 per day which I was angry about as we booked requesting free wifi in our room, it was only free in the lobby and around the pool. when I asked at reception, the man was very rude and told me that nothing could be done bout my mothers problem in the shower and the wifi issue was my misunderstanding as its just not included then he walked off on me as I was communicating with him at the reception desk. I was furious!", "the next day, breakfast was better than I thought it would be. the pool was nice but very crowed as its a very big hotel, we couldn't find much shade around the pool. Still furious, I spoke to someone else who upgraded us to the palace suite with free wifi and a stand alone shower which was better for my mum. the room was not very nice however better than where we came from. ", "that night we climb into bed, 1 bed had dirty sheets and the others sheets were all wet. things just kept getting worse and worse, the guy who came to change our sheets told us that it was moist from the aircon but we'd been out for the last few hours and the air con was off... he changed it but was obviously annoyed. ", "the hotels restaurant on the beach was excellent. we ate there 2 nights in a row. we made friends with 3 other groups, one said they were in the top notch suites which was $4000 for 7 nights and it included everything, they were estastic, another group complained that it's the worse hotel they've ever stayed in as a 5 star, they called their travel agent back in Aust and complained which then got them upgraded, another group tonight was sooo upset, they was about to go and cancel there remaining nights and find another hotel. this is far less than a 5 star. we are so disappointment and will never return here. ", "\n", "\nWe stayed here for 14 nights for our honeymoon. After 3 days in Bangkok. What an amazing, beautiful place. So relaxing, so blissful... Definitely a place for a romantic honeymoon. Gorgeous, long sandy white beach. Very quiet, almost like having the beach to yourself. The hotel was out of this world. Very large, comfortable and clean rooms. Staff cant do enough for you. And the food was first class. A definite must, dream holiday.\n", "\nMy family and I stayed here last Easter for about 10 days. There were definitely some good points about the hotel, but there were some things that left a lot to be desired. Firstly the rooms: two communicating rooms which were decent enough but could do with being updated and our bathroom desperately needed a renovation. The pool area was extremely dangerous as the type of stone that surrounds the pool becomes very slippery when it is wet (which is pretty much all the time) and we all slipped on it at different times. The Maguro restaurant was fine the first time we went, but the service and quality of the food the second time was dreadful: my daughter and I could hardly eat one bite of our meal as all is seemed to be was fat, and trying to get the attention of our waiter was near impossible after a couple of Asian families came in. ", "However, the breakfast was amazing: food, choice, staff were a credit to the hotel and unfortunately one of it's only redeeming features. ", "There seems to be a lot of staff but not everyone seems to know what they are supposed to be doing. We wanted to book a day trip somewhere and asked one of the staff members where we could do it, we were pointed towards a desk but no one was ever there. We ended up doing it all ourselves via viator.com. And don't get me started on having to pay for wi-fi in your room: outrageous! Also, don't bother trying to send postcards via the little store in the hotel - it took six weeks before the even bothered sending them out!", "I had heard a lot about this hotel, but ended up incredibly disappointed.\n", "\nMy experience at the Nusa Dua Beach resort was a good one mainly because of the location with beach access and beautiful gardens. All the staff at the hotel were very friendly and helpful and well trained. The public rooms were beautiful and well kept but our deluxe room was a bit tired and we did experience a bit of noise from garden renovations under our balcony perhaps we should have chosen a club room. We would return to the hotel but hopefully to a better room.", "\n", "\nThx for upgrading my room to palace suite. I was so enjoy this hotel. Calm,wide, clean, friendly, pretty garden and relax atmosphere. Even though only 1 night I enjoyed it. I will recommend it to others. ", "\n", "\nWe love the friendly and efficient staff. Our Deluxe room was excellent all you could want for. Buffet breakfast each morning was a wonderful start to the day and the variety of dishes amazing. Already planning our fourth stay.\n", "\nMy wife and I live in Western Australia and have just had a fantastic 8 night stay at the Nusa Dua Beach Hotel and Spa. This was our 5th trip to Bali but our first at your facility. We were so impressed we have just booked another holiday at the hotel for June 2015 and will be bringing ten other family and friends with us for my daughters 30th birthday. She and her husband will be traveling from England to be there! Thankyou to all at the hotel for making our stay so enjoyable that we are now already starting to get ready for our next adventure at your facility. Your attention to detail and friendliness of staff is much appreciated.\n", "\nWe stayed for 8 nights on the luxury escapes package which was fantastic value. It included 3 theme nights with shows and dinner and they were all great. The spa treatments which were also included were fantastic too. The spa pool was beautiful and was always so quiet and relaxing as not many people seemed to know about it. The other pools were all gorgeous and we didn't ever have a problem getting a sunbed. Water aerobics was a lot of fun. The pizzas at Sandro's were lovely and it was a lovely spot to eat looking out at the pool. There were cute squirrels running around and they love to be fed pineapple. The breakfasts are amazing and it's just so relaxing to sit by the beautiful pond and watch all the fish, lizards and birds while you listen to Balinese music. I miss it so much and we would return in a heartbeat. Very easy to get a cab out the front to take you anywhere you want to go at a very cheap price. Do yourself a favour and stay here. The Balinese staff are so lovely and friendly too.\n", "\nfabulous hotel if you are looking for a relaxing holiday, away from the hustle bustle of Kuta/Seminyak. Staff so helpful, many have been there for up to 20 years! I was shocked that the hotel is 30 years old! It is in excellent condition. Food excellent, facilities too. spa is fab as are the staff there. Will be staying for 3rd time in June! Can't rate it highly enough.\n", "\nwe stayed 3 days as our honeymoon. our room and facilities were just as we imagined for a resort hotel. The breakfast buffet was excellent but our dinner at one of the hotel restaurants was not satisfactory for it's high price.\n", "\nNuas Dua Beach Hotel was a great experience. The staff were particularly helpful and attentive and could not do enough to make our stay more enjoyable. We would recommend this resort and hotel to anyone looking for a relaxing break combined with excellent service. ", "Donal & Rosarie\n", "\nThis is our second time to your resort and we loved it just as much as the first time will definately be coming back looking forward to seeing what the new bar and restaurant looks like when completed ", " ", " ", "\n", "\nA year has passed since our last wedding anniversary. This year we return to Nusa Dua Beach Hotel for our 19th anniversary. We find this hotel as our sanctuary. As last year, sweet complimentary placed in our room. We love the roses, wine and warm hospitality. In Nusa Dua we feel \"grand\" Bali. The beach behind the hotel is whitely spread, so private and secluded. The warm water swimming pools is clean and clear as usual. We spend the whole stay enjoying the beautiful atmosphere around the area. Wide selection of breakfast, bicycling, sunbathing, swimming, sauna and spa, truly relaxing our body and mind. Thank you for making Bali a wonderful destination for us\n", "\nNice view.i like beach and swimming pool ,but only the think toilet room.i called two times to repair tub bath because it's blocked.first day I waited 1hour for help from housekeeping department.they never shown up until my third call.\n", "\nThis is a hotel we would recommend and use again with a proviso. Our stay was via the Luxury Escapes package and we found the experience almost perfect. The staff are outstanding with their friendliness and level of service. Top marks to management for this, in particular their choice of young Mertayasa at the Chess Bar. We like the Balinese design and architecture, the location was fabulous, and the food at Maguro and the Raja perfect. The Chess Bar restaurant on the beach had some issues with food quality and menu however the service was very good. Sandros was consistently good. Breakfast offered a wide range of choice and the \"egg station\" man is definitely the hardest worker of all.", "Finally the wonderful holiday turned rather sour when at checkout, the arrangements were not initially honoured. Fortunately we had the documentation and we can only surmise that the staff were confused with our earlier Luxury Escapes package and the most recent one which varies significantly. Still it took 30 minutes of our time to sort out and should not have been necessary. Nonetheless, take your documentation and enjoy the stay safe in the knowledge you have proof of arrangements. The checkout person had the temerity to suggest our understanding was the result of verbal discussions until we produced the documents.\n", "\nThis holiday was well 'overdue' for my wife and I and the Nusa Dua Beach Hotel & Spa did not disappoint. we travelled with 4 couples (8 pax in total) and we were well looked after.", "The Spa is sensational and good value for resort standards. We weer on a package that included some treatments and heavy doscounts on other treatments.", "The service is excellent, and nothing was too much trouble. The Pool Bar attendant - Mushadi - is a gem and it is no surprise that he has been with Nusa Dua for many years. The Happy Hour is sensational", "We cant wait for our return trip.....\n", "\nHad the great pleasure in staying in a palace club suite last year. The best hotel experience I have ever had. The staff were sensational to me and my children. Now I find out The rules have changed and I am no longer allowed into palace club because I have children. I was looking forward to returning in September but now will never contemplate booking this hotel again as My children don,t appear to be welcome\n", "\nI stayed here in the very first year it opened 30 odd years ago , was great to come back , rooms are a bit dated , facilities are a bit dated , service is FANTASTIC when its simple things , food at the theme nights was terrible to say the least , same old buffet style , cold , uninviting . breakfast however was better than average . the high light of our trip was the pool bar attendant MUSHARDI ,,, he has been there since opening day and he has perfected the pool bar atmosphere in the 30 odd years ,,, drinks and food expensive on local standards , but on par with Aus prices , but you expect that at 5 star resorts on the beach ,,, would I go back YES , would I do buffet dinners NO , it was our 10 wedding anniversary and we had paid for a pool view room , the AC Unit was broken and they upgraded us to a Club room , but no pool view that was a disappointment as we were separated from the rest of our party , the hotel did not charge us for the upgrade to pool view as compensation , but I would have preferred the pool view as it was just a nicer setting. over all a good experience ", " ", "\n", "\nWe (4 couples) recently stayed for 8 nights on a Luxury Escape deal. We upgraded on the deal to a Premier room as we did not want to be in a room too far away from the pool. Later we contacted the hotel and we all upgraded to a Premier room with a pool view at $25USD per night. Worth every cent. We were lucky enough to get the ground floor and were just a few steps from the pool area. This hotel is an oldie but is excellent and so are all the staff - everyone! We were treated like royalty. I highly recommend this hotel.", "1. It was our 10th wedding anniversary and the hotel delivered a flower arrangement of one dozen red roses and decorated the bed with 2 more roses, towel swans and rose petals, also left a heart shaped bowl full of rose petals and buds on the bath tub. This was very unexpected and lovely.", "2. The Premior Pool view room - large room very close to pool with sea view as well, huge king bed very comfortable, separate toilet and large bathroom. Shutter doors and glass sliders to veranda which had 2 wooden chairs and a table. Loved the room, however, I think for the price, housekeeping could have been better, for example, the toilet door was timber slates and it was full of dust. and the walls in the toilet I thought could do with a scrub. On the whole thought it was a great room.", "3. The resort, yes the resort was built in 1983 and it is showing its age with the stone work and pool tiles etc - some pool tiles in the \"kids\" pool were coming off and in fact I picked one up off the floor of the pool. The kids pool is also good for adults and its nice and shady and also deep. There are very few kids here as it is not aimed at children. The main pool is fantastic, very deep - for a change:)). The tiles above water level need a good clean and I hope now it is the off season, this will be done. The reception and all areas of the resort are very vice and well set out. They are building a new restaurant on the beach front over the next 6 months of the off season but it was little noise and did not worry us. The guests should have been warned about the awful fumes in the hallway from varnish from the renovations to the pool view rooms - it was very bad and I really think the whole area should have been closed off and no one allowed to use the rooms around the renovations. very nauseating. ok once inside the room but walking in the corridor you had to cover your face. ", "4. The Spa - this is situated at the front of the hotel. All staff are professional and treatments very good - in the luxury escapes deal - you can only have the scrubs, wraps or massages - I tried them all and were fantastic. Facials or anything else on the spa menu were discounted for luxury escapes people.", "5. Restaurants - all the bars were great too. Drink service at the chess bar was incredibly slow waiting for drinks to arrive. The food at the shows (buffet) was not good,very poor in fact - except the desserts which were great. The hot food was dry and awful - a couple things were ok such as the oysters and fish sticks. Pizza and chess bar had great food - our friends went to the chinese restaurant and said it was excellent. Lobby cocktails very nice. The drinks menu at the pool bar was limited, however, the pool bar man \"Machardi\" would make anything you ask for.", "6. Staff - All staff were 5 star and the hotel should be pleased they have such a great group working for them. I make special mention of the pool bar attendant, Mr. Machardi and his new \"apprentice\" we called\" smiley\" - Smiley he trained in the restaurant and was fantastic then was promoted to the chess bar but worked with Machardi - he was very proud of his achievement and will go a long way in the years to come. Machardi has been working at the hotel for years and was great to have a conversation with. However these are just 2 of the many staff that went out of their way to say hello and made you feel welcome. No complaints at all.", "The beach area was simply gorgeous and the shopping area called \"Bali Collection\" which was full of shops and restaurants was a quick free luxury bus trip up the road or a good 15 min walk - the bus worked well for us. Just outside the \"Security gates\" of Nusa Dua is a small village where there are market shops and restaurants - go to one called the Tavern, great food and great staff and bar - free pick up and drop off from hotel. You cant miss it as this area is not big.", "Luxury Escapes - this was a good deal, we got free laundry for one day unlimited, 3 dinners with 3 different shows (although I thought the food was awful- see above) and the shows were very good. 6 x 1hr spa treatments, free cocktails etc etc etc and list went on. Well worth money.", "Ok, so our airconditiong broke and it took a day for someone to come to look at it, we didn't sleep for a couple nights due to the heat. The hotel offered us the same type of room upstairs - however, we had a GUARANTEED downstairs pool view premier room - as the hotel were refurbishing the other downstairs rooms we could not have what we booked -so they gave us a larger room (club premier room) ground floor but no pool view. They considered this an upgrade. To us it was NOT an upgrade as we did not have the pool view only garden and we were not interested in using club facilities as we wanted to be with our friends for breakfast and evening cocktails not stuck in a room without them. They did not charge us for the pool view room which was fair however it took many phone calls to get to this point as they did not understand that, to us, it was not an upgrade and we were not paying for something we did not get. At the end it was sorted out but took some arguments and back and forth phone calls which were very annoying..... The ground floor was more important to us as I have a knee issue. Not to worry. The hotel sent 2 gifts and a flower arrangement and an apology note which was very nice once it was all sorted. ", "Would I go back - YES in a heart beat but I would only be happy with a premier pool view room as we love swimming and looking at water - I can look at gardens anytime. Would I use Luxury Escapes - YES but I would also look at the hotel website as they had a similar offer and I always prefer to book direct with hotel, just my preference. ", "All in all a great hotel, great staff, great spa, great holiday.\n", "\nA very pleasant week,outstanding service by a friendly efficient staff,the only weakness was the in house computers were not working satisfactorily.", "The restaurants offered a wide selection of menus ,with polite efficient staff.", " ", " ", " ", " ", " ", "\n", "\nThe ground are immaculate however the room and personal courtyard was looking old and unclean. The electrical switches didn't coordinate leaving no option but for the bathroom light remaining on all night and having to put robes and towels and the shutters between the bathroom and bedroom to keep the light out. After 12 years of visiting bali had my first case of bali belly on the first morning after eating breakfast and remained I'll for the duration of the 3 days - so glad to move onto our regular resort.\n", "\ni have stayed at this hotel 3 times in the last 15 years and it keeps getting better each time. ", "the range of pools are great and the spa pool is not discovered by many until late in the stay. It is a gem of shaded lounges around a lap pool. the water aerobics was fun and the overall staff attentiveness was exceptional. we feel we got to know many of them personally over the 9 days.\n", "\nI have stayed in 6 other hotels in Nusa Dua and have stayed here in my last 2 trips. It's one of those hotels that give you the \"feel good\" feeling. I love the spaciousness, after all it is a pretty huge development. This hotel has been around for quite some time but you can tell that it's been pretty well maintained. Service is great and the buffet breakfast is pretty good too. ", "One thing not to be missed here will be the Balinese massage treatment at the SPA. Most of the therapists have been working there for more than 10 years and they all know what they're doing. ", "I'll definitely return whenever I would want to stay in Nusa Dua.\n", "\nI stayed at Nusa Dua resort for 8 days with my family (5 yr old girl). Being my first trip to Bali I can say I had great time and returned with good experience. I will list out my plus and minus points as follows:", "Nusa Dua resort Plus items", "Safe and clean location", "Kids club", "Friendly staff", "Bali collection and connecting shuttle bus", "Wedang Jahe Breakfast restaurant set up", "Easy access to water sports at Nusa Dua Beach", "Well serviced rooms, good size deluxe room for three persons", "Efficient room dine service in day time", "Minus items:", "Kids play area (isolated and abandoned)", "Restaurant (expensive and very limited choice for vegetarians)", "Spa (very expensive)", "Charges for using bikes, tennis etc", "No amusement features in pools (such as slides for kids)", "No aircon in front lobby\n", "\nA relaxing experience with ample space and clean environments. Suitable for couples who want to relax and not leave the resort. The squash court is also great and being able to play with staff is also good.\n", "\nComfortable room, great pools, picturesque gardens and peaceful atmosphere. What more do you need? This was our second stay here and I was travelling with my 12 year old daughter who agreed this was a great place to stay. We left totally relaxed, happy and happy to stay there again.", "\n", "\nMy family and I stayed at this hotel in Aug 2014 (very late review). We got the Palace Club Room and had fantastic benefits - private check-in, our own place to have breakfast and more importantly, a spacious room! The grounds of the hotel was beautiful just to walk about and the private beach was definitely a plus point! Would definitely go back!\n", "\nWe had a three night family stay and really enjoyed the experience. Building getting a bit old but loved the Balinese architecture and feel to the place. Would recommend it. Good variety of restaurants. Friendly staff. Good variety of activities and pools.", "\n", "\nWe had an eight night stay through luxury escapes and really couldn't be happier. I did expect my room to be more luxurious as they are a little tired and run down in that department. The location excellent, food and drinks just like back home, breakfast had the lot. I would have liked to see a sports bar in the complex as I kept going back to my room to watch the tennis. Drinks by the pool could be cheaper as I would have had a lot more of them. Would definitely return.\n", "\nExcellent service, hotel traditonal style but all modern conveniences available, great location. Friendly helpful staff. Great food, close by shopping and dining at Bali Collection via stuttle bus on the hour.", " ", " ", " ", "\n", "\nThis is a beautiful resort, layout, location, and available amenities. The spa area had a great 30 meter, two lane lap swimming pool in a really tropical environment. Plus the spa / pool area was separated from the main pool / beach area. Much of the design and construction took the existing trees and plant life into consideration so the pool areas have some natural shade. We never left the resort. Our only disappointment was the over pricing of food and beverages at the resort, also some of the menu selections were not good. Having to pay over $3.00 USD for a Diet Coke at the lobby store is a bit high.\n", "\nI like the view when I entered the gate of this hotel especially in the evening, I can feel the ambiance of Bali with the little light of the lamp, it was great. The location is great, is not far from the main gate of BTDC. This is huge hotel. The room was good. The facility and the service was great, I asked something for room service in the middle of the night and they were quick serve us. The swimming pool is big and there is also water aerobic in the morning which made our holiday more fun.In spa area, there is also little pool which is more private and also you can use the whirlpool and sauna. But what I like it most is the price was not as expensive as others in that area which you can have a 5 stars hotel and direct access to the beach, because I love to see the sunrise in here. What to look for in Nusa Dua, besides sunrise and tranquility. This hotel is no less than any other new hotels in the surrounding area.\n", "\nwe bought a package deal online for 2adults and 2 kids, which was good value for a total of 16nights at Nusa Dua Beach Resort. We go to Bali regularly and know the area and thought we'd try a different resort to where we usually stay. Although our package was good value and included meals at the resort and spa treatments, we were disappointed a little with the quality of the food. Food wasn't as fresh, ingredients used for omelettes and the like appeared processed, not great quality and the poolside food etc was pretty ordinary tasting yet pricey for what you got. We've stayed in other resorts in the area and found their quality of food much better, tasty and fresh. With small kids as well, the lack of milkshakes with ice-cream or iced chocolates was disappointing. As for everything else, we got good value out of our package, but the overall atmosphere was not as good as it could be, ie, a bit flat. The staff etc were helpful and friendly. The room was clean, but housekeeping could be a bit more thorough in their work. It was 'nice' and the pools were great, having \"kids club\" was handy (although they could be a bit more creative in the activities they offer for boys!). I think if they upgrade their pool-side and in-room food options, they would be better.\n", "\nHad a great time in Nusa Dua with the family.", "Nusa Dua Beach Hotel and Spa was a treat. It has beautiful gardens and grounds, is on the seafront and has the most amazing view of the ocean. The food was fabulous and the service terrific. Couldn't have wanted anything more.", " ", "\n", "\nI've traveled the world and stayed in all sorts of Hotels/Resorts and I can not fault this beautiful Hotel. The presentation from the moment you enter the grand and peaceful foyer is stunning and will set the pace of your stay. The staff are courteous & offer a gracious Balinese charm.", "Our rooms were well appointed and modern, with lovely welcome notes and fruit bowls. You will fall in love with the grand and heavenly bed pillows. The breakfast buffet is superb with a huge array to suit all tastes. With a full hot and cold menu, the freshest of fruits, cereals, yogurts, bircher muesli, Eggs any style, pancakes & waffles for the kids (Don't go on a diet here). You must try the muesli cookies.... Their DIVINE :)", "We had a huge list of places to go in Bali...and simply never really made 3/4 of our list. We glided & floated in the pools, and sipped cocktails and nibbled on Italian delights reading pool side with fast Wifi. Large scented Frangipanis fall around you and seduce you into holiday mode..", "We traveled with our 15 year old teenage son and he was even happy. There is a brilliant walk along the foreshore and he found a great spot to body board at the end of the point.", "We are definitely going back, a wonderful Hotel and we felt exceptionally safe with the most update to security. A must do ;) WE love this Hotel 10/10\n", "\nAn excellent environment with wonderfully accommodating, helpful staff! Palace Club room / suite had truly pleasing associated benefits - a must re upgrading if you choose to attend! Showing signs of age but the resort has soul / character that the newer venues lack. Beautifully located near beach, pools fabulous and spa area excellent especially the tranquil pool! Tennis, squash, gym and games area all added really well to the experience! Very safe, secure set-up. Highly recommended though in house costs are a little expensive if you are not in the Palace Club rooms - you simply must upgrade as it is great value!!", "\n", "\nA calm high quality hotel in a beautiful setting with very charming and helpful staff. Enjoyed the breakfasts (we didn't need lunch). The music in the lobby bar was first class. The Chess bar on the beach with free juice and coffee to watch the sun come up each day was magic.", "\n", "\nAn excellent hotel that was not too expensive. Fine and friendly staff. Food was of high quality. Just a few improvements needed in some areas. For example, I was accidentally charged for a dinner when it was covered with a pre-paid voucher. But, in general, a wonderful stay at a glorious Balinese-style hotel. My wife and I thoroughly enjoyed a romantic dinner in the poolside gazebo. Excellent waitress. I will come again.\n", "\nOur entire stay at the Nusa Dua Beach Hotel and Spa was a wonderful experience. The hotel itself is beautiful, from the grounds and gardens, pools, beach and the details that have been so carefully attended to like little statues, carvings, ceilings and lamps. The room we were given was also great, looking over the main pool and across to the beach and the service throughout the resort was amazing. The hotel has a lovely beachside restaurant as well as a great breakfast setting and a very nice spa and sports centre (with tennis - a playing partner included, squash, great gym, billiards and table tennis) and offers free photos for couples, sunrise yoga and a great running track (which goes up and down nusa dua past all the hotels). I found this hotel absoloutely perfect to relax, exercise, eat well and to just enjoy Bali. Even not having wifi in rooms was a blessing in disguise as I was able to switch off and enjoy the holiday but then connect at breakfat if I had to. We went in low season which was good - hardly any kids - but this would be a good option at any time.\n", "\nWe stayed 8 nights and had the best holiday. Was better than I could of ever imagined. Staff were fantastic and so friendly they would do anything for you. Would recommend purchasing the packages as it is good value for money. My only negative was the traditional dance shows. It was very difficult to follow the story and the mc was very difficult to hear she needed to project her voice and use more clarity. ", "Cannot wait to return. Hope everyone else enjoys this resort\n", "\nPros: lots of them. Very relaxing, quite, yummy, spacious, entertaining. Loved the food carving class. I learnt few easy and engaging ways to feed my kid. The Raja's restaurant was nice. The grill at chess restaurant was definitely interesting.", "Cons: I have been to 2 dances the kechak and legong dance, both of them don't have voice. I really wished I understood what they were doing. They gave a brochure and expected us to remember everything. Most costumes doesn't really depict a character. I advised the announcer lady to tell a sentence of what is going to happen in next 5-10mins every 10mins, which would greatly help our understanding. She didn't seem to want to learn as it was same the next show. Ah don't sit close to the musicians in legong dance, you may lose your hearing abilities.\n", "\nAfter a very long flight, it was very refreshing to come to an beautiful oasis. The staff were especially friendly and so helpful. The gardens are lovely and peaceful. There's such a relaxing atmosphere, you felt as if you at home, but better. Nusa Dua is so far from where we live, otherwise we would visit soon. Suksma all for such a wonderful stay and please keep doing what you're doing. Hopefully, one day will return.\n", "\nApologies for the late write up. Though travel often gets in the way, fond memories fades away but slowly. We stayed at Nusa Dua Beach Hotel and Spa 16 to 23rd October 2014. We found our stay experience and enjoyment just wonderful. We loved the location, settings and general level of service. Staff were ever so kind, helpful and cheerful, specially, Ade at Raja Restaurant where we had our favourite table and ate delicious meals in the evenings. Birthdays and special celebrations are never forgotten ... so thanks for the beautiful huge birthday cake, flowers and arragement in the room and at Raja's restaurant. The Hotel though seems dated in parts is still full of charms and we would like the authenticity and feel of Bali retained. Free wifi is available in the lobby area.", "We would definitely return here.\n", "\nCannot wait to stay at this gorgeous resort again! Perfect for the whole family. You do not need to leave this resort as everything you could wish for is here. Spa, lap pool, gym, kids club, restaurants, bars", "\n", "\nThis place was awesome coming from a picky traveller like myself!", "Rooms were clean and comfortable, staff were friendly. Most importantly the breakfast buffet was awesome the CREPES were to die for! Dinner at the Raja hotel was also awesome the DUCK is a must try!!!", "The free shuttle to Bali Connection from the hotel was disappointing! Total rip off.", "Hotel was awesome roughly $150K to Kuta and $70k to Jimbaran Bay from the hotel.", "Personally I found Jimbaran bay to quite disappointing and over priced seafood compared to other parts of Bali!", "Overall an awesome stay at the hotel. Thanks for making a great first impression of Bali on me.\n", "\nA warm traditional holiday in Bali. Excellent facilities wonderful position, only a short walk to the Bali Collection and a cheap taxi fare to other Bali wonders. Safe secure friendly environment. Loved it.\n", "\nWe stayed here after leaving our first hotel due to the location. Thiswas absolutely perfect. The service is amazing anything you asked for you got. The food at the couple of restaurants was very yum and affordable. The location is great and not to far to travel anywhere. We will be staying here again on our next visit!!\n", "\nMy wife and 8 year old child recently stayed at this lovely resort and thoroughly enjoyed the experience. It exceeded our expectations - the gardens were beautiful, the pools safe and clean and our room was clean with very comfortable pillows and king-size bed. The staff were very attentive, professional and friendly. Breakfasts offered a wide range of terrific food as did the other dining facilities. We also enjoyed a few of the pizzas on offer at the pizza restaurant.", "We won't hesitate to highly recommend this resort!!!\n", "\n5 star beachfront resort Nusa Dua Bali Indonesia with luxury rooms, big swimming pools and good family friendly beach. Very hospitable hotel staff. Excellent dining entertainment. Family friendly hotel. Good conference / function room facilities.", " ", " ", "\n", "\nDefinitely will come back with my family..beautiful garden with the sea view,lovely beach. .you can enjoy swimming in there,good food,nice room and good service. Highly recomended for family vacation and gathering.", "\n", "\nThis is the second time we have stayed here. We love it. When I asked about jackfruit for breakfast, it appeared at the next day's breakfast. The spa is amazing too. I wanted to take their bed home with me, the best night's sleep ever", "\n", "\nKayumanis spa and private villas are truly a hidden jewel in bali. Our private villa was simply stunning. The staff made every effort to ensure all our needs were being taken care of. The food ( both restaraunts and the room service food) was absolutely delicious! The 2 hour spa treatment was sensational! We moved to a near by resort after spending 5 days at kayumanis, and we wished we never left! Can't recommend it highly enough\n", "\nAbsolutely relaxing resort.awesome pools,beautiful food and friendly service.should be 6 star instead ! Beachfront views,clean presented rooms and a terrific atmosphere.would return there in a heart beat.A+++", "\n", "\nWe were pleasantly surprised by the running of the Hotel.The staffs were magnificent,they were very polite and courteous.From the moment we got picked up from the Airport until we leave. I can't speak highly enough for them.The food especially at the Manguro Asian bistro and the Balinese Restaurant was magnificent.\n", "\nlow quality if food for very highly priced menus!!!! when the average salary is 200USD we paid 60 USD for 2 main course and a salad & 2 beers! Italian pizza is not Italian!!!!", "the check in to give a deposit of 2,000,000 IDR is still iur question, not in Luxemburg or Boaton you pay that! and we were asked from a 3 rd world country that amount!", "no internet in the room! 5 star hotel and we paid extra! redicous!", "Finally the complimentary water on the rooms was not mineral, was refilled! no date of issue and expiration!", "sorry we have travelled everywhere in the world and my wife wors in the hotel industry and rhis hotel is very overpriced!", "sorry for this, but will not recommend!", "hope you will improve!", "all the best\n", "\nReally beautiful hotel, people, facilities and everything about this place! Would definitely recommend ! The only downside is that you can't really walk to the \"cheap\" markets. But was easy enough to get taxi/driver when needed.\n", "\nThis hotel is one of the best hotel in Bali, love it here, their employees are well trained, educated and fast in response. Very very professionals. Will visit here again! Some of the employees even remember my name!", " ", "\n", "\nwe really enjoyed our stay with you again and will for sure come again , we like your hotel because of its location on the beach and the comfort of the rooms , we love the squirrels and birds , we always recommend u to others ,your breakfast + service was excellent ,our only complaint was that the fridge didn't work to keep the drinks cool ", " ", "\n", "\nthe hotel has very nice breakfast and nice facilities! Nothing more than that!!!", "they asked on our check in 160 USD for guarantee!", "there is no Internet in the room unless you pay 10 USD per day!", "The food at all restaurants is not high quality, beef is frozen! ", "and the funniest thing is that we paid for 2 main courses of noodles, one salad, 2 beers 60 USD dollar!!!! whereas everywhere else in Bali you eat this quantity with 20 USD! because the food cost here is too low, so it is really very high priced with no reason and poor quality of food!", "Finally always check the change, because the waiters many times braught us back not the right amount of change!", "sorry but wont be back! Low value for money!\n", "\nBeautiful place, very friendly and helpful staff. Unfortunately however, our stay did not start well. On arrival our room was not ready and upon inspection proved far too small for 3 adults. Even though this was the room booked through Luxury Escapes the picture on the internet upon booking was far larger. During the course of the afternoon we were offered two more options, both being the same size as the first! We were eventually given a connecting family room for no extra cost which satisfied our needs and made up for the entire day spent waiting for a room. Breakfast every morning was magnificent and had a wide selection from which to choose. However we attended three theme dinners which were sorely lacking. The beach barbeque dinner included overcooked prawns and mussels that were clearly off. The selection at the other two dinners was also disappointing. The food on offer was not reflective of a 5, even 4, star resort. Drinks are also heavily overpriced at this resort. The massage treatments were very good. It's a good resort for total relaxation though not for shopping or mingling with the locals. Kuta is a 200,000 rupiah one way trip by hotel taxi though it's 150,000 if you pay the driver directly! We were also charged for drinks out of the bar fridge we did not consume so be careful of this. Having been to Bali 4 times I wouldn't stay here again though it is a very beautiful place. Have to agree with others that they need to spend money on more maintenance; the pool especially needs a good scrub as there is lots of black mould below the waterline. They need to do much more to claim 5 star status.", "\n", "\nWe recently had an 8 night stay at Nusa dua beach Hotel and were pleasantly surprised with the hotel and the area. While the hotel is starting to show its age in some areas it still is a wonderful place to chill out and pamper yourself. Great pool areas and a wonderful spa retreat. Spacious grounds and plenty of beach frontage gives the feel of a much more intimate hotel. Nusa Dua is a nice escape from the ugly and crass areas around south Bali.Not your immersion into local culture but a a good place to recharge and spoil yourself.\n", "\nWe have just checked out of this hotel and enjoyed every minute here. My husband and I travelled with our 3 teenagers and were given adjacent rooms as we had requested. The rooms were exceptionally clean and although a little tired looking, were still to a very high standard. The breakfast selection is vast with all nationalities, tastes and cultures catered for. We ate at two of the hotel's many restaurants and enjoyed the meals enormously. The staff are definitely what make a stay in this hotel stand out from others we have stayed in as not one staff member in our 9 days there did not smile and greet us or bend over backwards to accommodate anything we needed. A lovely collection of shops and restaurants is a short walk from the hotel but taxi's are so cheap and readily available that you can go further afield with ease. The spa area is a lovely area to relax and unwind with a large variety of treatments and there is also a games room in that area too. Highly recommended for a truly relaxed and pampered holiday.\n", "\nI suggest this hotel everybody. This place, coutry is beautifull. The seaside is very clean. There are a lot of staff, who help you any time. But I sugget for managment more informations give for gests any opportunity, because there a lot of way to spend time in Bali.", " ", " ", "\n", "\nThank you so much for making our holiday so special and relaxing. The staff at Nusa Dua Beach Hotel and Spa are outstanding and took such good care of us. The food, especially at the Maguro Asian Bistro and Raja's Balinese Restaurant, was excellent, and I can highly recommend the pina colada cocktail in the Lobby Bar! Thank you again, we will definitely be coming back!\n", "\nThe service personnel at Nusa Dua Beach Resort - without exception - right from the person who greeted us at Denpasar Airport, were phenomenal, and were extremely attentive to our needs. While we came here because our daughter had stayed here a year back, we will recommend this as THE place to stay to our friends and family. Given that we were vegetarians and wanted Indian food, the Front Desk Manager made arrangements with the Chef to cook us some special items, and also followed up to see whether we enjoyed our food! The freindliness and pleasant disposition of the Balinese people in general want us to come to Bali again!\n", "\nSet away from the throngs of people in the serene district of Nusa Dua, this hotel is harmonious and wonderfully tranquil! ", "Conveniently connected to the beach itself is also practical, dining options are plentiful, personnel are attentive, overall most gratifying!\n", "\nJust returned from another stay at NDBH, and I never get tired of it. This is our third trip to this resort in the last 12 months.", "We took up the Luxury package this time which included the free massages and dinners and we really enjoyed it and found it excellent value for money.", "The Palace Club is the main draw card for me to this resort as the service is exceptional. We travel to Bali at least 3-4 times a year for business, so once I hit Nusa Dua I just want to sit under a tree, swim and eat.", "The staff at this hotel have been trained to a very high standard and nothing is to much trouble. You are treated like royalty from the minute you arrive.", "The rooms are looking a tad tired and definitely some new lounges around the pool would improve this resort even more.", "My one and only gripe would have to be the Wednesday night general mangers cocktail party which all of the Palace Club guests are invited to meet with the GM and meet other guests.", "In theory this is a lovely idea but for us personally, in all the times I have stayed at NDBH the manager has never come over to introduce himself which I found a little odd as we stayed over 10 times at this resort.", " Did this put me off coming back (def. not)", "NDBH still has the Balinese feel to it so you really do feel that you are staying in a island paradise.\n", "\nMy Daughter and I loved our stay although we were un happy that twin beds were NOT provided as we had arranged. We loved being part of the Palace Club, the breakfast at the club were great, cooked to order and peaceful location. We did have to show our booking papers to get all of our special deals, most of our main meals were also included this was terrific, certainly worth paying extra for the privledge's. I loved the Cocktails and went to happy hour most nights at the bar, great time with the entertainment and met a lot of lovely people and a lot of Aussies. The Palace Club Ocean View room only has glimpses of the ocean but the room had a separate living and dinning area as well as 2 toilets and a kitchen/storage area and a lovely big long balcony looking over the pond, very nice. The staff were all terrific although it took around 3 days for someone to find me a good pillow. The bed was way too firm for me, so I slept on a down pillow every night. The spa did massages however, my daughter and I need sports type not the fairy finger relaxation massage's on offer. The Resort itself provides some fantastic theme nights with entertainment that were pretty good and it has some beautiful gardens and even the occasional night market stalls, bit pricey but convenient. ", "I would recommend this place although these resorts are quite expensive compared to going into the towns for drinks and meals. Nusa Dua is a great place to stay any resort along the beach there would be pretty good. People bring goods to the beach to sell each day Sarongs, jewellery etc. Overall we truly enjoyed all the places we went and the Resort.\n", "\nOur second stay at this great Hotel. Staff were great and breakfast is exactly what the hungry kids wanted.(even more choice than last time, if that's possible). Room was great. Clean and well serviced daily. 1 hour traditional Balinese massage was perfect in the spa. VERY relaxing, and great environment for relaxation. Chess Restaurant meals were great quality and highly enjoyed. Pools as always were clean.Free WiFi in common areas only (which is usual for most Bali hotels) was pretty good. More traditional Balinese style hotel compared to some others around the area, a very good Hotel in great location, (walking distance to Nusa Dua Markets, and Bali Collection). Highly Recommended.\n", "\nBeautiful grounds and excellent service. Staff are a major drawcard especially in the food & beverage outlets. Loved the Spa pool.....keep kids out of their completely for it to be perfect. More quiet and better music required in the massage rooms and the ambiance can be improved. Spas in Bali Collection had the right idea. Staff knowledge and information of the activities around each day need to be improved as well as overall marketing. As a result we missed the garden walk from being told 4 different schedules. Location changes to the theatre dinners were also not provided, we had to walk around to find where to go. Meals at all the outlets were excellent. The only disappointment was Maguro - not up to par with the others. Within close proximity to Bali Collection and local markets. Loved staying here and will definitely choose this hotel for our next stay.\n", "\nWe just spent 7 nights on a family holiday with two teenagers. The service at the hotel was outstanding and nothing was ever too much trouble for the staff. The pool was fantastic and the restaurants served great food at pretty good prices for hotel food.", "Although this is one of the older hotels in Nusa Dua, the property was in great condition and the rooms were clean and well serviced every day. The gardens ans surroundings were just beautiful.", "My wife had a fall on the trip (in Kuta) and injured her shoulder. The hotel were fantastic in helping us get to the hospital and assisting in any way possible. We even had a bouquet of flowers sent to the room by the hotel General Manager.", "I cannot fault the hotel in any way.", "\n", "\nGreat hotel have been back 20 times.", "Always stay in the Palace Club, this year we stayed in the Nusa Dua Suite.", "Very traditional Bali hotel with very good staff how have worked at the hotel for many years.", "\n", "\nThe hotel was nice especially the lobby area and the restaurants. Our room however was ok but maybe more of 4 star rating than 5 star. Our room was not very well cleaned. I think it is not so important to clean very well every day but when the room gets an new quest it is very important that the rooms should be cleaned well so that the first impression in good !\n", "\nNice enough for the price however - 2 disappointing thing were;", "1. Pool towel were tatty & grotty & dobt smell fresh ", "2. Room itself was fantastic, but balcony was grotty and bathroom was shocking! Smelt of draibs &?sewage and shower had mould everywhere\n", "\nWe honeymooned in the Nusa Dua. Beach Resort and had an amazing time. While the hotel is 5 star luxury it still has a traditional authentic Balinese feel. Location was fantastic along with the service provided by staff. Thanks.\n", "\nAs an amputee and MS person the bed was to high to get into. Spent the first two nights sleeping in w/chair. A child's bed was brought in we had to make changes using cushions and pillows. Apart from this was a great resort we enjoyed every minute of our stay. The food was great the atmosphere was so very relaxing. The staff were exceptional, the swimming pools were divine. The Chess bar was somewhere this side of heaven. Well done by everyone. As first time travellers to Bali we will return to Nusa Dua Beach ", "\n", "\nThe range of pools and spa facilities kept us all very busy. A beautiful prisitine beach, swim up bar and poolside restaurants made life easy and relaxation easy. The bed was so delightful and a welcome repose from busy days. The garden wing had lovely views and the balcony was great for ltting the breeze in.", "Happy all round.\n", "\nStayed 8 nights (jan 2015 2 adults & 4 1/2 year daughter) in a premier suite over looking the garden. The Nusa Dua Beach & Spa Hotel would have to be 1 of the best resorts we have stayed at, if you like the relaxed atmosphere of old style hotels as we do. Not a big fan of modern accommodation.The hotel, surroundings & presentation were impeccable.The entire hotel staff deserve 100% credit.Having travelled through a lot of Asian countries I/we have not come across such genuinely happy/smiling staff members of a luxury hotel like this one.Can see why so many people keep returning, time after time as we will be doing. SHEAR LUXURY IN PARADISE.\n", "\nWe were a group of 40 mostly Bali first timers looking for a top notch holiday. We were treated to the Palace room package which included spa packages, afternoon cocktails and dinner vouchers. The staff, accommodation, and general feel of the place was first class. No need to go anywhere else.\n", "\nA nice hotel with beautiful surrounds. Friendly staff always happy to assist. Our original room was a family room with a bathroom the size of a shoe box which was the reason for my survey rating. Thanks", " ", " ", "\n", "\nThank you Nusa Dua Beach hotel staff for spoiling us and making our Christmas break at your hotel so special. We have stayed there many times over the years and it is consistently good.", "See next time.", "Kind regards, Brenda Moore\n", "\nbeautiful surrounds, food and drink, flowers, sculpture, balinese entertainment, a good dose of local culture, friendly and professional service, and importantly we felt safe so recommend for families ", "\n", "\nOnly disappointment was the kids club. I had hoped for more enthusiastic, welcoming and child focussed carers to entice my child who had never been to a kids club before. Not much interaction was observed. Otherwise our stay was fantastic!\n", "\nThis was our first time at Nusa Dua Hotel & Spa and we were certainly impressed. We booked using a Luxury Escape Voucher which we thought was great value. The hotel is well maintained and the gardens are stunning. We had excess to the Palace Club Lounge where we had breakfast, arvo tea and cocktails everyday. The staff were super helpful and attentive. We will definitely be back and will take the kids next time.\n", "\nWe stayed on a luxury escape package and it was excellent. The family room was spacious and always cleaned to an excellent standard. We used the spa a number of times both as part of our voucher and without. The whole experience was perfect. The gardens were beautiful and well maintained and the resort was very spacious and therefore very peaceful. At first I thought the resort may have been too big but after a few days we enjoyed walking around. The beach is excellent. Totally clean and no hassle from hawkers. The kids loved the pool areas and we never had a problem getting a seat around the pool. We often preferred to sit at the beach which was very close to the pool area anyway. Service around the pool and restaurants was excellent. My husband got sick one day and the hotel organised a doctor to the room in 30minutes which was great. The only negative would be the buffet theme nights. We found the food bland and disappointing. It would have been good to have a few things at the buffet for the children. Despite this breakfast was excellent and we loved the pizza bar. We loved watching the pond at breakfast. The lizards and water birds were very entertaining. If you are after other options Bali Collection is a 10 minute walk or 3 minute drive. You will find lots of shopping and restaurants here. Easy to get transport from the hotel or find a driver for your stay outside hotel around bali collection. We also loved the walking track that connects all the resorts. We loved jogging along here and up around the park. Kids loved kids club. Lots of activities on offer. Overall the resort is excellent with real Balinese character. We also like the quiet and peaceful area of Nusa Dua. The beaches are by far the best. If you want some more shopping or fun at the water park, safari park it is easily accessible by taxi with the help of the new freeway. Will be coming to stay again!\n", "\nGet s new chef breakfast was boreing same everyday for 2 weeks , eggs floating in water , cold baked beans , horrible shrivelled up potatoe wedged do some scalloped potatoes and mash , sautéed Vegas not just eggplant a nd spinach it really was scull and birding same chic donuts everyday, get a new chef with some imagination\n", "\nThe hotel is immaculate and well maintained and leads onto an amazingly beautiful beach couldn't fault the location or cleanliness and the food although a bit dearer than outside the resort was amazing.", "\n", "\nWe stayed here for 9 days, & had a great time. Staff were very friendly, & helpful. Pools, & beach were great, & the choice of restaurants & bars was more than enough. We loved the Balinese feel to the place, versus the more modern concrete look & feel you get at some more modern styled hotels. We will definitely be staying here again. Thank you guys.\n", "\nOverall it was very good except the food from the room service menu. I ordered Mie Goreng and it was purely unpalatable. It cost IDR 145,200 in total and did not even eat one mouth. I found the food very expensive in room service and restaurants.", "\n", "\nWe bought this holiday through \"Ouffer\". Great deal. It was 8 nights in a royal suite. With the palace club upgrade. Which including heaps of extras. ", "The room was plenty large enough for us and the 2 kids aged 3 and 1. Long balcony for them to play cars etc in. We asked for a separate cot and single bed which was no problem. In the cot when we arrived was even a package of baby toiletries, Johnson and Johnson. Nice touch. ", "We moved the furniture around a bit to make it easier for the 1 year old to crawl around. ", "We had a separate bedroom which was nice to go and watch TV and chill out whilst kids slept undisturbed. ", "Hotel breakfast was supplied in the palace club, however with 2 kids waiting for food to be cooked in tranquil surroundings isn't ideal. We did it once and then we opted to go to the buffet breakfast all the other times as it suited the family environment better. Heaps of options and you can be quick, which is what is needed for a young family.", "By 8.30am we were at the pool or beach playing. Perfect pools with shade for the family. ", "Always had a lounge or shade at anytime that we went to the pool or beach even in the afternoons after naps.", "Lunch at the Italian is a must, pizzas are a winner! Real Italian style.", "We utilised the baby sitting in the hotel at $4AU an hour for 2 kids in our room, bring it on. We did spas, lunch, dinner and shopping all while our kids had room service and watched movies. Perfect. ", "Gardens were lovely. Location is fantastic with the path all the way across the front of the hotel linking to other hotels whilst following the beach. ", "We would come back for sure. Perfect holiday to Bali with our family.\n", "\nWe stayed here for 3 nights and it was excellent. The staff are so nice and keen to help. Suastika on reception was really helpful. The room was lovely and the chess bar was great.", "In order to assist with continuous improvement there were a couple of things which could be acted upon.", "1. The breakfast was exactly the same each day. Bit of variety would have been nice.", "2. No Brown or HP sauce at breakfast! Sacrilege!", "3. I ran out of reading material so asked if there was a library. I was told yes but it was in the Palace lounge which is closed to plebs like me!", "4. Happy hour conditions applied differently between chess bar and lobby bar.", "All of these issues did not spoil my holiday but would have improved it.", "The only other point I would make is that the closed off Nusa Dua and Bali Collection area is quite artificial and does not really represent Bali. However a night in Kuta is recommended to give a full experience.\n", "\nAll staff were lovely the entire week stay. Our rooms, pool area, reception and lobby were very clean and staff available everywhere. Bar & eateries were delicious and service was quick. The only (minor) negative is 3pm check-in. We should have taken swimsuits in hand luggage rathen than wait in the heat for a couple of hours for room & luggage. Once in pool, all was fogotten! Views on 3rd & 4th floors of beach & pool were divine.\n", "\nThis is a lovely 4 star hotel, we arrived with 3 families, no rooms were ready at 1pm so we thought we would come back at 2.30, again no rooms ready, The staff seemed a little disinterested. Service was average, Once checked in the rooms and they were fairly nice. Its the position of this hotel (one of 6 hotels on the beach) that makes it attractive however even our teenage kids couldn't believe how long a chicken burger took, so we reordered it and timed it as a test, 41 min, But thats not important when you see the staff doing everything they can, in this instance, the 4 days the staff really couldn't be bothered except the management, they were lovely. BUT DO NOT STAY HERE IF COMING AS COUPLES, rooms are dated and service relatively slow. We would stay here again coming with kids but would try one of the other hotels next door that are 5 star if coming with no kids.\n", "\nWe spent 8 nights here with 6 adult kids in the royal palace wing on a luxury package and couldn't fault the service or the staff. Breakfast served to you daily in own separate club room, afternoon tea daily plus happy hour from 5.30 till 7.00 pm with no limits as drinks included.", "Suite were very special, rain shower plus second toilet, your own lounge and kitchenette, two tv's, balcony and fresh fruit and towels daily.", "We loved our stay and the kids thought they were in heaven. ", "Special mention to Dermot for making himself known and sorting out my small passport issue with the number of beers.", "Cheers.\n", "\nThe room was not as expected. The furniture was of a cheap quality which used to squeak on even sitting on them. ", "The bathroom fixtures were too of a poor and cheap quality which used to fall off and they were never replaced back.", "Toiletries were replaced only on requesting for them. Bath robs and towels were not replaced daily and were just folded and kept back in place. The bath robs once used were not replaced. ", "There was no exhaust in the bathroom and on asking room service if the bathroom had one they behaved as though i was asking for and amenity only available on \"Star Trek\".", "\n", "\nIf you are looking for a beautiful hotel with a balinesse experience then Nusa Dua Beach Hotel is for you. We just spent 11 days there with our family and we all had a lovely time. Wonderful staff and clean, spacious rooms. A nice selection of restaurants if you don't want to leave the hotel.\n", "\nfood is average, service and amenities are good. Cost of mini bar items were too expensive. Ambiance and location of the hotel was very good. Premier room location only have garden view there was no ocean view for premier rooms.", "\n", "\nThe Resort is very well positioned excellent facilities, restaurants reasonably proced, breakfast a very large variety to choose from, staff are very friendly and go out of there way to do whatever they can to assist. the pool areas are well maintained very relaxing area, the provate beach is very clean with waiting staff attending to your every requirement.\n", "\nThe hotel is best and we enjoyed stayed over there. The rooms are good and clean. Beach is excellent and it is suggested the hotel can hv more vegetarian option to satisfy vegetarian people. It will be very good if they hv indian recipes", " ", "\n", "\nA very late booking for a family and break and Nusa Dua delivered on all fronts. A very family friendly hotel with numerous kid safe swimming pools. Beautifully decorated, with a relaxed feel, would fully recommend.", " ", "\n", "\nWe spent 9 days here and found the hotel to suit our needs. The grounds are meticulously maintained, hotel staff are extremely friendly.", "We spent New Years Eve at the hotel. The evening began in the foyer at 7pm for cocktails, followed by a magnificent buffet dinner & show. There was a wonderful fireworks display to see in the new year.", "We love Nusa Dua and the location of the hotel to Bali Collection & the Main Gate shopping strip is great - just a simple 5-10 minute walk.", "Our garden view room was nicely appointed however, the bathroom was quite dated. These hotels need to provide drawers in the bathrooms & a 2400v hairdryer would be a nice touch. ", "Breakfast buffet was superb - ticked all of the boxes, everyday!!", "Friday night bbq buffet with Fire Show was also great. A large variety of food to choose from. ", "All in all a wonderful experience. Shame the weather was wet & overcast. Thankfully the next 9 days were extremely sunny. Left Bali with a healthy glow and at least an extra 2kgs", "Highly recommend for families...\n", "\nNice resort. Great spa service. Hotel one of the originals in nusa dua so can do with a bit of an upgrade. Staff very pleasant. Only draw back was the lack of communication between wait staff and kitchen resulting in food taking way longer to arrive or not arrive at all.\n", "\nlovely hotel to see and stay in easy reach of the beach shopping and airport..the hotel was clean calm and friendly and loved the spa treatments, the beach and pool area are very clean ans average size waves to surf. would return and mention to friends.\n", "\nThe interior and exterior designs of the hotel is beautiful. Great to see staff wearing traditional costumes as their uniform. Love the pool options. The beach is clean. Only a few mins drive to mall.\n", "\nWe spent the second week of our Xmas break here, sadly this hotel is now very tired and dated and showing it. Rooms particularly are showing old age wear, the towels and linen are old and no longer looking white, bathroom fittings stained and not working well and the standard of room cleaning is not wonderful. On top of this my wife suffered food poisoning from a hotel restaurant, hotel management was concerned enough to send a small bunch of flowers but not providing a credit for the meal which I considered very poor, upon check-out nobody seemed to care.", "Room next to us was being painted and the varnish fumes came under the adjoining door and made us feel quite poorly, when we commented on this the staff laughed at us and continued to paint! Far out....", "We found prices within the hotel were excessive for the quality received and the dining service was often very slow, we had the feeling the place was often understaffed in the restaurants.", "Staff at the taxi/booking desk were most unhelpful and sour, the prices in the hotel shops were twice that of retail shops in Kuta!", "A walk along the beach showed a number of superior places to stay and research of rates proved these to be more desirable places to stay. Hawkers on the 'private beach' were a little annoying with the very scarce security not concerned at all...", "We left having had a great holiday but our opinion is that this old place is indeed only average and we would be be very unlikely to return. Not recommended, suggest having a look at the Laguna....\n", "\nAfter many stays in villas around the island, we tried a luxury escape at Nusa Dua Beach Hotel & Spa. We were not disappointed. In fact, very surprised how much we enjoyed the resort lifestyle. But how could you not, with amazing buffet breakfasts, awesome food in every restaurant, relaxing pools with fabulous food & drink services, relaxing spa treatments and helpful staff everywhere. Thoroughly recommend staying here and we are about to book our next stay!\n", "\nStayed at the nusa dua beach hotel last March it was our 2nd time and loved it the staff are great food good and will be going back in March this year stayed at a lot of the hotels in nusa dua and think this is one of the best can't wait to get back there\n", "\nIf you want a completely relaxed, totally 'looked after' experience then stay at the Palace club in the Nusa Dua Beach hotel and Spa. All the staff were wonderful and the availability of the private lounge with its facilites made our holiday very memorable.\n", "\nThe resort is older than others in Nusa Dua but beautifully maintained. It is in a great location, the staff were fantastic and the food was better than other 5 star resorts along the beach. Great for families and couples.\n", "\nideal to brake away from a too busy job", "limited opportunities for more-active leisure", "provision of swim-shoes or flippers/snorkels would have been good", "personnel, and beach vendors, were lovely, non-obtrusive, yet supportive", " ", "\n", "\nVERY BIG! Deserve's it's 5 Star rating. LOVELY LOVELY people. G8 beach and pools. Would happily return. Breakfast is FAULTLESS. Many restaurants to choose from. Loved the architecture of the hotel. ..............................................................................................................................................................................................................................................................................................................................................................................\n", "\nHotel accommodation was great with food & beverage variety & price being well over our expectations when compared to some other resorts we have stayed at. We enjoyed all that the resort offered especially the New Years buffet dinner and show.\n", "\nGood place to stay with children. Beach is clean and well maintained. The facilities are great and you get the Balinese feel and ambiance even by just walking around the resort. Very nice resort especially for family.", "\n", "\nOut of the luxury resorts directly on the beach, this is the nicest for an authentic feel - it's Balinese in look and feel. The spa is amazing, dining on the beach cannot be beat, and it is a lovely property overall.\n", "\nGood place to stay...... super recommendation. I am frequest guest and my 4th times staying in Nusa Dua Bali Beach Hotel... my kids love it. Greaat food, Great Pool, very nice hotel space and relaxing ambience. ", "\n", "\nThe accommodations were outstanding! There were many great food options with all the restaurants onsite and at neighboring resorts. The spa was incredible! We ended up going twice because the first experience was so good. All staff were incredibly friendly and welcoming. Wi-fi quality was great and better than expected. Beach was beautiful and relaxing. Excellent experience throughout! Would love to go back!\n", "\nLocated in Nusa Dua which is my favourite location in Bali.", "The hotel is very well maintained.", "The only unpleasant experience was we had to wait for 2 hours during check-in because the room was not ready.", "The AC in the room was not working properly but the staff gave me an upgrade to a better room.", "We really appreciate this.\n", "\nLooked forward to our stay only to come away extremely disappointed. Poor service around pool. Impossible to get a drink and waiting up to an hour for poolside meals and drinks. Counted 16 staff members while our drinks sat on the counter for over 5 minutes only to walk over and pick them up ourselves. Had most of our dinners at other hotels because the service was better. Rooms very run down. Over priced New Years Eve Gala Dinner $250 plus and no drinks included. Breakfast is a shambles. Food at theme nights very average. Been to Bali many times and have never left a hotel thinking NEVER again.\n", "\nAccommodation was lovely, clean. The staff were super friendly an always happy. Beautiful hotel. Nice area. Great for family's with kids! Beach was clean out front. Western an local foods. Prices were a little exy", " ", " ", " ", "\n", "\nA party of 12 from age 1 to 82. We had a great time. Staff were fantastic and resort is well located with a clean private beach. I am a hard person to please and this was great. We had a relaxing break, food was good especially breakfast. The staff are very helpful and always helped when we needed anything including taxis. Try the seafood BBQ it has a great variety and also has good vegetarian choice which some of us are. It was better than the XMAS day lunch.\n", "\nEverything was excellent, the breakfast spectacular! Also the staff were so polite and friendly that it was a pleasure waking up and seeing smiles all around! The only small issues we had were that the airconditioning was quite loud and the curtains could have been a bit thicker.", "\n", "\nI finally stayed at Nusa Dua Beach Hotel and Spa...I've read about this excellent resort hotel for the longest time and it was my dream to stay here because of the rave reviews I've been reading. I was not disappointed. The facilities and grounds were excellent, being centrally located at a development for high end hotels. I could not believe that this hotel has been around since 1983.. I would highly recommend this resort hotel for everyone, be it solo, for couples or even a business trip..The place is highly invigorating for the soul\n", "\nOverall service was good. Was surprised that for the NEw Year's eve gala dinner at USD199 per head, drinks was excluded. Hotel surroundings, garden and beach well kept and lovely. However room needs upgrading, bathroom small and bed squeaky. Also no TV on kids room in family room although essentially paying for 2 rooms\n", "\nWestern style resort charges Western prices. Go in to Bali Collection shopping centre (a 15 min walk or free shuttle bus from resort) to eat. Bali Collection has more authentic food and much better prices. Felt very safe at the resort, had to go through 2 security check points. Go to breakfast early if you want a table. Sun lounges by the pool fill up fast.\n", "\nExceptional personal service from all staff - from management to room service - at this beautifully appointed Balinese-style first-class resort. Food was excellent and we enjoyed a holiday that we simply did not want to end. We will return.\n", "\nI lost my voucher to take free professional photography from the hotel. I am surprise that when I asked for a replacement, it was denied. I haven't used it at all and the hotel could just check it from the room number. I guess not. Their excuse is that they only have a limited voucher. I don't think so. Anyway, the service during the check in was average, nothing special. Somebody told me that it is due to that we don't look \"Caucasian\". That is sad if it is true. Anyway, overall experience is good.\n", "\n.......disappointing restaurant and checkout services.", "Breakfast and cleaning staff were great and very attentive. When we dined at the restaurants we found that the service was not up to expectation, waiting for service and bills at the end of the meals for long periods. We arranged a later checkout and were locked out of our room but the room we had next door was left open with access to all our belongings. Upon checkout our room payment was on the bill when we had already made this payment along with an item from the mini bar which we had not consumed.", "The hotel facilities we at a high standard and can't be faulted.\n", "\nThe hotel is too big and too noisy - too many people with children who make loud noise even during very early morning! Hard to find a seat during breakfast time.", "Service is Ok, the staff will respond your request in time. You need to PAY for WIFI....", "The beach is not as expected, if you want to do water sports or snorkeling, better go with a tour to another island.", "Overall it is not worth of the money.\n", "\nThank you to the Team at NDBRS we had a fantastic New Year's Eve party and wonderful stay overall . The staff are lovely , the food is amazing , the drinks are ice cold and the grounds and rooms fantastic , we will be returning to this awesome hotel\n", "\nWe visited for two weeks before christmas. I unreservedly recommend this hotel, in all aspects. The staff were friendly, food was great, accomodation excellent and immaculately clean, beach clean and secure for children, there are three large pools that the kids visited daily. You could venture into hustling Kuta and its surrounds with a short taxi ride but the return to this oasis was always welcome. I preferred Nusa Dua over is surrounds. My son has life threatening food allergies and we were concerned that he would have limited choices but we had no cause for concern. This is an excellent family friendly hotel with all the bells and whistles for a luxurious and relaxing stay. Thankyou to all staff at this hotel for making this a superb holiday. We will return to this hotel without hesitation.\n", "\nWe have spent several holidays in the Palace Club and after trying a couple of other hotels, have once again returned to the Palace Club. We love the rooms, the food and the excellent friendly staff who always give us a warm welcome. We hope we will continue to visit the Palace Club.\n", "\nHad a nice five nights stay in this hotel with family. Excellent location , nice service, lots to do in hotel itself. Will strongly recommend taking breakfast option. Only downside is that you need to travel a bit for shopping. Will stay again.", " ", " ", "\n", "\nThe Nusa Dua Beach Hotel and Spa was a great place to relax on a kid free getaway. The staff were lovely and welcoming as you would expect in a good Bali hotel and the restaurants were varied and all had great food. The grilled whole snapper was a standout.", "Fronts right on to the beach with a well maintained path for walking and cycling was excellent as was the shuttle service to the shopping area.", "Although the pools are quite small and as only 50% capacity, quite busy, we quickly discovered the quiet pool in the spa area and spent a lot of time relaxing there.", "We had a great time here and would happily recommend this hotel for couples particularly.\n", "\nWe visited the hotel between Christmas and New Year. Very nice hotel with massive gardens, 2 big pools and direct access to the beach. The beach is well guarded to keep sellers under control in number and not to bother tourists.", "We had a great time and the facilities were excellent.", "I will suggest the hotel to put additional sunbeds, shades and parasols around the pool as it seem to never be enough for all guests. Also was quite disappointing that smoking was permitted in the pool area where many kids played around.", "At the end of my stay I got food seek, perhaps a suggestion to the hotel is to include a soft diet. On this note, it was very convenient the fact that Nusa Dua has a private and very, oder clinic 3 minutes from the hotel.", "Overall great experience and very recommendable stay... probably we will come back.\n", "\nThis was our second trip to the Nusa dua beach and we will definitely going back for a third. The food and service was once again a very pleasing part of our stay. We love the chess bar and diner by the sea. See you all again soon.", "\n", "\nWe went here for our honeymoon. We reserved a regular room (not a suite) but the hotel still decorated our room with their honeymoon package. The entire place is beautiful traditional Balinese architecture. The room was clean, the pool area and beach are very gorgeous, and the staff provided very good service. We were able to book excursions and tours via the hotel. Nusa Dua is a more exclusive part of the island, so all the hotels around here are a bit more quiet than Kuta or Ubud. The food has a lot of variety and the quality is very good. We especially enjoyed the breakfast buffet. It is also worth noting that we went during low season (in early December), so resort was even more quiet, and that made our getaway even more enjoyable.\n", "\nThis hotel offered us a great value for money. The location is amazing and the service of the hotel staff is awesome! We booked a club palace room and the room had a lot of advantages of its own. The view for the breakfast area is simply amazing and the wonderful service of the staff makes it all the more valuable.", "Amazing experience and recommended to everyone.\n", "\nWe stayed for 12 nights with two family groups which included 5 adults and 3 children ranging from 9 to 3 years. Everyone had a great time with the kids enjoying the time they spent in the kids club and the ample swimming pool area. The buffett breakfast was first class. The staff were very attentive, polite and only too willing to help. The rooms were cleaned daily and the hotel facilities were well maintained. Although not the cheapest place to stay in Bali the family experience on a whole was very positive\n", "\nNusa Dua is a very beautiful resort, the vast garden, public area, pool and beach probably made it one of the best resorts in Nusa Dua area. The Balinese architecture is found within the temple providing a sense of location and respect of traditional culture. The staffs are extreme helpful and friendly.", "The only complaint however, was that the rooms are showing signs of aging, particularly the bathroom area. Perhaps indicating the need of renovation to match other resorts around the vicinity.", "Despite this, I am happy to give it a 4/5 rating!\n", "\nFive star hotel in Bali in a very quiet area and at the ocean with a a private beach makes your holiday a non forgetable time. Breakfast starts with a friendly staff welcoming you with the smile and ready to,help you .The girls are wonderful to view in their charming dress.The Hotel has a 5 star Spa with 5 star service and 5 star prices.The food is excellent and all Restaurants are woth to visit.The Christmas evening dinner was again worh to book.I took the catamaran to the Island Lembongan: a good experience with the Aristocat boat.In the evening at 7 P.M.I was glad to enter my room 32220 with ocean view.The trip to UBUD was also nice and worth to make. I still have 8 days more to stay....The General Manager of the Hotel is a Swiss very kind man and you find an Irish young lady here calles Sinead . She will help you if needed ....\n", "\nI have been to this hotel time and time again. I love the staff who are always friendly and helping is not an issue. The restaurants are delicious and well priced and I love the pool and beach area; so much space but without feeling isolated. The gym staff are amazing and have a wealth of knowledge and experience in all sports - I can now skip a double under because of them! And I love to relax in the spa after. Everytime something comes up (bad TV reception, a bubbly toilet) the staff come over straight away and sort the problem out. Love staying here and looking forward to my eight time back in 2015!", "\n", "\nThe staff are only too happy to assist with everythiing, the food is delicious, the rooms are clean and well appointed and well maintained, the pools are imaculate and inviting and the spa is awesome. Would happily stay here again! It's only a short taxi ride to Kuta if you are after the night life and the beaches are clean and white.\n", "\nWe needed a rest and this this resort is a excellent place to rest! The restaurants are excellent! The swimming pool is nice with a bar serving excellent drink. The breakfast buffet is perfect. A very nice place!", " ", "\n", "\nThe hotel was excellent, the room was very nice, and the bed quite accomodate the three of us. ", "Someone said on their review that they saw a squirrel greeting them, and yes it's true! I saw them twice!", "The location is excellent, blend with the nature, although it is a very large complex of hotel.", "Even I am as Indonesian, I'm being treated no different from international guests ( Rumors said domestic's treated different)", "I like jogging, so when I found out that pavement that lies accross the hotels on the beach, I'm so happy, and I ran 10km from south to north back and forth.", "The pool and the beach is nice, we swam in the pool and in the sea until noon.", "And by the way, this is my first time visit to Bali in 40 years LOL", "But you Nusa Dua Hotel, you impressed me well", "And the wifi's cost also quite cheap, no holiday will complete, if we couldn't update our status on social media", "Cheers", "\n", "\nIt was nice but the price of food was not good 60 australian for a couple of very average pizzas wasn't good beautiful place you let yourselves down with food prices also no atmosphere around pool bar probably wouldn't stay again sorry", " ", " ", "\n", "\nDo not reccommend this hotel if you want any other hotel around the world to compare, above and beyond this hotel is I have stayed here twice with my partner both in our 20s as a getaway from work and responsibilities it hit the nail on the head.", "Im currently in fiji at a resort that doesnt even come close to nusa dua style i dont normally review but thought I must as I have just realised I experienced the best off the bat and others fail to compare", "HIGHLY RECOMMEND *****\n", "\nGood hotel but eating and drinking in the hotel is very expensive for a country like Bali. You'd better go to Bali collection with the shuttle or taxi. Beautiful surroundings. Pleasant awakening with squirrels. ", " ", "\n", "\ni like the hotel, room, pools, the ambience and many more......", "except the food !!", "breakfast was not good at all, tasteless, and not so many food variances.", "despite of the food, i will come back to stay..", "\n", "\nOverall my stay is good except houseflies and if possible, more air-con area like in the spa room and dinning areas. If guest stay more than 3 days, hope that the management comes complete with WIFI as complimentary.", " ", " ", " ", "\n", "\nAt the first we came along here actually we are not booked for a suite room.. until your humble and helpful staff Ms Ketut who's in charge on 23rd Dec 2014 at your reception desk informed us that you guys have a special \"suite\" promo.", "After that.. my wife help me to decided it was a very good and valued offering. In short we took your offering,", "Just a few note for your \"suite\" room;", "1. Please provide hanger on your bath room wall or grounded hanger for us as your guest to put our wet towels (after we asked to your reception desk on our 2nd day we stay, and they just given away.)", "2. Do you mind to keep the Air Condition at your restaurant, especially from the smoking area who stand side by side with the non smoking area (always close the door so the smoke did not reach the no smoker.. especially we brought our six months baby.)", "3. I know its not easy to change the behaviour your employer habits in servicing people, but if they could change it more nice and warm... thats would be a very great moment for us when staying here until this weekend.", "after all thanks for your kind care and attention.", "regards,", "Kris Wijayanto\n", "\nWe booked through Trailfinders and were more than satisfied. The Italian food was not really as good as the 2 other restaurants on site, which is why we marked down the food a little, but the breakfast restaurant was excellent. We weren't too keen on the stallholders on site who were a bit too enthusiastic in their sale's pitch. Likewise the sellers on the beach.", " ", "\n", "\nExcellent service & very well maintained hotel/spa. Hotel breakfast was awesome. Restaurants food varities & quality can be improved. Mosquito issue at night especially at the restaurants near the pool/beach needs to be fixed for comfortable dine-in experience. Overall the hotel & spa is awesome!", "\n", "\nmy first stay in Bali 30 years ago was at Nusa dua beach hotel. I loved it very much and came back 2-3 times after that. but at my last visit (dec '14), I felt that the hotel was not what it once was. you can feel it aging especially the cleanliness of the room/hallways. the staffs don't smile as much. but still it's a pleasant hotel with great location & good room rate value.", " ", "\n", "\nThe air conditions did not work, the room was warm. Travel cost to Baiseki Temple USD 70 per person was very expensive, on the other hand other were offering UD 70 for 3 people. Would suggest that the hotel keeps the cost low so that there people would re-visit and also inform others.", " ", "\n", "\nnice place to stay..so comfortable n relaxing..my family love this place a lot.beach so beautiful n my children love the pool...spending a day only at the pool..they love it very much..service tip top", " ", " ", " ", "\n", "\nRoom quality is reasonable, but our air condition (Rm 3003) was not cold enough. Serving at Maguro restaurant was quite slow. Food quality was poor. My salmon sashimi looks and taste stale. Overall fair.", " ", "\n", "\nQuite big hotel on the beach with many different restaurants. Tasty fresh food, even raw fish and sishi. Not brand new, but in very good condition, nice and relaxing atmostphere and extreamly beautyful garde. Frendly service. Big and clean room, exellent bed. Gym. Bicycles for rental. Surrounding suitable for jogging.\n", "\nWe really liked this hotel the food was good although a little pricey. The rooms are spacious, clean and well serviced. The main problem with this hotel is the beach, although it looks lovely its no good for swimming. The water levels are too shallow even on a high tide its waist deep and full of seaweed. We wouldn't have any problem recommending this hotel as its has plenty of pools and the gardens are great.", "On a personal note if we were to return to Bali we would head North or North West as we couldn't help feeling we were 20 years too late, as southern Bali is crazy busy and not necessarily the idyllic place you see in the brochures. Do your research and go with your eyes open and you will love this place.", "On a separate note we did 26 dives with Bali Scuba in Sanur they were brilliant.\n", "\nGreat value hotel resort - esp enjoyed our extended daily breakfasts in the package. Genuinely friendly staff; impeccable facilities with a touch of luxury (not OTT). Spa, pools, beach, sports options, restaurants, grounds, rooms all met expectations. December wet season no problems - a bit of rain now & then in brief bursts - sometimes very welcome!", "\n", "\nGreat atmosphere with traditional Balinese architecture. Amazing gardens and water features. The beach is very clean with plenty of day beds to relax on. Very friendly staff that made you feel very welcome. Good selection at restaurants and the food was very good. Great place to stay for quiet relaxing holiday ", " ", " ", "\n", "\nExcellent stay. Will definitely return. Great Balinese restaurant. Good beach and friendly staff Great for kids any age. Good breakfast spread. Rooms very comfy. Great location and near shopping mall and shops ", " ", " ", "\n", "\nStill one of the best hotel in Bali with real Bali Style. I had the opportunity to enjoyed this hotel hospitality and services over 20 years ago with family, about a year ago I decided to go back and had a wonderful time. So I came back this time and looking forward to return soon. Thank you so much. Keep the Real Bali Style.\n", "\nI have always stayed at Nusa Dua Beach Resort ever since I was young and it was always our number one choice for some where to relax. However, the only downfall I can point out is with the use of WIFI and having to pay for it. Every other hotel I have stayed at included free WIFI and believe it or not, even when you are on holiday away from reality, internet is still considered essential for staying connected. Other than that I would definitely recommend Nusa Dua to those who want to travel to Bali and experience the serenity away from the touristy spots.\n", "\nWe recently spent a week at this resort , our first as a family to Bali. This time my husband and took our 12 year old son and we couldn't have been happier with our choice. The staff and management were friendly , accommodating and welcoming . Every day we were greeted with smiles and attention to all of our needs. The hotel facilities are great. Clean, spacious and comfortable rooms, fantastic pools which my son did not want to leave. Thank you Nusa Dua Beach Hotel & Spa for making this such a memorable and relaxing holiday for all of us, and we can't wait till we can come back again\n", "\nThis was the 4th time my wife and I have stayed here, the Hotel still has that traditional Bali feel and the staff are helpful and friendly. Location wise we feel very comfortable there, a short walk to other venues and restaraunts and transport availiable if needed.", " The breakfasts are great and the staff as I have said are very helpful and pleasant, I seem to spend some time grazing enjoying the view of the pond and gardens.. Though as we normally do we decided to eat at Hotel some evenings and found the food at the Chess beachfront dissapointing, I am only being honest in saying this the seafood platter lacking to say the least. The Hotel just need at times not to forget the little things cleaning the rooms and balconies , remembering to replace towels etc .Other than that we will be back again next visit to Bali.Also we fly with Garuda /business class they just get better everytime highly recommend them.\n", "\nNDBH is a beautiful hotel, with friendly staff. Food and drink prices were on par with surrounding hotels, keeping in mind that Nusa Dua in general is a little pricey compared to kuta & Seminyak. (^_-) ", "\n", "\nRecommend upgrading to Club room. We had a fabulous week being spoilt. Hotel staff are very welcoming, it was our second time at the Hotel. Room, hotel facilities are all great. My only issue would be the Food at two of the theme night dinners, not up to the standard we expected. Due to rain this was held inside and room lacked any atmosphere. Alcohol I also thought was pricey! Otherwise a lovely stay. Look forward to going back.\n", "\nAverage services...good location", " ..should increase services...room should be more clean..specially at balcon area..swimming pool should be more clean....also at beach area...more clean.. average for overall ", "\n", "\nVery good hotel, staff was very professional and helpful. Impressive gardens and beach. I'd recommend with no hesitations to my friends for a great vacation to Bali. I felt very safe as a lot of security was around. Swimming pool was beautiful.", "\n", "\nI sit at the bar overlooking the ocean and ponder what it is I love about this Hotel. Does the hotel have great spacious rooms...Yes. Does it have beautiful pools and surrounds...Yes. Is there plenty of shade?.. Yes. Is the food good.. No, the food is better than good, its superb. Is there enough to do for a family while still offering tranquility.. Yes. Is the service good..Yes. Is the beach clean..Yes its spotless with clear water that is safe to swim in. Is it secure without being intrusive..Yes. I have felt very special to have stayed here for the past 9 days. ", " Having travelled to Bali on many occasions, I am done rushing around in the heat from shop to shop to try and find bargains. I want beach walks, relaxing by the pool and experiencing Bali's fine food, while the kids have vast grounds to explore in a safe and clean environment. The NDBH delivers this. ", " If you want shopping, Bali collection offers a wide variety of shops and restaurants at reasonable prices. It is a mere 10 minute walk away. Golf is also down the road if you feel the need to dust off the clubs. Restaurants are also walking distance. There are only a limited number to choose from though. As there is not much close by we hired a car for $20 a day including insurance. ( Hired from a small shop on the corner near the main gates. Please make sure you have an international drivers license) This gave use the use of the best Hotel in Nusa Dua and the freedom to do whatever we pleased.", " Some of the nearby hotels look great as you enter, but I need more than a good looking Hotel when I choose where to stay. I don't want a concrete jungle in the pool areas. The NDBH looks dry hot and concretey at the entrance, but once you step past the lobby, the tranquility and charm begins.", " The rooms are \" Balinese\" in decor. Functional with a charm and very clean. They are not minimalist and stark. Our air conditioners worked beautifully. We were at the front end of the Hotel away from the pool and beach. Ok I didn't have a view of the beach but I still got a view of the beautiful grounds.", " I could go on for a lot longer singing the praises of this Hotel, but I think Ill save that for the next time I visit here. There is no stress here. Enjoy this Hotel for what it is......A fantastic place for romance, a fantastic place for families and a fantastic place to wind down.\n", "\nWe enjoyed our second time at this hotel on picturesque grounds which are fastidiously maintained and with great swimming at the pools and very clean beach. We took family guests with us this time and they thoroughly enjoyed the facilities.", "\n", "\nNusa Dua beach hotel was amazing! Stayed here for our 1 year anniversary and loved it. The hotel is incredible and the staff are very friendly and helpful. It is very safe with lots of security and the hotel has their own private beach. More expensive than kuta/seminyak. But very beautiful and peaceful :)\n", "\nWe were happy with the service and standards at Nusa Dua. Our room was lovely and we have no major concerns. We will be back here for another restful visit. Most of the staff were very attentive and helpful, but this was really a minor issue. We took advantage of the spa and lap pool which is the quietest part of the hotel complex - no children under 12 & we wanted a restful break so spent most of the time here. The choice of restaurants is good, and you are very close to one of the large shopping complexes with food and retail outlets which does a shuttle bus to the hotel.\n", "\nThe hotel picked us up and it was really good service and all the staff in the hotel is very warm and helpful. We loved it very much and looking forward to stay longer each year in this lovely place. We enjoyed all the facilities that the place gave, from tennis, gym, pool and water aerobic. Just great to be in one place and do all the activities.", " ", " ", "\n", "\nOverall I like this hotel for business convention meeting related. But unfortunately its reception/guest officer in the morning session is not really responsive dealing with guess.", "My self & colleagues need to unnecessary wait for something that shall be done easily related with transportation to our golf event.\n", "\nThe hotel is very nice and clean with private beach. Service is superb, food is excellent, room is excellent. The surraounding of the hotel is very clean with great plants and big swimming pool. Our family wanted to come again in future.", "\n", "\nThe hotel is very nice and clean, has beautiful rooms and has friendly personnel. However the hotel is mainly aimed at people that just want to enjoy the beach and not experience much of the \"real cultural Bali\".\n", "\nFrom the pick up at the airport, Sudakita at check in,Anom at the beach all the staff made an effort to talk to you and make you feel welcomed. The Spa offers a range of services and we enjoyed a massage every 3 rd day. The themed nights were a good way of seeing some of the local culture. We enjoyed 10 relaxing days and would recommend a stay at Nusa Dua Beach Hotel.\n", "\nThe Property is good, spa is excellent, pool is great.", "However we stayed there 4 days, and were given the exactly same items for breakfast on each of the days ! Even the location of the items was exactly the same ! Also vegetarians beware, not much to choose from. Wish I had confirmed this before booking. Also the beds were not comfortable. The beach waters were having lot of weeds, we were told it happens on some days.\n", "\nWe enjoyed the facilities. The beach had plenty of lounges and a decent amount of shade. The other facilities were well mantained. The gardens are outstanding. We ate at a variety of the restaurants and the food was always good. The rooms are Balinese in design and vary in size (we stayed twice during our visit to Indonesia). Housekeeping, though, was spotty. All in all, a good place to stay.\n", "\nBeautiful resort with amazing beach front and great location.", "My sister and I had one off the best holidays spent here for sure.", "The food was great clean rooms and staff were all lovery.", "Can't wait to return .\n", "\nThe overall stay was pleasant and the rooms are clean and tastefully decorated with heavy hint of Balinese style.", "The food at the resort can be and should be better.", "We tried the fried rice and perhaps I have had high hopes since most Indonesian establishments do a good fried rice, the ones I had falls short of expectation by quite a bit.", "The staff at the kids club were very good and our kids loved the place.", "The most glaring problem of the place is that there is no communication between departments, if the matter is not handled by the person on the phone, he/she will just ask you to call the relevant party, or on 2 occasions, mumbled ok/yes and then completely forgotten about it.\n", "\nWe had a fantastic time at this wonderful beach front hotel and we will come back for sure. Friendly staff and clean and modern rooms combined with an excellent location. We also enjoyed the nice restaurants with a large selection including gluten free items on the menu. ", "\n", "\nBeautiful resort professional staff beautiful well maintained gardens and buildings great spa would recommend to all has everything for families couples of all ages great for people from any country ", " Very relaxing ", " ", " ", " ", "\n", "\nit was great location. room condition is soso...", "we had to participate congress in convention center, that's why we choose this hotel. price is expensive compared with Kuta hotel... how many letter should I leave?!! ", "\n", "\nIt was our first stop in our honeymoon. We were shocked by the beautiful lobby and even the smell was gripping. Amazing gardens, kind and very helpful help, and gorgeus breakfast at a really very good price-quality relation. ", " ", "\n", "\nWhile this is a very good family hotel and most of the staff are friendly and helpful they need more training. We stayed at the club which has a beautiful setting but when we arrived at 4pm taken from the airport by a hotel car so they knew when we would be there, the room was not ready and we had to wait another hour before getting a room, Not a good way to start.", "On the evening we went down to the club for cocktails but there were no seats outside so we sat inside, I know they were busy but after 10 minutes I went and asked a waiter to get us a drink. 10 minutes later I asked again , shocking service. However as the week went on things got better and we enjoyed our stay. A shame that on our return to the airport they tried to save money and put six of us in one car, we got two in the end but the impression it left was not good.", "Could do a lot better\n", "\nWe stayed for 9 nights and had a lovely, relaxing hoilday. There was great variety in food and all the staff were friendly and helpful. The resort is right on the beach, but there are also many facilities and activities to participate in if the beach isn't really your thing. Overall, we highly recommend Nusa Dua Beach Hotel & Spa! Will definitely be back in the future!\n", "\nPerhaps because the hotel had a low occupancy we found the food quality generally poor - stale seafood, dry chicken, poor quality steak, etc. After two days we decided to have all meals in other hotels and outside restaurants. Otherwise the gardens and beach were great and the service very good.\n", "\nLovely hotel, very close, 5 min walk to the Convention center. Can swim in the pools or the ocean. We arrived at 8 in the morning for a meeting and our room was availble for us. Only complaint was there was not internet in our room but would absolutely stay here again.", "\n", "\nThe hotel surroundings are excellent for this hotel. The Balinese structures the pools, the beach, the facilities are all very nice and well maintained. However, when it comes to their rooms, it was appalling. We had the family room as we had 2 kids with us. Nothing really works properly in the room. There were so many fault.", "1) The master bed creaks as soon as you sit on it.", "2) The wardrobe light does not go off when you close it to go to bed at night", "3) The wardrobe door fell out and had to get the maintenance guy to come in and fix it. Was fixed Thankfully. Service was quick too.", "4) The sliding door to the garden was also stuck half the time. Had to use the kid's room to access the garden.", "5) Toilet basin was stuck. Was rectified too.", "I really think you should upgrade the rooms as its a shame that a hotel has a beautiful facade but terrible family rooms.\n", "\nWe loved our stay at Nusa Dua Beach and Spa Resort. Beautiful resort in a great location away from the hustle and bustle. ", "Plenty of great dining options within the hotel and Nusa Dua is only a 5 minute walk.", "Highly recommend to families and couples looking to relax.", "\n", "\nOur time at Nusa Dua Beach Hotel was wonderful from the time of checkin at the Palace club to being shown to our suite. What a gorgeous representation of old Balinese architecture . The suite was luxurious in every way and spacious and clean. It went way beyond our expectations and we felt very privileged to be there. A private pool overlooking the ocean was a great bonus. The staff at this hotel obviously have great leadership as our every wish was catered for and they were outstanding in their service. We will definitely make this our choice when travelling to Bali again.\n", "\nWe had Another great stay @ this pretty balinese architectured resort hotel. Had a free upgrade from Deluxe room to Premiere room. Reservation staff provided our request on room preference which closer to swimming pool. Beach chairs were ready on early morning just before sunrise and beach always kept clean by hotel. Special thanks to Bapak Sukadana from swimming pool, and Bapak Swastra ( I am sorry if mispelled ) from Wedang Jahe restaurant :) for their kindness and services We will be glad return here one day......\n", "\nwe have been many times to your hotel and every time we love it more. often we stay half our time at your hotel and half at another one we always come away just loving the beauty of nusa dua beach hotel and spa we have recommended many of our friends to stay there and they all love it too. we refer to it as our second home ", "\n", "\nThe hotel is as lovely as other establishments in the same area with beautiful gardens, tidy beach, lovely pools and great ambiance. The room was okay, clean and nicely decorated, nothing amazing. Besides all these wonderful surroundings and facilities, I was expecting professional, highly competent staff especially when if there is unexpected problem. However, some staff was not as helpful and resourceful. Check-in took me 15min, longer than I expect. And, I had some dispute over the wifi. I was 'kicked' around different personnel before I got to the front desk manager and got it solved. A big disappointment cause it was 3 days after my check-in. Will only stay again if the price is right.\n", "\nOur stay ticked all the boxes for a relaxing break. Food delicious, staff attentive, room clean, quiet and functional. Security was great when we forgot to lock the room safe the room was double-locked until we checked all was still present. Excellent beach and 4 pools to choose from. Loved it.\n", "\nI would have expected better value for money.", "Beach is not good for swimming, lots of see weed.", "One lady from the taxi stand, who is supposed to be helpful, was in fact not helpful at all and not trust worthy, very bad attitude, gives a really negative impression about the place and people.", "I wouldn't stay again at this place.\n", "\nThe hotel is great, and it is undoubtedly one of the finest hotels on the island. It has been very well maintained and the established gardens are beautiful. There's lots of shade, and the beach is a lagoon style and tidal, and is also very clean. The rooms are spacious and beautifully decorated. The service is impeccable and fine cuisine will please all palates. Definitely, would recommend this destination and would visit again\n", "\nI recently visited Bali for a conference and stayed at this hotel just 5 minutes walk to the conference venue. The hotel's room was nice and comfort. Breakfast was average, not much variety. The hotel's staffs were very helpful.", "\n", "\nA very nice, very big 5 star resort. We stayed in a Palace Club Room - would definitely recommend upgrading to the Palace Club. Complimentary afternoon tea, nibbles and cocktails in the evening, with complimentary tea, coffee and juice throughout the day. The staff in the Palace Club were outstanding, taking the time to chat with guests and showed a genuine interest in their stay. Be sure to enjoy a drink or dinner at the Chess Restaurant and Bar, where the hotel band plays. We were astonished at how good they were - taking requests from guests and playing every song. The beach at Nusa Dua is nice - much the same as Seminyak/Kuta but without the abundance of hawkers. Nusa Dua is the place to stay if you want to be away from the real Bali. Very well suited to families with several large pools, volleyball, table tennis and basketball available.\n", "\nPaid for a deal here for 8 days with the palace club. cost $$", "Room is nice and big 1 bedroom unit.", "Food was good at restaurants especially the fish and the beach Restaurant had a nice atmosphere right on the sand.Overall the food was good including palace cub. The only", "comment i would make about breakfast (palace) was that it never changed and not a big range and too many pastries. (croissants good). The chefs/cooks cook food well.", "Generally the staff friendly and helpful esp Palace club.", "However our deal included a butler and were heard from him on the Night (phone) before we were going home asking us if we needed anything and he asked if we wanted a meal ticket for dinner as we were leaving. (which was good if earlier).", "I swam in their Lap pool (i was silly enough to put my head under water) and i ended up with ear and eye infections (bad). Also my Wife and i got chest coughs ( Hers bad and still going)", "i cant really say from where but maybe a/c.", "The room was a bit tired looking esp outside lounge and my wife wasnt too keen on many squirrels running around outside which i didn't mind however.", "No free mini bar however and all drinks and food had to be consumed at club.", "Went to all the Bali dance shows the fire one was most popular but also shortest.", "My wife did get bali belly but that was from same show bbq.", "Overall good but not an eye for finer things (eg pool/ac bacteria) and checkin (VIP Staff) brief explanation and soon forgotten even when i asked them for something i needed.\n", "\ngreat accommodation, beautiful scenic property, magnificent pools, great breakfast choices and all and all a great experience. Thank you for a great holiday. ", " Also ty for our anniversary and birthday gifts.", " ", "\n", "\nThe hotel was wonderfully quiet and relaxing and we really needed this on this stay.", " The hotel would be very different at peak season we believe.", "Food and dirnk is expensive but the choice is varied if average in quality.", "The staff are the best asset the hotel has.\n", "\nBeautiful hotel. Relaxing atmosphere. Several restaurants serving Balinese, Western and Asian foods. Private beach. Friendly staffs. The shower area in the hotel room should have a door to avoid water spillage though. The hotel is within walking distance to the Nusa Dua convention centre. Transport by car from the airport take just over 20 minutes.\n", "\nStay was very good, only 2 small complaints, pool was very warm almost like a bath at times and the tiles around the pool was very slippery and dangerous for kids............ but on the other hand, service was brilliant, food was amazing (buffet breakfast was the best i have ever had), location is fantastic, beach is very clean and you do not get hassled by anybody!\n", "\nWe picked this hotel for our stay in Oct. The experience was good. Wonderful staff, good food, but not walking to outside the resort. There is a shuttle to a nearby shopping area. If you want to just chill on the beach, this is the perfect 'bang for your buck'.\n", "\nNear to the beach, nice dinner on sand by The Chess , quiet surrounding and friendly staffs. Only one thing-low water pressure. but still OK. Breakfast buffer was awesome. Definitely will stay here again.", "\n", "\nA fantastic and relaxing holiday. Service and friendliness of the staff is outstanding. We really enjoyed our cooking class by Katut and would highly recommend this to anyone interested in cooking. The theme dinners and dances were great also. Very good restaurants. Spa treatments very professional. Thank you to all for a wonderful holiday.", "\n", "\nThis is a good resort to stay and relax avoiding daily problems. During Monday to friday is so quite and relaxing. On weekend there are some noise due some kind of customers. (family with young kids). The only thing I want to remake is the following: Air conditioning in room is VERY NOISY and the temperature is not cold for me. (20ºcelsius). Staff very kind and helpful is the best. Also the facilities are very good (restaurants, Swiming pools and, of course) the paradisiac and very well cared beas)\n", "\nI stayed here for 4 days. Children loves feeding the squirrels, running after ducklings, make sand castle. Many big trees to provide shade. ", "For parents who just want to relax and rest while kids have activities, this is a superb place. No need to go out to the hot, humid and heavy traffic city.\n", "\nIt'a a perfect weekend getaway place, to chat all night long at the white smooth sand beach.", "A very solemn, quiet, and peaceful to really forget about your daily routine and fall to deep rest", "Nice food too", "\n", "\nFantastic staff and service always eager to assist,we absolutely loved this place. ", "A beautiful Balinese style hotel with great beach and pool area, numerous options for dining and delicious breakfasts.", " ", " ", "\n", "\nWe had a lovely time at the Resort. Staff very friendly, and food and facilities excellent. Albeit we were in the Palace Club Suites, so got the best of everything, but nevertheless couldn't fault the service (other than on departure), amenities and most of the food. Only negative comments are that the seafood all tends to be grilled and somewhat over cooked, which dries it out a bit. Best to order it steamed - has much more flavour! And only sour taste was upon departure. Although we had arranged for bags to be picked up at a certain time, and the complimentary transport to the airport the same, neither occurred, which left us rather stressed at the end of our stay as we ended up running late to get to our flight. Had only booked and confirmed it 2 hours earlier, and no-one could explain why it didn't happen? Ended up being run to the airport by the bell boy!\n", "\nA great room were arranged even i didn't make any request, so thankful to the resort management. Total of 5 rooms i booked were located just beside the pool. Only few steps away from balcony, it would be the best room i ever stayed.", "Breakfast is prepared in order to suit everyone's taste, i miss the buffet so much.", "Staff are friendly and explain to us on how to get to the nearest attraction point.", "Definitely will come back again!\n", "\nThe Nusa Dua Beach Hotel has been an absolute oasis in the hectic world that is Bali for the tourist. The staff are genuinely welcoming all day long, and the food has been exceptional. The buffet breakfast is amongst the best I have had in Asia, and the restaurant food and room service are also very good. We visited Kuta to shop and Seminyak for a couple of beautiful dinners, but felt very satisfied lazing around the hotel for a very relaxing and peaceful break. The hotel has stood the test of time- having been opened in 1983. It has been very well maintained and the established gardens are beautiful! There's lots of shade, and the beach is a lagoon style and tidal, and is also very clean.\n", "\nWe spent 9 days at the Resort with our Family. Very nice location and the staff were lovely. Breakfast buffet had a good selection however the other restaurants and drinks within the hotel were pricey and not value for money. Rooms and bathrooms are a bit 'tired' but clean. We celebrated our daughters birthday there and the staff went out of their way to make it pleasant. I would recommend this destination and would visit again.\n", "\nWe were very impressed on many levels with this hotel and in particular with the staff who were always willing to provide first class service. The restaurants are of very good quality and offer great value. The location and overall atmosphere where ideal and we highly recommend if staying at Nusa Dua.", "\n", "\nWe had a very pleasant stay except for the very high humidity-even the swimming pools were quite warm.Thats not the resorts fault though.", "Our trip was cut short by a serious ilness in our family that required us to return to Melbourne immediatly.The staff were very understanding and assisted with all arrangements.", " ", " ", "\n", "\nI stayed for a conference for one week in November 2014. I found the atmosphere excellent, staff was very polite and always helpful. The swimming pool was fabulous as was the beach area. I strongly recommend the resort to all. real value for money.", " ", " ", "\n", "\nExcelent service, always with a smile!", "Friendly staff, wonderful beach and pool area. Great variety of food choices.", "Loved the small ponds with fish and the squirels!", "Overall a wonderful week spent in Bali!", "\n", "\nThe Nusa Dua Beach Hotel and Spa was the perfect hotel and garden to truly relax and be spolt by the wonderful and efficient staff, whose friendly and professional nature ensured that each individual experience felt unique. It truly was authentic Balinese with a magnificent five star hotel being intigrated into a garden without disturbing the local flaura and fauna it was delightful to see nature at its best, whilst still recieving five star cuisine five star entertainment and service that was efficient and memorable. Thank you for a wonderful experience.", "\n", "\nAverage experience. Mucked up our booking. Stressful arrival. Hotel was great but would have been nice to have a better start.", "Average experience. Mucked up our booking. Stressful arrival. Hotel was great but would have been nice to have a better start.", "Average experience. Mucked up our booking. Stressful arrival. Hotel was great but would have been nice to have a better start.", "Average experience. Mucked up our booking. Stressful arrival. Hotel was great but would have been nice to have a better start.", " ", "\n", "\nWe were looking for a holiday to unwind from a stressful 6 months (moving house/new jobs) and decided on Bali - like most people these days we researched the internet and came across an offer for this hotel through luxury escapes and decided to give it a go. We were not disappointed!!", "If you are looking for a modern - high end hotel with cutting-edge everything then this probably isn't the hotel for you. But if, like us, you are looking for grace, relaxation, wonderful friendly staff who really want to serve you, nice clean beaches, great pools, manicured lawns, spa etc just to spend each day relaxing then this really is the place. Although being quite large, it felt surprisingly quiet and I had some of the best sleep i've had in ages. The pool area did get quite busy but we always found sun loungers (tip, go down before breakfast and reserve your loungers with the towels supplied - they will still be there as long as you return within a couple of hours). The Breakfasts are really great but the rest of the food became a bit 'samey' after 10 days despite there being a few restaurants on site. We upgraded to the club rooms which was well worth it - the private lounge area was great and the added free afternoon cocktails, and all day soft drinks and snacks made it well worth the extra cost (plus the additional space you get in your room). a couple of other tips - if you want a taxi, don't get it from the hotel, just walk out of the front gates and you will have your pick and can negotiate a price before getting in. Secondly - DO NOT uses airport porters - don't even let them pick up a bag - they will hound you for money and you really wont need their help. Anyway I meant to post this review a couple of months ago but it was only this week when we have booked our flights and accommodation to go again next year (we have never done that before) that I thought it was only fair to share our experience - it really was one of the best we have had!\n", "\nPurchased a package which is similar to those available f4rom the hotel web site.", "Excellent hotel and service breakfast overwhelming and by day 8 down to Poached eggs.", "A couple of small things wrong and fixed within minutes with no excuses, many others should learn from this attitude.", "Morning \"health\" drinks served along beach walk\n", "\nQualification of \"Excellent\" is below the standard that I would describe the Nusa Dua Beach Hotel and Spa. It is not just a hotel, it's an experience that leaves you a better person! What makes the beautifully manicured grounds and the spectacular décor so exceptional is the team that provides the service, from the managers who welcome the guests, to the reception and service staff - who made us feel so welcome, to the people that maintain the pool and the old men that rake the beach every morning at dawn, not to forget the Yoga Master, the ladies at the Spa and the invisible people that cleaned our rooms and cooked our spectacular meals. ", "It was not just going in holiday, it was coming home to friends. ", "Little things like fresh flowers, fruit baskets every day, friendly smiles and acknowledgements made this stay so memorable. It is no surprise that we met with lots of people coming back, again and again, some as long as 26 years over. We understood that some of the staff members have been in the hotel since it was opened 31 years ago. How does an old hotel maintain its character? It is not just the surroundings, which are spectacular, but the people that work there! A truly memorable experience, 10 out of 10!\n", "\nMy wife and I enjoyed a wonderful relaxing 9 nights at this hotel. The staff made us feel very welcome and comfortable. The hotel grounds, pool areas and beachfront were always immaculately clean and well presented. A special thank you to the staff in the Palace Club with who we fell in love with.", "This is a great place for a honeymoon or for couples looking for a more quiet and relaxed location away from the crowds at other Bali destinations.\n", "\nAbsolutely beautiful resort. We stayed for 5 days to celebrate our 10 yr wedding anniversary. Very quiet relaxing resort. Food and service was amazing. Enjoyed every part of our stay. Cant wait to return with the kids!", "\n", "\nVery well maintained property. Staff was great! However, F&B had some problem coping with the crowd during peak season. We stayed for 9 days and had the same breakfast everyday. Would be nice to have some changes (especially the hot dishes) every few days. ", "\n", "\nNeed to pick up used towels from pool area when guests leave. Staff in Executive club very good. Thought the food in club at happy hour not as good as last time,but great at other times. Would be nice touch to have fresh flowers after day 3", "\n", "\nnice places at nusa dua and good view, good service over all for receptionist, for breakfast menu need more variants for Indonesian menu, and maybe for food is expected to stay warm, because lastday for fried rice is cold not warm.", " ", " ", " ", "\n", "\nWe had a great 10 day holiday. The people, food, service were all great. More shade around the pool would be great. A shame the kiddie pool is by the pool bar. ", "The hotel staff were exceptional and always smiling and making us feel welcome.\n", "\nWe stayed at the hotel for eight nights and it over achieved our expexctations. We have been to Bali many times but was the first time we stayed in Nusa Dua. I must say that we will defintitely be back.", "The staff at the hotel were so welcoming from the time we arrived to the time we left. The food at all the resorts restaurants was delicious and the breakfasts were amazing, the variety of different food was incredible.", "The rooms and grounds were always kept immaculate by the extremely hard working staff.", "The Nusa Dua Beach Hotel & Spa is a must for any travellers wanting an excellent experience whilst enjoying a very relaxing holiday.", "Thank you to all the staff for making our stay very enjoyable.\n", "\nStayed for a long weekend, attending an event at the convention centre just across the hotel.. Due to the weather (too hot and sunny, not my cup of tea), during free time i prefer to stay at my room, enjoying some little peace of mind.. The staff were all very friendly, always smiling and greeting when you meet them.. The room was spacious and clean.. There's a lot of options for the breakfast, but if i could give a suggestion, please provide bread that are not made with eggs.. Overall really like this hotel and would come again next time..\n", "\nVery nice and confortable rooms, only down side is old furniture.", "Good service, nice pool, geat breakfast.", "A bit pricy but in line with the 5 star surroundings.", "Recommend for a relaxing vacation, bot for family or couples.", "\n", "\nthe place is amazing but a little bit scary when i walked alone from my room (2212) to the mart, i think you should put some lights more :( but overall, the place and the services are great, the staff helped me a lot and friendly. It was a nice trip there, thank you very much\n", "\nVery glamorous hotel. Excellent location within good reach of sites.", "Good pool choice and great beach all very close to rooms and dining. Quiet and uninterrupted. Children had a ball! We enjoyed the whole resort.", " ", "\n", "\nAll good here with the location , service ,staff ,facilities at least worthy of 4 stars and apart from a few little problems we had a good time and tried to cancel our next hotel at a different area on Bali to stay here longer as it was great value . We had bought a package which included a few extras which made the value excellent\n", "\nI booked an ocean view room but did not get it. The pool was too warm. The staff were all very friendly and professional. The restaurant food was a bit on the ordinary side compared to some of the good restaurants now on Bali.", "\n", "\nAll worked well, this is not the first time we stayed in the hotel, previously was thirty years ago. The hotel has change in size however managed to maintain the good atmosphere . I'm sure we will be using the hotel again next time we come to Bali", " ", " ", " ", " ", "\n", "\nEnjoyed my stay.Found the hotel safe and relaxing.The staff were very ", "helpful and friendly.I would have no problem recommending this hotel.", "There was only one minor fault the bar prices were a bit up there.Other", "than that we had a wonderful stay. ", "\n", "\nThis was our first time to Bali. We found the Customer Service was of a high standard. All staff were friendly, well informed and happy. Absolutely, nothing was too much trouble. The whole resort was spotless. The Spa facilities and lap pool were perfect providing a peaceful environment. We would definitely recommend this resort.\n", "\nWe have just returned home after our 2nd visit to this hotel. I didn't think it could improve - but it did. The welcome we had from staff was wonderful, we were welcomed as friends who were special. The hotel provided transport from the airport, the most comfortable vehicle ever, the driver was great. Offered water on getting into the car. I wasn't allowed to help with our luggage. Top class service. Check in was again great. With a cold towel and a very welcomed fruit juice. We were escorted to our suite - what a gorgeous one it was. We had sea view, a beautiful balcony and much, much more. Meals at this resort are great. Eating at Chess on the beach at night was a wonderful experience. Breakfast in Palace Club was excellent, all staff very attentive - special thank you to Ayu for her wonderful helpfulness. The chef was first class. ", "Would certainly recommend this resort, and the upgrading to Palace Club. Well worth it Sad to come home. Thank you all at the Nusa Dua Beach and Spa\n", "\nWhen we looking for a honeymoon destination, we wanted something aouthentic. This hotel was by far the best choice! Maybe it's not that polished and new as some other near by but has special kind of energy. We loved every moment. Great staff, very kind. Good for family vacation as well.\n", "\nwe chose this resort for our first OS family holiday as it looked clean safe and impressive and it was certainly all of those. ", "We felt the 21% service & tax on every purchase was a bit steep. ", " ........", "\n", "\nGreat hotel. Beautiful and friendly staff. Beautiful grounds. Food was delicious and we only ate at the restaurants on the grounds. I was extremely disappointed that when we got to our room there was only 2 beds for 3 people. We had an extra bed brought up promptly but it made the room way too small. This was the only down side though. Would stay here again if we return to Valu\n", "\nWe found NDBH a great place to visit and stay. The people are all smiles all the time and always ready to help. ", "The food is excellent at all the restaurants. ", "The pools are very very clean and large.", "The only issue we had is the kids pool is next to the pool bar. Nice for parents but not for couples.\n", "\nFirst time to Bali and what a welcome. Truly amazing hotel, fabulous staff, facilities just perfect. Rooms are comfortable and tidy, swimming pools quiet and relaxing, always get a lounge at the edge of pool. Prices are reasonable. Spa and adult pool Devine. Highly recommend yoga each morning and the cycling tour should not be missed. Will be sad to go home in a few days!\n", "\nFirst time back after or honeymoon 30 years ago but this time with 2 older children and 2 friends. We booked this holiday through Luxury Escapes who every now and then have great deals for this hotel. The hotel has been extensively renovated but still has the wow factor that I remembered. My son 22 walked in and said 'this is a bit too upmarket for me.' Apparently November is a very quiet month in Bali and the hotel was quiet too. Bonus for us as loungers by the pool were easy to get, spa bookings easy and overall staff jumping out of their skin to help us in any way. The staff were great and genuinely lovely.The deluxe rooms are the basic rooms but are pleasant and clean and well air conditioned, which is very important. The breakfasts were awesome in a very nice restaurant with everything you ever want to eat. Really enjoyed the omeletes and fresh tropical juices. We enjoyed the 3 banquet meals at night especially the modern fire dance next to the beach. Heaps of variety on the menu. The only thing we found was that the outdoor venue for the Legong and Kecak dances was too hot. Maybe it was the time of year, or the combination of spicy food and heat. Watch out for whole chillies in the salad, I bit into one and it nearly spoiled my night. Why would you put whole green chilli in salad? The early morning complementary refreshments by the beach was a nice surprise with the staff there especially Dewchtha very friendly. When you stay here try to get up early and see the sunrise and walk along the path connecting all the beautiful hotels. The gardens and surrounds at this hotel were extremely well kept and beautiful. The spa is awesome and entirely relaxing with a lovely pool that is refreshing in the shade. The lobby bar was a nice spot in the evening for cocktails. The swim up pool bar another cool spot for a drink my daughter age 15 enjoyed the fruit punch here. Overall I recommend you go here for a 5 star experience in a grand, sprawling but not too busy hotel with great staff. Found the new toll road a great way to get to see the sights much more quickly than in the past.\n", "\nStayed here for 5 nights and enjoyed every moment of our time. the pool was the cleanest pool I have ever seen. We have eaten in two of the restaurants inside the hotel (Pool one and the Italian one) and enjoyed it both.\n", "\nWe had initially booked 6 nights and planned to move to another hotel afterwards but extended our stay at the NDBH for another 6 nights because we liked it so much. The hotel has a true Balinese feeling (which is something a lot of the other hotels nearby are missing) and the friendly, attentive staff and the beautiful, well kept, spacious hotel facilities made us feel so comfortable there. We ate at the hotel's restaurants a few times and never got disappointed. We used the Spa, the gym and also took yoga classes, all very relaxing and fun.", "My mum had to see a doctor, there is an on-site clinic and they looked after her very well. The next day she got flowers sent up to our room with a lovely card from the hotel manager.", "There are a few bits and pieces that need improvement: on our arrival, the hotel room was not very clean, in particular the floors and also the bathroom could have done with an extra scrub. The check-in process took a very long time although there weren't many people waiting to be served when we arrived.", "But we hope we will be back again!", " ", "\n", "\nI have stayed before and so loved the hotel and spa ", "My sister and niece who has disabilities really needed a break they thoroughly enjoyed your peaceful relaxing resort and we will all be back again", "Thank you so much for making our holiday so special", "Cheers Judy Fitzhardinge ", " ", " ", "\n", "\nEverything was great, the rooms were lovely and the room cleaners both male and female did a wonderful job, we came back from breakfast to a sparkling room .Breakfast food was fresh and tasty, lots of choices and continually refilled, tables cleared promptly and assisted seating during busy times so no wandering about looking for a table. The pizza from Sandrino was better of a night than during the day and the light meals from chess very good value at any time. The beach was clean with plenty of lounge chairs for everyone and good service for icy cold drinks. The Spa what can I say only that it was heaven well worth going to this hotel to be pampered and treated like honoured guests We were given tea before and after and we could use the Spa pool which was very private. We would return to this hotel in a heartbeat. The managers and staff should be very proud of what they have achieved at this hotel. A great team from the lowest to the top.\n", "\nMy wife and i had three glorious nights here, rooms were excellent, pool, beach, resturants, the whole expereance very pleasurable. Resort has everything to offer including masage at the day spa, you can relax by the beach or pool.\n", "\nThis was our second visit to this hotel.", "The staff are great, especially TARKAR - who met us at the airport and returned us all the way to the check-in desk on departure, even looking after all our luggage. Very appreciated considering my partner is struggling after illness and uses a walking stick. ANIT at the pool took extra care of us and all the staff in the executive club are fantastic. ", "The rooms are comfortable, but a little more care with the cleaning is really required and the furnishings are looking tired and cushions grubby. The grounds are full of beautiful flowers BUT none in the rooms. Mini bar is overpriced so shop in the village for drinks and snacks. Door catches in bathroom and robes did not work and the entire room was a little lacking in lustre. Wi-Fi only works sometimes, which can be frustrating.", "Pool staff generally do nothing all day. and don't bother to tidy around the pool all day, with wet towels lying everywhere and sun lounges all over the place! A bit of direction from management I think is needed here.", "Theme night food is OK but nothing to rave about, atmosphere where the fire dance was held was great and the food was tasty. Thanks to SIOBHAN who helped with my partner and made the night enjoyable for me.", "The Executive Club cocktail food is boring and tasteless compared to our previous stay, but the breakfast and service are great. The food at the Chess restaurant is delicious.", "It was like the food budget had been cut and it showed in the food that was being served.", "The location is close to beach, Bali Collection and the area is lovely.", "We got the impression the Management have lost interest in the Hotel, it just needs its spark back, but in saying that we will return to this hotel.\n", "\nIt's a good Balinese hotel but it's starting to look a bit tired, we have stayed here before and everything was great but this time the air conditioning was not working properly, some meals were not up to standard , and still no wifi in rooms, only in main areas . Staff still excellent and friendly and helpful.\n", "\nThe hotel is lovely, pool area and gardens are beautiful the beach was lovely and clean. The rooms are a good size and the bed is very comfortable. My only complaint would be the cost of food and drinks in all honesty ridiculous a small bottle of water was $4.60 the same price as a soft drink I have stayed in 5* hotels before and never charged this amount. The shop in the hotel sold soft drinks however they were also extremely expensive (they didn't even sell ice creams). When we had the theme dinner at the hotel no water was supplied, we ordered 5 bottles of large water (normal aqua and they were nearly $10 a bottle, It was a shock when we received the bill). The food at the theme dinners was average. Regardless of the exclusive area of Nusa Dua the food needs to be more reasonable. We really enjoyed our stay however if the food and drinks had been a better price we may have eaten at the hotel more. We would get our drinks from the shopping center and bring them back. There was 12 of us at the hotel having a family celebration.\n", "\nOur dream stay in the Nusa Dua Suite for 7 nights.", "We were 5 of us, including our little one who is 3 years old.", "The entrance to the hotel complex is secured and very well taken care of.", "The hotel entrance is very beautiful with those “beringin” trees and the 2 balinese columns.", "About our suite:", "We had a direct access to the beach and were 20 meters from the main pool. We also enjoyed our private swimming pool which is very discrete and not visible from other guests. The gazebo has a direct view on the beach, as well as the 2 individual balconies of our bedrooms, so we could enjoy each moment close to the beach.", "Beds are very comfortable and cushions are made out of the best material. Bed rooms were nice enough, all with a wooden floor, pantry, desk to work, plasma TV, etc…", "We also enjoyed the Jacuzzis, there is 1 in each bathroom attached to our bedrooms.", "There was space more than enough, private dining room, a space to relax with 2 sofas, an office (that we actually didn’t use).", "We appreciated also the bathroom close to our private swimming pool which was very convenient once we came back from the beach or were finished swimming.", "There is a small kitchenette that we used to warm up food for our daughter and make some tea.", "About the service and amenities:", "I had to work each morning and needed the wifi which had a very good signal.", "The butlers were very polite and discrete at the same time. They would come and clean the room each morning and come again in the afternoon to prepare our beds, clean again and change our towels.", "Fruit basket was provided; flowers have been changed on a regular base.", "Surrounding of the hotel:", "By walking around Nusa Dua on the seaside, I must say that Nusa Dua Beach hotel and resort has one of the nicest beach and especially enough loungers for all their guests. Beach was cleaned each day and was very nice.", "During low tides, we would move to one of the main swimming pools, which were always clean and never overcrowded (we stayed 2_9 November, this is also maybe the reason)", "Our daughter enjoyed the Gecho kids club, and loved the kids swimming pool. This is the only remark that I would have, is that next to the children swimming pool; there is no kids’ lounger or a few bean bags. At the kids club, we were always well greeted with a nice smile. Our daughter loved the activities, such as animal feeding, baking, making a cook hat, drawing with sand, and much more activities.", "Breakfast took place in a nice atmosphere, and the juices were my favorite and excellent.", "All privileges given to the Palace members were much appreciated, such as afternoon teas and cocktails, and the staff is very well trained, always smiling, and very professional.", "I cannot comment on the Spa neither on all the activities offered by the hotel as we didn’t use them.", "We had in room service and have also eaten at some of the restaurants, or had a drink at one the bars and there has been no food or service that we can complain about. (they also provide kids menu  )", "We would like to thank all the staff of Nusa Dua Beach Resort and Spa to have made our stay so wonderful and congratulate the management on such professionalism.", "\n", "\nGreat resort if you want to have everything at your fingertips. Great, pleasant staff, huge pools, great beach, heaps of food options. AMAZING air con and rooms, just great overall and would recommend to all", "\n", "\nI stayed at the Nusa Dua Beach Hotel & Spa with my mother and 2 kids (11 & 13) late November 2014. The property is gorgeous. Very palatial and serene. The rooms were a little smaller than I'd expected but they were still spotless, extremely comfortable and had everything we needed so not a drama. The grounds are superb and so well maintained. Loved the pools - like warm baths. The day spa was lovely also. We particularly enjoyed the beautiful breakfast area and comfy bar lounge. Would highly recommend this property!!\n", "\nWonderful and relaxing. Staff were friendly and welcoming, room was comfortable and food was excellent - thank you. Excellent spa treatments and hotel close to shopping areas with beach on the doorstep.", " ", " ", "\n", "\nStayed for 5 nights. Breakfast buffet is awesome. Room is great with garden view with squirrels, birds. Room smells good everytime we got back from our tour. We want to come back soon in the same hotel.\n", "\nAll areas of the resort came up to our expectations and more! The Manager and all staff were extremely friendly and helpful. Nothing was too much trouble. The staff couldn't do enough for us. Thank you, Luxury Escapes for this wonderful offer.\n", "\nWe used our Cudo purchased voucher when staying here and it was well worth it. The staff were very friendly & helpful. The rooms were clean and comfortable. Didn't have a bad meal the 10 nights we were there. A complimentary birthday cake when it was my daughter's 6th birthday was just one of little extras they provide. It was also nice to be in a 'Bali' style resort and not all westernised.\n", "\nWe loved the Balinese influence of the hotel. All staff helpful, cheerful and friendly. Made to feel very welcome. Spent most days relaxing at the beach, enjoying the warmth of the sunshine and swimming in the blue seas. ", " ", " ", "\n", "\nWe had a luxury escapes stay. It was amazing. The way the hotel gave flowers and fruit bowl to our room on hearing our little boy was unwell, was such a pleasant surprise. I would love to be informed if you are going ahead with another luxury escapes package as we would love to return\n", "\nWe have stayed at Nusa Dua Beach Hotel and Spa twice now and will continue to go back. We travel with young children which isn't always easy however our stay at this hotel has always ensured that it goes as smoothly as possible. The rooms are spacious, the staff are wonderful, the breakfast is great and the lagoon pool is ideal for people travelling with children. I genuinely love everything about this hotel!\n", "\nFantastic hotel, excellent service.Lovely Balanese style rooms, the biggest bed ever.Pools good, beach breathtaking, but beware the hawkers! Had a personal guide who drove us around the islands best bits.All the staff were very happy and always had a smile.Food was different but thats to be expected.A short walk away to a few shops, which sold many spices to take home, incredibly cheap especially vanilla pods.\n", "\nI normally write long reviews but will keep this one short.Bottom line is it's an amazing resort if you want to unwind and be spoilt by the staff who are very eager to always please,and that sort of summed up my vacation.Drinks and food are very very expensive all-around in line with staying in Nusa Dua.", "I strongly suggest you book a club room with club benefits as they personal service and free drinks between 5-7pm are a very big bonus coupled with the snacks and fruit and coffee through the day.the small ensemble of staff really make the club benefits special.", "A few upgrades needed here and there but I wouldn't fault this resort too much.sunrise mornings are gorgeous and the staff await you sitting and watch the sunrise in the beach with coffee and drinks,a great way to wake up to each morning.", "\n", "\nBali is the best place to relax. Hotels, services, magnifiquent spa, ocean, weather- everything for forgetting about nervous life. A lot places of interest, some of them just unforgettable. Nusa DUA BEACH hotel is a beautifull hotel in a quiet area of Bali. Only good memories\n", "\nBest thing was the staff, always smile and helpfull. Breakfast was very good and room was on the ground floor so in few steps and you are in beautiful garden with playful squirrels. nice people, nice country, nice hotels", " ", " ", "\n", "\nMy husband and I stayed from 30th October for 5 nights and had a fantastic time. A beautiful Balinese style hotel with great facilities, bars & restaurants. Awsome breakfast with an enormous variety of food. The staff were absolutely delightful, great service and every staff member greeted us with a lovely smile and nothing was ever too much trouble. ", "I would highly recommend this hotel for those wanting to steer clear of the hustle and bustle of Kuta, but still close to shopping and only 15 minute taxi ride to Kuta. Beautiful beach and great pool so best of both worlds. We are already planning our return next year.\n", "\nThis was our 6th trip to Bali, having been to Kuta, Sanur and Ubud previously but this was our first time to Nusa Dua.", "We had a great time with our packaged deal. The staff were excellent and enjoyed my smattering of Indonesian when ordering and greeting. The restaurant food was great but we were a little disappointed in some of the theme night dishes. The massages were wonderful and the pools and the grounds overall were beautiful. The only slight annoyance was the 21% tax on top of the already \"not cheap by Bali standards\" price of food and drinks. But overall considering the package we got it was a lovely relaxing holiday\n", "\nRecommended by a friend my daughter & I stayed in May 2014. Returned October 2014 with my husband and again treated as though we were the only guests in the complex. You can't beat the facilities and the many breakfasts choices, had a Spa, Sauna and Massage everyday. Thank you to all the Staff I miss those smiling faces and daily conversations we will return again.", "\n", "\nBali for us in the past has been about decent hotel + Pool time+ shopping + eating out. This time we hoped to be able to go to one place and find it all (excl shopping)....and Nusa Dua Beach Hotel was perfect. ", "Palace Club Suite was a great combination of Chef cooked meals & super friendly service overlooking the beautiful gardens. We ate at five different restaurants within the hotel and always found something interesting & different...so no need to go into the back streets for variety. The pools and spa were wonderful.", "We will come back!\n", "\namazing view and location very near to beach ( few steps away). The atmosphere and the decoration meet it high expectation. my first trip to bali and definitely will return to this hotel again and again. room was large enough and my room with garden view was amazing with enough sun! breakfast was excellent. staffs were so nice. thank you Nusa Dua Beach Hotel & Spa for the good hospitality!", " ", "\n", "\nStayed at Nusa Dua Beach Hotel & Spa about 13 years ago when my oldest son was around 7/8 yrs old and loved it. Came back in October with my youngest son who is 8 yrs old, and it just as I remembered and enjoyed it just as much. Extremely friendly staff, always smiling and can't to enough for you. Hotel is true Bali not some modern clinical type. The pools are beautiful, food is nice, themed buffet dinners and shows are great. Brilliant place for kids and families. Won't be disappointed\n", "\nIt was my first trip to Bali. The resort and staff were amazing. Fabulous pools, gym, spa, themed nights & the food options were great, even catered for allergies!! Plus I even saw the turtles hatch! AMAZING!!", "\n", "\nWe have just got back from Bali and had our final days in Novotel hotel. We loved our stay here and thought it was a fantastic place to end our stay in Bali. ", "A few things was we stayed in a private apartment which made it a lot cheaper for a family of 6. We were very close to the pool and main eating area which was great. ", "The Kids club was AMAZING well the people were. The actual area could do with an upgrade for example better outside activites i.e. pool table and fuse ball were missing parts, kids don't really care though. The toys inside were a bit worn, however it is all overlooked because the staff are fantastic. Especially Edac (Sorry can't spell his name). He made my boys time there so much fun. They still talk about dodge ball and the games they did. The ladies are lovely there also! They even put on a special birthday party for Jacob as he turned 6 while we were there and the hotel gave us a complimentary cake :) Just need to show your passport. They don't advertise so make sure you ask. 24hours ahead. I could go on the free bike tour was great even when you had to pay it was only $15 for 2. The pool was quiet and shady and the activities and balls they had made it not boring.", "The service by the people was so friendly. My only gripe was the price of some of the food was pricey, especially the theme nights when there is a few of us to pay for and the room service was always cold at least 2 of the dishes which I think they should be made aware of as you are still paying top $$ for it. In comparison to Aust it was cheap however we still all go to Bali to save some $$ on a cheaper holiday. ", "The street close by has a heap of great places to eat especially Tropical! Not the nappies girls working there but food is great!\n", "\n1, When we arrived bell boy not directly help , in the room he waiting for tipping is not good.", "2. Front Office Attendant to old and slow", "3. Hot water just warm , and the bath room door lock was stuck , lucky the engineering staff prompt coming", " ", "\n", "\nMy first trip to Bali with my son his wife and my grandson,I was pleasantly surprised Nusa Dua Beach Hotel and Spa was just wonderful from breakfasts daily to the many theme nights and beautiful food. Relaxing by the pool sipping on Pinacoladas was my favourite pass time and the bed was really comfortable. Asleep when I hit the pillow after relaxing all day!", " ", "\n", "\nThis would be one of the best hotels we have ever stayed in. The room was lovely, very clean. The staff were very friendly and helpful. The club lounge was amazing. Very tranquil. I would highly recommend the Nusa Dua Beach Resort. ", " ", "\n", "\nMy wife and I had a very enjoyable 7 day stay in a premier room at the start of September '14. We found the resort to be well maintained with beautiful manicured gardens, an 'oasis like' pool setting and well appointed comfortable rooms. The locale is remote from the hustle and bustle and provides for a relaxing opportunity to recharge your batteries and enjoy the moment. The ready access to the beach with the foreshore walkway made for some enjoyable morning and early evening strolls. This resort and location is ideally suited to the more mature traveller and requires a taxi trip to reach shopping strips or nightclubs. Possibly the only real negative is the quite high prices of the drinks and meals with no real options for a small cheap meal. Also, as with other Bali businesses, always factor in the 'plus (service charge) plus (tax)' on all purchases. Just a little South of the Melia resort is a side street with a small strip of local traders with everything from drinks, to cheap eats and clothing. A longer though very enjoyable walk to the entry of the resort precinct gives you access to convenience and clothing stores as well as several restaurants and bars. I'd advise to include breakfast as part of your package, the breakfast buffet is awesome with many options and cuisines.\n", "\nMy husband and I together with our very good friends are just back from 10 nights holidaying at the Nusa Dua Beach Resort.We all agreed that it is the best hotel for comfort service and ambiance. The staff from management to bar staff and catering are all so very polite and accommodating always with a friendly smile.Our only complaint about the room would be that the bathroom vanity is too small, the comfort of the bed more than compensated for this.The location is wonderful and on the best beachside location in the area and we have experienced other hotels in close proximity.All the hotels restaurants from pizza to fine dining are to be recommended and sitting on the beach in the evening at Chess restaurant with the sea breeze is perfect for all age groups.We will definatly be returning to this wonderful hotel which is perfect for all age groups.\n", "\nWe enjoyed a wonderful holiday at a magnificent resort ,we didn't venture out of the resort because it had everything we needed ,top restaurants. Large pool top bars ,good swimming beach and the management are all down to earth staff treat u like family palace club is the best set up club I've seen .when in Bali it is the only place I'll stay\n", "\nThe room,surroundings and friendly service was fantastic", "We loved our 10 day stay and would definitely return for another holiday", "The pool area was lovely and also the Theme dinners", "Massages at the spa fantastic!\n", "\nMy husband & I recently stayed here for 7days in a Palace suite this was an amazing room the amenities top Notch, and the resort it self has so much to offer there is so many choices for dining they even have stall holders come in of an evening so you can even shop without going anywhere else. The spa well what can we say apart from the fact that the massages are wonderful the pool area was quiet and tranquil especially after a massage to go and have a peaceful swim so serene. We will most defiantly come back as we loved it. Thank you for all your wonderful service.\n", "\nWe like the property because it is built in the traditional Balinese style and decorated accordingly. It has an identify. Staff very friendly in all areas of the hotel, particularly the Palace Club. Everything is beautifully maintained, including the pools and gardens. We will book again for next year.\n", "\nA good place to be for those wanting a quieter Bali experience. Not cheap and you need transport to go anywhere but good rooms, great pools and on the beach. Prices are a bit over the top for Bali but that's what you expect in this style of resort\n", "\nWe enjoyed a wonderful 10 day holiday in Nusa Dua, our first stay in this part of Bali after many, many stays on the other side of the island. We adored this resort and after our experience, wouldn't consider going anywhere else. We were invited to enjoy a soft drink in the Palace Club and will definitely book this package next time; exceptionally friendly and kind manager. Only tiny criticism is that the seafood at the theme dinners was overcooked, particularly the fish, but after all our dining, spa treatments and relaxing, that's the only thing we could say. Can't recommend this enough.............oh and the amazing breakfasts, JUST PERFECT!!!!\n", "\nWhat a relaxing stay we had at the Nusa Dua Beach Hotel and Spa! We booked with Luxury Escapes and received an amazing package including theme dinners, spa treatments, and many other perks. We have 2 small children and really appreciated the services of the Gecko Kids Club as well as the babysitting services available.", "The pools were superb and were the highlight of my childrens' holiday. The theme dinners were a lot of fun and walking along the quiet Nusa Dua coast line at night with my partner was very romantic. The 3 one-hour couples balinese massages were simply fantastic.", "I highly recommend this resort - we had a great time!\n", "\nWe had a great time at NDBH. The staff were friendly and helpful, the food excellent, pools and grounds clean and tidy. We would certainly come back.", "My only two negatives would be;", "Around the pools and wet areas are VERY slippery and we saw quite a few people go over so you have to tread very cautiously.", "The room had a damp smell to it and after having a shower a sewerage smell seemed to arise from a vent somewhere in the bathroom. The room also had issues with the wardrobe door that would close itself due to the track coming off and the balcony door you had to wrestle open.", "Minor things I know but it really didn't detract from the wonderful stay we had.\n", "\nWe did have a marvelous time again (2nd time). Management and Staff where very help full and friendly. The rooms where nice and clean. The surroundings with its beautiful gardens, pools and beach where very relaxing. ", " "]