["The main entrance with the Candi Bentar and the foyer, just wonderful!", "We found the staff always helpful, kind and looking if we need something, at least a little chat...Even the police guards were always trying to make contact in a kind way.", "Breakfast was good enough and we always had it near the small lake in the garden, very peaceful.", "The gardens are beatiful and trees with the small squirrels were always fun.", "The beach is charming, the sand were spotless which means a lot when the crystal water in the low tide is full of seaweed.", "The security is five star, lovely to walk to the village or the Bali Colletion (shopping center) during the day or the night.\n", "\nWe stay at Nusa Dua Beach Hotel & Spa for a couple of nights, late March 2010.", "Superb location, right on the portion of beach in Nusa Dua.", "Very good rooms and very good service.", "We only have two drawbacks;", "We arrived from Europe in a KLM flight at 20:00h at Ngurah Rai Airport, and we only arrive at the hotel around 10 p.m., and unfortunately all the restaurants were closed at that time in the Hotel, (we have to order room service)", "The other not so positive issue was the price of the meals inside the Hotel comparing with the prices outside.", "The rest was very positive. Good beach, very nice surroundings, very nice staff.\n", "\nWe visited Bali with an objective to enjoy the beaches and relax in an a picturesque set up. We chose the right place to stay. It is located at the edge of the ocean - far from the hustle and bustle of the city centre. ", "The hotel, albeit a bit old, looks fantastic. The rooms are spacious with gorgeous view of the sea. ", "We thought the service quality was a bit iffy I must say. Also, it gets a bit crowded on week-ends. Wont be able to comment much on food quality as we were roaming around and hardly had any meals at the hotel (except breakfast - which is decent).\n", "\nI stayed with my husband at this hotel for 7 nights in Feb. During our stay we were able to experience the ups and downs of the hotel. The service was good when it was there, but sadly inconsistent. Breakfast was touch and go with regards the service. We could be wandering in without any acknowledgement and be surrounded by tables needing to be cleared, or the complete opposite. There were not enough staff. The breakfast was average but particularly poor was the appearence of unripe tropical fruit at every serving. Small details but the details do add up! We stayed in a standard room and found especially the bathroom to be very dated with a shower head propped over a bath and a nylon shower curtain. We also found a cockroach in our room and although this was dealt with very promptly, it would have been nice to have an apology or offered a change of room. The communal areas of the hotel and the Spa are well maintained and the gardens are lovely. The overall hotel would benefit from a more attention to detail and using the 'Palace Club' as a 'standard'. If not, this hotel should be classed as a 3 star hotel.\n", "\nDuring check in and check out the experience was bad . Hospitality,courtesy,decency, soberity all missing with Mr. Aminuddin at the front desk . He calls himself the general manager and lacks any ability and sensitivity how to handle a customer................ Not worthy of a five star rating due the experience and quality of accomodation and overall experience.", "The hotel is old but the beach front is huge and welcoming.The rooms are lacking for one thing or another and finding someone who speaks acceptable english is a challenge.\n", "\nThe Nusa Dua is on the penninsula with all the other higher priced hotels. The beach is forgettable, the room was nice but not a 'luxury' room.", "The breakfsast was OK, but the food tasted like it had been prepared many hours prior to breakfast. The had the knack of having fruit that was always unripe.", "The evening dinning was uninspired, service was sparse and the food not that terrific.", "The ;pool and pool area had nothing that was above an average hotel.", "The staff were effecient but lacked the sweet disposition of most people you meet in Bali.\n", "\nThe resort is so beautiful, truly heaven! We spent a 6 day honeymoon there and took trips all over Bali. Nusa Dua is the nicest area, we walked around and we think Nusa Dua Beach is the best, most beautiful and less crowded hotel. The pools are spetacular with a in-the-pool bar, many restaurants for when you cant be bothered to go out, service is great and the beach is pristine. The spa is stunning but a little pricey compared to other places around Nusa Dua. Bali Collection centre is great, not that cheap, but only 15 min walk for food and shopping. Breakfast is just a feast of many flavours, endless, but dangerous, slow down, dont go crazy and overeat, or you will regret... take antiacids! The food and drinks at the resorts are very expensive though. But the Nusa Dua centre is just 15 min walk with lots of great places for ´normal´prices. Internet at the business centre was very expensive and slow... Close enough to the airport and a short drive to Kuta in case you're interetsted in drunk crowds and hawkers... Verdict: Nusa Dua beach hotel is a winner, best stay in Bali!\n", "\nMy husband and I just returned from our honeymoon and spent 6 nights here. The most outstanding thing about this hotel is the incredible customer service. The staff are so friendly & bent over backwards to accommodate our every need.", "The hotel complex is enormous and right on the beach. It has a number of pools including a kids pool & the main pool with a fabulous swim-up bar. There are a few great bars and restaurants where you can have cocktails, bar snacks or fine dining. The rooms are perhaps a little dated but charming. Cleanliness was good but not spotless - but by Bali standards I think it was very good. Buffet breakfast was good and with many varied options to cater for almost anyone.", "We bought a Wi-Fi card and couldn't access Wi-Fi from our room - had to go to the reception area to log on.", "Overall a great place for couples & families. Has business faciitlies but we didn't use them. Also, avoid hotel spas as they charge much more than the independent ones. We went to Sekar Jagat which is a 5 min drive - $60US for 3 hrs of pampering & return transfers to the hotel.. fabulous!", "We will definitely come back to this hotel one day - the staff made us feel very welcome.\n", "\nI was here for five days but very busy with conference so did not even have time to go to the beach or touch the sea. 5 min walk slow place to conference centre. Friendly staff. Good breakfast. Room OK. A bit outdated, but fine. Had 1 Balinese massage which was good. Bar is not lively at all when I was there. Not a place to stay if you are on holiday, nusa dua is extremely touristy.\n", "\nBooked 2 palace club rooms for the family inc 2 adult kids age 19 and 17.Lovely hotel and definately worth booking the palace club rooms.Wonderful breakfast ,afternoon tea and cocktails with hors d'oeuvres provided in a really picturesque and peaceful setting.", "Beautiful gardens and fantastic spa facilities.", "Didn't eat dinner in the hotel.Went to Kuta/ Legian/ Seminyak in a cab approx 80,000-100,000 rph one way [negotiate with hotel cars or get a cab outside the hotel] for a couple of nights where the choice is a bit more varied and there is more life and it's a pleasant way to spend the evening.", "Closer to the hotel we tried a restaurant outside the gates called Tropicana which was very reasonable.They also offer pick up and drop off for no charge although a tip is polite I would suggest.", "Would definately stay in Nusa Dua as the beach is nicer compared to Kuta area and it is much more peaceful. Depends what you are looking for I suppose.Actually my son has just added that he likes the beach at Kuta as he has stayed there with his mates.Didn't catch him complaining about NDBH though!", "Booked a couple of tours in Nusa Dua which was much less than the advertised price in the brochure and almost certainly far less than what you would pay if booked directly through the hotel.", "Did white water rafting [actually not me but husband and kids as I was otherwise occupied at the spa that day,sad I know] and also the cycling tour which i did participate in.Both very well run and good value for money.", "Back to the hotel. Very friendly and attentive staff in the palace club area.Nothing too much trouble .Great staff to in the spa /games area.Very nice rooms with great outlook.", "Can't really find fault. Oh yes,one thing, as we were leaving purchased 3 small bottles of water from the bar area which cost us an absolute arm and a leg especially as up to that point all soft drinks had been complimentary as per Palace Club.", "Fantastic time and will certainly return to this hotel.", "One general point worth mentioning.Haven't quite decided after my second trip to Bali whether the drivers are really skillful or on a suicide mission.Can't quite get my head around all that weaving in and out amongst entire families on small scooters with no crash helmets.", "Forgot to mention a trip to Jimbaren Bay to one of the numerous fish restaurants on the beach.I have seen mixed reviews, but we had a well priced meal and there are not many places were you can pick your own fish and have it served on the beach watching the sunset.it was a very nice last night in Bali.\n", "\nOur honeymoon was amazing and Nusa Dua beach hotel made that happen! We spent the second half of our honeymoon in Bali; we wanted someplace relaxing after spending the first half of the holiday in Malaysia. When arriving we walked into this impressive foyer – open foyer where we were then taken to our club suite (typical club treatment) to sign in! I have never seen anything like it! ", "I do not agree with some of the other comments about the hotel as our experience her was great! This hotel offers culture, which when walking down the beach and seeing the other hotel, they don’t – all seem to be modern, which is nice, but if your visiting another country its nice to see the culture. The staff at the hotel where great, nothing was ever too much trouble for them and they were always willing to help. Our room was on the ground floor so we had a patio that lead to the near pond, where there was plenty of wild life! ", "I have also read many comments about locals trying to sell either day trips of gifts along the beach, but the are friendly, if you don’t want anything say no and they walk away, there is no need to be rude – if you are interested in buying you can always bring down the price, which can be cheaper then the local markets. The beach by the hotels is private, therefore there are no locals allowed – apart for the sellers who all wear a uniform of blue t-shirts anyway. ", "Even though the hotel offers many restaurants we decided to venture out, plus the food was slightly over priced in the hotel area and we wanted to see the local area anyway.", "Some places to visit near by is the Bali Collection – we only discovered this a few days before we were to leave – which I was gutted about, but the is a selection of restaurants and shops. This is a nice walk from the hotel along the beach, or there is a free transfer available from most hotels. Also if you do venture out of the hotel to find restaurants, many of the offer transfers to and from your hotel, which is great!\n", "\nStayed there for 3 nights and had a wonderful time. The beach was beautiful, much better than we had expected. Water was crystal clear and if you look closely, there were countless tiny fishes all around. We had been to Bali and stayed at Sanur previously and if you like a nice beach, Nusa Dua is definitely the place. We had a free upgrade to a family room so there was lots of extra room for the 4 of us. Kids had a good time at the pool. Staff was polite, gardens beautiful, grounds quiet and well maintained though a bit old in some areas. But definitely nothing to complain about. It was also very convenient to get out to eat at the Bali Collection if you get tired of the hotel food. Hotel has hourly shuttle to the Bali Collection and the choice of restaurants and shops will keep you busy. If you dive, you can try Atlantis International Dive Centre. They were very pro. Diving is really good in Bali. Comparable to Similian Islands and Maldives.\n", "\nStayed 7 nights in a superior twin bed non smoking room. On arrival we where given a voucher for a mock cocktail which was a nice touch. Our bedroom had seen better days and is in need of a revamp. The beds are bolted to the floor and the mattress is placed on a plank of wood not very comfortable and very noisy. The bathroom sink and bath tub both where chipped and the floor tiles where cracked.The room was a good size and we had a lovely view on to the Duck pond from the balcony which had two chairs and a table. Each room has daily toiletries, safe, water and a turn down service which was around 5.30 pm a little to early for our liking! The lobby and grounds of the hotel are beautiful and the beach is cleaned daily. The hotel has 4 restaurants which we enjoyed other than the pizza one which was not good. We also had room service which was excellent. The spa was a delight and we had facials and massages which I would recommend.\n", "\nWe had been to Bali many times. This time we stayed at the NDBH for the 3rd time. It's great hotel with a friendly staff. ", "What I liked most this time was the jewelry course at the hotel. There were hundreds of gemstones and silver beads to choose from. Our very patient consultant helped to finish everything with joy. The result was outstanding. So I made my very unique balinese jewelry just by myself. It could become an addiction :-)\n", "\nI loved staying in Nusa Dua Beach Hotel; it was absolutely charming- Wonderful views, wonderful location (right by the beach), and amazing facilities for adults as well as for the children. The rooms are lovely designed and generally I would describe it as a very pretty resort, worth every penny! We felt incredibly lucky to book in last minute travel for a very attractive price! We intend to come back!!\n", "\nThis was our first trip to Bali and we stayed here based on a friends recommendation. The service was quite reasonable and the room was fine.But being in a resort specific area of Bali the prices of everything were pretty inflated. Expect to pay about 5 to ten times more for food and beverages than if you were outside of the Nusa Dua resort strip. Other than that the resort offered lots of activities and various shows every night. Awesome if your looking to just relax and don't mind paying a premium\n", "\nThis was the most exotic vacation I ever had and Nusa Dua Beach Hotel just added to the mystic. Let me first say that although I did much research on Bali in October and it's location near the equator, I was not at all prepared for the oppressing heat. This leads me to one complaint about this hotel. The air went out on multiple nights during my seven night stay. I must say the staff made every attempt to get it working, but it never was right, leaving sleeping impossible. ", "If you are looking for excellent service, this is the place. The rooms and grounds are immaculate. There's a path that you can walk along the beach from hotel to hotel which is great. ", "If you are looking for Cancun's white soft sand beach, this is not the place. The sand is very grainy, almost pebbles. Also watch out for the tide. I was not prepared for this and was a little frightened at first due to the tragic tsunami. It is very extreme I was told because of the proximity to the equator. ", "The pool was the best. I have never seen a pool this nice in a long time. Very open, clean, and the perfect temperature. ", "The breakfast was more than I expected. They had just about everything I could imagine. On occasion it was difficult finding seating, but that was not the norm. We only tried the pizza restaurant the first night and it was just ok.", "Bali collection is very near by and there's a free shuttle that makes rounds to the hotels. They have many, many shops and restaurants. Also walking distance off the hotel grounds are some great eateries. ", "This hotel and the others in this area take safety pretty seriously, so I always felt ok walking short distances for an adventure.\n", "\nMy husband and I went to Bali for our wedding anniversary. I personally chose this hotel for its Balinese design and the beach. We've been to Jimbaran and Kuta and I could say this is still the cleanest beach.", "We came in late at night at Nusa Dua and we noticed the welcome and anniversary greetings in our room, it's good. I had a high expectation though regarding the staff and their services, I was looking forward for treats like wine, flowers or something to mark our anniversary (just like in other hotels). But... anyways... They didn't even address us by our names. We also went to avail our free photo at the beach but sad to say we can't find the photographer for 2 days! That would be a great souvenir for our honeymoon. ", "The breakfast is good. Our room is clean. I love the surroundings, very artistic and detailed like the spotlight was hidden inside a toad (stone carved). The hotel in itself is very charming.", "We enjoyed our spa, we wanted the 3-hours spa package though but we have tours during the day. On our first day, we went to Ubud Village Life tour, it is simply amazing! We will definitely do it again. ", "We fell in love with the Balinese culture and I love this hotel.\n", "\nI'm just marking the area that needs improvements on the part of this magnificent resort.", "1) In the buffet section please specify whether the food is vegetarian (with/ without egg) or non vegetarian with the standard green or red marks.", "2) Add more vegetarian stuff in your menu.", "3) The breakfast buffet area needs to be manned by more attentive waiters.\n", "\nI know it's been two years since we stayed here but I needed to write to say just how much we absolutely loved our stay here!!! The grounds are so well kept up, the service is amazing!! The natives are so incredibly thankful to you for visiting. They wait on you hand and feet! ", "Upon our arrival in Denpasar, we were a little nervous because we were unsure if our driver would be there on time to get us and he was!! He drove us into Nusa Dua from the airport. ", "My husband and I were going to take our honeymoon there- and I wanted to have something special waiting there so \"Arini\" helped me: order a beautiful 'honeymoon' cake (that was delicious!!), and have a beautiful card and a bouquet that was there waiting for him with my words printed on it. ", "Food:", "They restaurants on resort are more expensive, but they are beautiful and one offers entertainment on certain nights. There is a swim-up bar that you can chat it up with other travelers...we had sooo much fun! There is a pizza restaurant by the pool, Sandro's Pizzeria, that is open during the day. Tthere is a beautiful restaurant, Raja's Balinese Cuisine, that you need to make a reservation, but you are able to eat native cuisine in an intimate setting- try the Nusa Dusa Explosion Drink- yummy! One night we had sushi at Maguro Sushi by the Sea and it was good but expensive. ", "If you'd like to eat off resort let me recommend a restaurant called Tropical. I think our total dinner cost us $13 with one beer and one soda! And it was really great! I think I had shrimp with pasta in a vodka sauce! ", "Room:", "Our room was nice and cool upon arrival and my husband loved that because it can get very humid there. We had a room on the 2nd floor and had a gorgeous view of the gardens. The resort itself has beautiful architecture and many things to see. One night we just took a walk after dinner so we could get pictures of everything there was to see. ", "Pool:", "THere are many pools to choose from. They have a 'Palace Club' section were I think you might have to reserve to use the ones in that area, but you must go by and see them!!", "Attractions:", "We took a long trip to an ancient temple, Tanah Lot. It was very interesting and beautiful! Try to go later in the day to get a picture of it at sunset! ", "Barong Dance: This was so much fun! Actors dressed up in beautiful costumes to put on a native show portraying the eternal fight between good and evil. This is located in a town called Batubulan.", "Go to Celuk to see the silversmiths create exquisite native jewelry- kind of expensive but worth it to have something so beautiful that was hand made. ", "Go to Batuan to see art. ", "Go to Mas to visit the plantations. Here you can taste coffee, see the rice patties.", "Just look at the pictures! They will explain EVERYTHING!!! ", "Have a wonderful, amazing trip!\n", "\nI am amazed to read some of the reviews on here, it is as if people are talking about another hotel!", "We stayed in a Palace club room and we were treated so well from the moment we arrived. We weren't sure what to expect from the Palace club but it had everything you could need, breakfast was fresh and plentiful, afternoon tea.... the scones were to die for and the cocktails in the evening with hors'dourves were perfect. In fact we didn't ever need an evening meal as we were always so full. You get soft drinks and tea and coffee 24 hours in the Palace club and free wireless internet.", "The gardens that we looked out on with the Duck pond was fantastic and proper serene. We went for a relaxing holiday as we had just done a tour of New Zealand and wanted a rest on our way home to England, we stayed 9 nights and wished it was much longer.", "The rest of the hotel was wonderful and I never heard a bad word said about it, we walked right along the beach past a lot of hotels and although they all looked wonderful we reckoned ours was the best.", "Would love to go back but we always try to go somewhere new and it is quite a long journey from the UK but would definitely reccomend it if you are on your way back from NZ or Australia.\n", "\nI have mixed feelings about the Nusa Dua, while the location is good, all the beach hotels in Nusa Dua have a great location, so it isn't anything special to write home about. ", "The rooms were clean and comfortable, but on the smaller side compared to the other Bali hotel I stayed at in Ubud, but the room staff was attentive to every detail. However, the Front Desk staff was not less accommodating than I had hoped, having booked a large group stay here. I had requested an upgraded room and was surprised that one of my tour guests in a standard room had a larger, ocean view room - by comparision, mine was small and overlooked the duck pond. Now, I did not mind the duck pond view, but the noise at sun-up was more alarm clock than I wanted. When I asked the front desk about a move because of the noise, and mentioned my \"upgrade' was less than the 'standard' room of my friend, I was disappointed at the attitude of the staff. They told me they would have to let me know later - I never heard from them.", "There is a wonderful selection of food in the breakfast area, the staff here and in the other dining areas were friendly and attentive. The poolside bar has the best lunches and great prices, and you can't beat eating on the beach lawn, overlooking the cool blue waters. However that said, it wasn't any better here than at any hotel along this strip of beach.", "I guess the stay was okay, but just not up to the promises made. By most standards, this is a no frills 3* beachfront hotel that has great food, but a large number of rooms away from the beach and without a view.\n", "\nOur family of four stayed for ten days at the Nusa Dua in mid January2010. When we arrived I really thought that they had taken us to the wrong resort. It is so spectacular that I thought there had been a mistake.", "From that first moment until the last moment when we left we were treated so very well.", "The staff were just wonderful.Always helpful and genuine. The location is so overwhelming with the beach and all the other resorts. Walks along the beach front in the evening and stopping for a drink .", "I asked my kids what they really loved about the resort and they said that you could stay their , never leave and never get bored. ", "The one suggestion I would have is that when you arrive find yourself a good driver and get him to take you to all the places you want. We saved a lot of money by not paying tourist rates.Remember to pay your driver well !!!", "I can't recommend this resort highly enough. The staff,the hotel and the location with that Balinese feel to it. Pure magic.", "PS; we have already stared to organise our next trip in Jan 2011and yes we are going back.!\n", "\nStayed for 5 days at this wonderful hotel during end of December. The hotel is located in the 5 star area of nusa dua and has direct access to the beach. There are a group of similar hotels on the same beach (all interconnected). Many of the other hotels are new. But the Nusa dua beach hotel has been kept well maintained and i found it to be the best in terms of landscaping, size of the hotel (big lawns etc). The architecture is very balinese unlike the other hotels and you can see bali temple like structures at lots of places in the hotel. ", "The spa is excellent though a little expensive. Food at the hotel wasnt too great and quite expensive. The staff was great though seemed a bit overloaded due to the mad rush during the christmas time we visited\n", "\ngot upgraded to a honeymoon suite.loved the view and service.Highly recommend to anyone on their honeymoon.\n", "\nWe stayed as Palace Club Guests in Late November- Early December for 10 nights and were very impressed with the standard of the hotel in general.", "Highly Recommend The Palace Club - A Wonderful breakfast buffet in such a serene location overlooking the duck pond. Afternoon tea was a treat with the option of feeding the fish and ducks always available to guests.Evening cocktails and canapes were a treat!", " Free Internet access was part of the service and we were offered an upgrade to an ocean view suite. We declined as we just loved being able to walk out of our room directly to the duck pond.", "I must comment on the Cherry Tiramisu served at the Poolside Pizzeria . It was without a doubt THE BEST Tiramisu I have had ANYWHERE in the world. I had to have one every night during my stay. It was so divine that I am still dreaming of it........", "Most of the staff we spoke with had worked at the hotel for 15-20 years and all of them told us how much they enjoyed working there. This is a sign of good management. Happy Staff = Happy Guests.", "We also loved the sandy lagoon pool and the location along the beach front allowed for a lovely walk after dinner. ", "A++++++++++++++++++++++ to this hotel.", "We can't wait to return.\n", "\nBeautiful rooms, great views and architecture, service is excellent, on the beach, would go back in a heartbeat!!\n", "\nFew Colleagues told me to visit Nusa Dua if i visit bali, and i keep asking them is it very nice?", "hm.. they just laugh, and said, ONLY when u are there, then u will know what is called \"PARADISE ON EARTH\"", "This trip i managed to visit nusa dua with my family.. When i told the taxi drive to go to nusa dua beach hotel & spa, he told me \"right choice\"", "Took around 25 minutes from airport to Nusa Dua Beach Hotel & SPA, we felt the ambiance once we enter the hotel, very comfortable and elegance hotel. When we enter the hotel, the ambiance of bali is there, \"Gapura\" with bali carving.", "Even though the hotel already 27 years old, but we can see it is very well maintenance. The lobby is very big with fish pond, and the garden around is very nice, with 2 big swimming pools, our room was upgraded to deluxe – pond view. The room furniture is made from wood, with balcony facing the big pond. Complete amenities for bathroom. ", "The hotel has its own private beach, with sun chair, facing the sea.. \"woo\" ", "Clean, well maintance beach. I love very much the beach with sun chair and swimming pool.", "The hotel also have various of water activities like diving, canoing, surfing and snorkeling", "Looking forward to recomend the hotel, to friends and families. And looking forward to come back. But when come back next time definetely will stay minimum 2 nights to enjoy the ambiance, pool and beach and will try the spa..\n", "\nTo begin with, staff of this hotel is polite but it mainly reflects on the Balinese people because they are all extremely nice and warm hearted people, and this is where the good part ends. I was on my honeymoon and therefore I informed the hotel to try and make it a little special for me by at least providing me with a room with sea view, now the irony is that only the standard rooms and palace club rooms in this hotel has sea view and Deluxe rooms have only garden view, so I had to downgrade to standard room for better views, which was not pleasant at all (coz I booked a Deluxe room earlier), the room furnishing is good 8-9 years old, also the Tv is not a LCD Tv which is a standard in every 5 Star these days, also they do not have a DVD player and but they can provide you with one for a rental of US $15 per day, which is really not required , there is no free wifi and they charge US $ 100 for one day ( A little less at the lobby area ) which is Insane, the food is overpriced but very decent, the breakfast was average , if you want to have your own liquor by the beach they will charge you additional US $ 30 per person for it as corkage charges ,also I would especially like to mention the photographer here who is stationed near the pool area , who was suppose to click one complimentary picture for every guest, regarding which we were so happy as we really wanted some pictures of us in the hotel as our camera was destroyed due to water a day before only, after clicking few pics we requested him to give us the rest of the pics in a portable drive which I was carrying so that we can take back some more memories with us , to our disbelief he charged us US $100 to transfer those few pictures which he otherwise would have deleted, to which we had to say no eventually as it was too much for a mere transfer of few pics the whole episode was so surprising and sad for us as we already told him our problem of not having a camera any more , I believe they are looking for opportunities to extract money for every service they provide you, which are standard in any 5 Star hotels you go to these days and are more or less complimentary , which means except your breakfast and stay there is a price list available for you for any and every service you ask for in this hotel. Before choosing this hotel I read all the reviews on the various website and decided to stay here which eventually turned out to be a wrong one, although one can stay here if someone is looking for an authentic Balinese style ambiance which I think is only provided by Nusa Dua Beach Resort but the hotel’s services and facilities falls a little short on your expectation when you think of it as a 5 Star Hotel, for a 4 star hotel it is a decent Hotel to stay provided the prices are in your budget (Which is around US $ 130 per day on an average) but also keep the above mentioned things into contingency and perhaps you wont find it as disappointing as I did.\n", "\nSimply Beautiful ,nice service,nice beach and a lot of activities,we will go next time for sure!!!", "Nusa Dua best place in Bali", "Michele From Italy\n", "\nStayed here for 3 nights 7th-10th Dec. (Not long enough) Booked 2x palace club rooms which where lovely and well worth the extra money. The staff in the palace club lounge were all exceptional as was the rest of the staff in the hotel, cleaners, gardeners, security etc. The grounds are beautiful and you can easily walk to local shopping, restaurants etc. The cultural dinner and dance was a great night and a reasonable price for the quality of entertainment and food. It is a good place to stay to be near watersports, jetski, parasailing etc. We travelled with teenagers who loved this place. Unfortunatley time was limited but we did a lot of walking so that we could take in the sights. Would certainly like to go back again but would stay longer to have some days just for staying in the hotel grounds. We also spent 3 nights in Seminyak. Thanks to Gin and all the girls in the palace club lounge the most polite gentle people I have had the pleasure to meet.\n", "\nOn Monday the 7th Dec my parents, sister (18years) and I (21 years) arrived at the airport and was surprised to find that going through customs was quiet quick and easy considering we had to claim items of alcohol because it was more than 1 litre per person. They really didn't mind, didn't check and we were moved on to find our driver who was arranged from the Nusa Dua Beach Hotel and Spa to pick us up and take us to the hotel. Driving through the streets of Bali was an incredible experience, seeing the houses, shops and culture of these beautiful people was extrodinary and is important for all traveling to Bali to experience as this is the \"REAL\" Bali. We arrived after a quick drive at the N.D.B.H.S and were welcomed by many very friendly and polite staff. The surroundings of the hotel were beautifully decorated and we couldn't wait to see our rooms. We were offered cocktails on arrival and met our hosts for our holiday, Gin (a wonderful and very helpful host) showed us around to the spa, in the direction of the pools and to our rooms. ", "The rooms well.... they are beautiful, nicely furbished, the bathroom is great nice and big and definately not what you would find in Australia (where we are from) unless you are royalty and can afford the world! The room for myself and my sister had two single beds which is what we had requested - they are very comfortable. The double sliding doors which control the air conditioner look out over the beautifully maintained grounds and into a world of birds, butterflies, tropical plants, frogs, ducks and squirrels. Don't worry they haven't been in our room yet but we keep the door closed as you have a choice between having the glass door open or shut and/or the wooden venitian blind door open/shut. The glass door controls the aircon when opened the aircon turns off and when closed it starts back up again. Although it is also controlled by a switch in the room. ", "The hotel has three pools, a lap pool located near the spa - has its own bar and is pretty quiet this pool stays open until 10:00pm. The other two pool situated near the beach are lovely and opened 7:00am - 8:00pm. They are surrounded by restaurants and one pool has a bar. Also alongside these pools is a children's pool which is smaller and shallower. ", "We stayed in the palace club rooms so we were entitled to breakfast, free afternoon tea 3:00-5:00pm, free cocktail (2 hours 6:00-8:00pm) and free juice and soft drink throughout the day and night (24hr/7) at the palace club which also has free internet and is where i am typing this now. ", "Trying lots of new foods during afternoon tea and cocktail happy hour is a great experience. We went to the indonesian dance show where we listened to wonderful music and watched some great dancing. There was a buffet dinner provided and the food was wonderful the best ever! and there was so much to try and lots to go around. The deserts were a great treat to. ", "Pros: Pool, location on the beach is great, grounds, friendly staff, definately worth the $$$, you have to experience it to understand.", "Cons: only thing i have to flaw which isn't due to the hotel was the cocktails. We found that they used different kinds of spirits to make the cocktails, they were different brands to what we have in Australia and the quantity of spirti was different. We found we couldn't drink them because they were too strong. We also found that out in other restaurants they were roughly $9 - $11 AUS which is pretty good as in adelaide we buy cocktails for $15 - $20 for those who can handle strong alcohol! The non alcoholic cocktails are great!! ", "We have been doing lots of walking so that we can see all parts of Bali, it is interesting to see their way of life and to apprieciate the beautiful people that live there. Taxis are a good option when your feet are sore but take the Bluebird taxis as they have meters. ", "Be careful with your money the lots of zeros gets a bit confusing and make sure you carry small notes with you as most places (in markets, small stores and shopping centres) don't always have the change, especially taxis we were caught out day 1 but now we know what to do. ", "Hope this helps for some\n", "\nYou want a perfect Honeymoon then you must vist Nusa Dua spa in Bali. It is one of the most beautiful and luxurious places to stay and not a deep hole in your wallet.", "We stayed for three days and had a beautiful time, the staff was so courteous and very warm.", "We had booked the honeymoon package and got a complimentary couple massage. This was absolutely worth every money and luxury.", "The only bad part were the flies in the evening but the hotel did take care in spraying the sorroundings with musqito repellent.", "The food was quoite good and even though a bit expensive, its worth the extra spending on the honeymon.", "The hotel also arranged a romantic dinner for two in the middle of the swimming ppol area for an extra cost.,. A must try\n", "\nI have stayed for 4 days in this hotel. Generally, I have good time. Hotel is very big and beautiful. All of Staff are kind and smile to you. But, there are some things need the hotel to do more about its hardwares. For example, TV is small, still CTR, Room's Internet didn't work well, I could not use well, it was very slow, even couldn't open web page. I chose Deluxe Room, and couldn't feel how deluxe it was. ", "Location is far from famours shopping centre, such as discovery shopping mall, Kuta market. So, if you want to shopping outside and look around Bali, it may not be good place to choose to stay. It would take around 50,000 Rp to discovery shopping centre with bargan taxi at outside gate of hotel. It is very easy to find taxi in Bali. If you want to try local resteraunts, you can enjoy the free pick up and return service from them. Just ask hotel to book for you, easy. ", "About hotel taxi, someone have recommended to use, but it is very expensive. From hotel to Bali airport, it would cost 150,000 Rp by hotel taxi, conversely, only cost 60,000 by local taxi. ", "If you want to stay hotel for relaxation, it will be good place to stay, good condition pool and beatiful beach. ", "Over all, I will come back this hotel, but I would like to try others else.\n", "\nI stayed again in Nusa Dua Beach, and it was as perfect as ever before. Compared to other hotels in the same price range, it is probably the most beautiful and generous place in Nusa Dua. The only disadvantages are still the same: cannot swim at low tide; Nusa Dua is comparably badly located if you want to see the island; breakfast buffet very firmly sticks to melons, papayas, pinapples, apples, bananas, snake fruit (hope I have not forgotten anything), and wonderful mangos, rambutan, mangostan, guavas, and other more exotic fruit need to be purchased from the beach vendors. But this is a minor sin.\n", "\nWe stayed at the Nusa Dua Beach Resort for 10days with a group of 30 family and friends, many of us also have small toddlers.", "The hotel is very,very big.", "It has a beautiful, huge pool which the hotel is centred around.", "There is also 2 toddlers pools and a swim up bar.", "The first night we stayed in a standard room for 3, nice room for a couple, not suitable for 3 though as the kids bed was next to ours.", "The next night we upgraded to a Family room, definately recommend if you have children.", "If I stayed without children I would suggest a Deluxe room as these are on the ground level,have a little front porch and go straight out to the pool.", "My family and I have travelled extensively and I would definatley say this hotel has the BEST room service we have ever had.They also have a great kids menu which our 2yr old and 11yr old loved.", "The hotel has many restaurants and they are all delicious and of a very high standard (for Bali), the food here is beautiful but very expensive, after 10days we would have spent a few thousand AUD dollars on food and drinks here.", "One thing I definately recommend, is eating at the hotels seafood buffet on Sunday nights and having the buffet at the cultural show which I think is on a wednesday night.Both were fantastic.", "The hotel is about a 40min taxi from Kuta where all the action/restaurants/shopping are found, this is fine if you can go out during the day and night but not good if you have small", "children.", "We had no choice but to be near the hotel because our toddler had to nap.", "There is a small shopping centre called Bali Collections about a 15min walk away with little restaurants and abit of shopping, I didn't eat here, it looked abit dodgy.", "There is also 5 star resorts located all along the beach front at Nusa Dua, so you could eat at any of these, however why would you bother when the prices are just as much as Nusa Dua Resort and the food here is very nice.", "The staff are very friendly and helpful.", "One thing we did do was use the babysitting service and we highly recommend using these ladies.", "We tried to use the same lady,but sometimes she was booked by other hotels in the area.", "Make sure you book in advance, no later than the morning that you need.", "All in all, we would not stay here again simply because of the location and the price of food/beverage.", "Last year we stayed in private villas in Bali and it was amazing, that's my tip! Fantastic for families.", "I recommend staying in Seminyak, it's quieter than Kuta but lots of nice places to eat and things to do.", "Stay at Nusa Dua Beach Resort if you would like a relaxing holiday away from all the hustle and bustle and do not want to do anything except lie around a beautiful pool all day (and night).\n", "\nAs for Bali itself I feel that it is terribly overrated. I wasted two days of my vacation getting there and back from Kuala Lupur. Would have been better off in Penang or Lankawi. As for the hotelNusa Dua Beach Hotel and Spa was excellent with the exception of the food service. They had selected middle eastern specialities and mangled them with their own adaptations. However, if you want a good choice of dining take the shuttle (free) which runs hourly from the main desk to Bali Collection which is a shopping mall within Nusa Dua suburb. You will find excellent rests. there although don't plan to shop - very overpriced.\n", "\nWe had an excellent stay at Nusa Dua Beach Hotel & Spa in august 2009. We choosed the hotel following recommendation on tripadvisor. Indeed is an original balinese hotel, with specific furniture and style. They started an probable finished renovation. We choose a Palace Club room and we recommend this option. Staff is very good, they want to help you in every issue; we did not have any problem during the stay. ", "-Starting with breakfast experience, in a wonderful garden ( just Palace Club rooms) , with helpful staff and good food. Even if is not a \"european\" brekfast\", you can always choose eggs with bacon or another prepared food. The fresh juices are great. ", "-The room is on the ground, with acces to excellent garden; sometimes we received fruits in the room. In some nights you may hear the plains decollating.", "-The beach is nice, you have to go earlier if you need a specific location on the beach; is nice that you can “take the sun bath\" on the grass( not to hot, like on sand). The chaiselongues are a little bit tired and used, maybe they will consider a change.", "-On the beach the food is ok, but for dinner we definitely recommend the Balinese restaurant Raja`s with excellent food and service.", "Also for dinner, many restaurant from \" Bali Collection\" place( where you can go with a free shuttle bus) are nice. We choose -one evening -a very nice restaurant on the beach of Jimbaran where we watched the sunset and enjoyed a great dinner, named \" Sea Side Cafe\" . If you want to go to any restaurant just ask to reception and they will announce the restaurant and get free transport back and forth.", "-For trip and excursion -use with confidence the hotel amenities, otherwise you risk to be fooled by opportunists drivers.", "We had great trips with a very good hotel driver- Made SuYama-and we recommend him definitely, even as a guide, very polite, clever and correct ; you can ask for him at the taxi desk or reception.", "During european summer the day is short in Bali, 6 pm is already dark, but is definitelly worthy to visit Bali and Singapore. We stayed in Singapore 4 days our way back home.", "Overall we had a great experience and we will definitely return to Nusa dua Beach and Spa.\n", "\nWe stayed here during October. The hotel is quite impressive. Its big, well decorated and nice secure location. The grounds were beautifully landscaped and the pools area was huge with plenty beds available. We enjoyed cocktails at the pool bar and walking along the beachfront. You can also stop in for a drink at the other nearby hotels. The little squirrels are also pretty cute. I was a bit disapointed witht the beach as it looked pretty rocky and there were warning signs about sea urchins so I stayed away. The rooms were ok but fairly dated. I cant understand the size of the TVs or lack of DVD player. Buffet breakfast and other meals were pretty good. Overall, I wasnt too bad but fairly expensive for bali. Next time I would like to try laguana and Westin. They looked a bit fresher. They also kept my room desposit which was more than the daily rates I paid, for over a week and I had to call up to get it back. This was a bit annoying.\n", "\nWe went to Bali for our first wedding anniversary. With pampering, romatic dinners and lounging by the pool in mind, our choice fell on the Nusa Dua area.", "Nusa Dua is a newly developed tourist area of Bali. Originally mainly farmland and mangroves, it has in the last two decades become the hotspot for many 5 star luxury resorts.", "We stayed at the Nusa Dua Beach Hotel and Spa, and as far as quality and comfort goes, the stay was immaculate. The grounds were stunning (with small squirrels visiting our balcony every morning), pools were crystal clean and the spa facilities tranquil and not too crowded. The breakfast buffet was also out of this world. For a romantic break, it was the perfect location.", "The downside however, is that Nusa Dua is made first and foremost for tourists. We first noticed in the taxi from the airport, where we had to drive through a security checkpoint at the entrance of the Nusa Dua resort area(a result of the Bali bombings.) The guards were very polite and obviously had our safety in mind, but none the less, one got the feeling that we were being isolated somewhat from the rest of the island.", "We also soon discovered that prices in Nusa Dua, whether it be spa facilities, restaurants or even drinks, were generally higher than elsewhere on the island. Furthermore, we were always encouraged to take taxis everywhere, (spas and restaurants offered free transport there and back), which meant that we didn't really get any clear impressions of what local life was like.", "The epitomy of Nusa Dua as a tourist trap was however the Bali Collection - a walled complex of restaurants and shops, equipped with its own security guards, shuttle transport back and forth from the hotel and information desks. Prices here reflected Nusa Dua in general, although we did discover that we could bargain at restaurants for free salad bars, welcome drinks or desserts. It seemed they were willing to offer a lot of freebees to have us as guests.", "After two days of tourist Bali (we'd also been lured into a very touristy beach restaurant in Jimbaran one evening), we met a taxi driver who seemed eager to give us tips on Bali's more interesting areas during our 10 day stay. For 30 USD a day, we rented him as a guide and driver for 10-12 hrs, and he introduced us to amongst other things, the Bali Café in Seminyak (a 45 min drive away), scuba diving around a shipwreck at Tulamben on the north of the island, a coffee & tobbacco plantation as well as the very charming Cafe Wayan in Ubud.", "We also climbed Mount Batur, the island's 2nd highest volcano, albeit not at sunrise, as seems to be the norm. This was actually very pleasant, as we were pretty much the only two tourists on the mountain. A tip though - get a guide. (A group of mountain guides have an office at the bottom of the mountain.) Although experienced hikers, we wouldn't have had half the fun without one.", "Based in Nusa Dua, we got the best of two worlds. We enjoyed days of basking on quiet beaches and having longdrinks served poolside, but only experienced the real Bali by travelling away from this tourist-friendly area. A good job then, that distances on the island are small.\n", "\ni stayed here from the 1st to the 11th of october and i can confidently say if ther are any reviews saying anything other than its fantastic i would be baffled ?", "we did look at some of the brand new hotels on the strip but they could have been anywhere in the world the NDBH is a lovley little piece of bali . the rooms in palace club were loveley and the palace club blimey you could get away with not spending a penny if you wanted there is so much food !!", "it got to a piont where we didnt have the afternoon tea most days as there was so much lovley food to eat !!", "the pool area is fantastic and yes there can some geman-itus in respect to the towels but its a holiday worst things happen in the world.", "the restuaraunts at the hotel are all fantastic and by western standards very good value but once you have been out of the hotels and see waht you pay blimey!!! bali can be very cheep!", "we would recomend at least 3 resturaunts", "1- bumbu bali - evryone talks about it and with good reason its brill local style food well feed with a couple of beers and cocktails for the wife for 420,000 (about £30) ask reception to get you table there they will pick you up for free, ", "2- uno in the bali collection very nice itallian , and you can get sea food or a steak ther again only about £25-30 for two nice hous wine too!!", "3 - Kendi Kunning fliiping delicious!!! come out of the hotel to the beach turn left towards Tajun Benoa and keep walking up the beach its right on the beach front we had a massive and totally delicious meal of mahi mahi fish with all the dips and bits and rice and salad with about 5 large beers coktails /wine ladies drinks and after drinks for 280,00 thats about £20 quid and this was our favourite place right on the beach and very quiet but lots of great sea food and asian food .", "if you stay at the hotel the resturaunts are all lovley chess is the one on the beachfront with the amazing buffet .", "the spa is great and i would recomned a visit as you get so well looked after compared to uk standards i have exerianced.", "all in all we will go back to bali and we will stay here even though we drank and visited a lot of the more modern hotels the NDBH is like bieng in a palace in the days of the raj .if you have chosen or are thinking about this place for your honeymoon as we did you will not be disapionted.\n", "\nHaving read the many reviews on Tripadviser regarding this hotel, I was confident that this would be a great hotel. However, some of the recently posted reviews started to give me doubts - there was no need to worry.", "Yes this is the oldest hotel on the stretch, but with that comes character that represents the island of Bali; we took the opportunity to nose at some of the other hotels as we ventured around. Don't get me wrong, they were great and new but in my opinion sterile. ", "You are greeted by a huge loby and reception area with numerous Koy Carp ponds; the greeting from the staff was warm and friendly and check in was vety swift. With in no time we were shown are room (delux) which was decorated well, clean and large; the firts thing I did was check the bed sheets for dampness - dry, crisp and changed regulary. In the room there was a large walk in shower, bath and seperate WC and a walk in wardrobe. As it was a 1st floor corner suite the balcony was massive and over looked the well maintained and beautiful gardens.", "There are amany restuarants in the hotel which we used early on in our holiday until we got our bearing and wondered down to the Bali Collection ( aka Bali Centre - 15 minute walk along the beach path) where there are many restuarants about half the price of the hotel; although I didn't think the hotel was that expensive compared top others we have stayed in. If you venture in to the village outside of the gates, it's cheaper again.", "The pool gets busy very early, with loungers that must have been reserved in the middle of the night. We had to depart at 6.30 am for an excursion and many loungers had towells on at this time!! Any way our prefernce is for the beach, where the smiley and attentive staff are happy to bring you drink and food while you have a good chat with the beach sellers. Don't worry about these, they ask each day but a polite \"no\", they smile say good-by and move on. You will notice the difference when you leave the resort.", "This is just our opinion, but compared to other hotels in the Far East and Indian Ocean it compares very favourably with those in the same price bracket. If it's good enough for U2 & Ronald Reagan (allegedly) it's good enough for most of us.\n", "\nThe staff and people in general are all very open and friendly. The hotel has a large lobby area which leads through to the centre which is all pools and restaurants and surrounded by the rooms either side. It’s all very pleasant and relaxed. The pools are good but the beach is better with towels provided.", "There is also a good selection of bars and restaurants all of which are expensive compared to what’s outside the gates, just ask the hotel for a taxi and ask for the south gate where there are some good restaurants, we like Mai Mai (I think that’s the name) Returning to the hotel though. The food is a good quality with no problems. Do go to the Balinese restaurant by the pool, it was amazing in every way. The lobby bar is what it is but does serve a mean cocktail. The pizza place is also worth a visit. The downside. Both the chess bar and restaurant serve good food and drink but service is slow and not just for us. The chess restaurant is where they serve their buffet dinner option outside and is very nice, included is a bottle of local wine (not bad) and unlimited water if you can get their attention. I ordered a beer which was not included and for some reason this posed a problem even though I knew this was extra and was happy to pay. They were very good at clearing tables and friendly enough but the minute you want something you’ve had it especially the bill or more water. The food was very good though. Don’t let this put you of the hotel though as it does have a lot to offer.", "One of the best bits for us was the spa. As we were on honeymoon they do a romance package with a bottle of bubbly which my wife finally talked me into as I thought it a bit girly, glad she did. There’s private villas for this and you are both together in very fetching paper undies (bottoms only ladies), you can wear your own but they will get covered in all sorts of oils and scrubs. Thankfully it turned out to be a couple of women in the spa as the alternative would make me feel uncomfortable. In short we were massaged, body scrubbed and massaged some more, there’s a Clarins? face treatment too which again sounds girly but they massage this stuff in repeatedly which is pure heaven. Then afterwards it’s back down the stairs of your villa where there’s a huge bath, bubbly and flower petals. Also a steam room, plunge pool, day bed and complete privacy. This is also where the two staff make their exit and say they’ll return in 45 minutes and show you how to lock the one and only door. If that’s not a green light then nothing is. The public spa areas include a very nice lap pool which is quiet and in the separate changing rooms are a plunge pool, Sauna, Steam Room, Jacuzzi and showers along with more towels than a laundry. Really recommend the spa.", "You can also wander along to all the other hotels and we used their bars and restaurants and they are much better for the evening. Also, walk to the beach turn right keep going, go round the security fence onto the beach and rejoin the path, there are local stalls here but not a problem, you’ll see a car park through the trees after a while and this leads to the Bali collection, which is good for eating and has a supermarket for water.\n", "\nHidden gem, best ever hotel with incredeble luxeury\n", "\nI stayed at the Nusa Dua Beach Hotel with my Boyfirend whilst holidaying in Bali. This was fantastic hotel and the staff could not have been more helpful. The only problem we had is that we were originally located a room in the hotel which appeared to have not been occupied for while - as a result of this the linen was dirty and the room lacked the luxury feel you got from the rest of the hotel. After discussing this with the manager we were upgraded as an apology for free - this was well worth it as we were moved to a better located room and had no compliants.", "Bali itself is fantastic I would recommend going out and seeing the island and a local restaurant called CASA BELLA is fantastic - ask the reception to call them and they pick you up and take you back to the hotel for free!!\n", "\nStaff were friendly and courteous. Grounds and pools were excellent and well maintained. Room was clean an comfortable. Turn down service of beds, and when this was down a quick clean and tidy of Bathroom with replacement towels etc. ", "Breakfast selection was excellent. Would definitely recommend this Resort to all who were looking to stay in the Nusa Dua area. Security was also excellent.", "Highly Recommended.\n", "\nwe stayed at this hotel for 10 days and the service we recieved was second to none the manager even sits at a desk in reception with his name in front of him. the room service was never to much trouble and anything from a bulb to be changed or not able to open our safe was dealt with in 10 mins the towels are changed up to 3 times a day with bedding every day ,a turn down service at night with a lady asking if she could run my bath for me . all this and fresh ice and water without asking .the amenities they provide are soaps shampoo conditioner shower gel bath salts comb emery board cotton buds sewing kit toothbrush and paste shaving cream and razor tissues iron and ironing board the beach is close the pool boys watch when you hold up a green fla they come to your sunbed and bring food or drinks to you.the location is good for most areas to see the only thing i would say is that the food and drinks are a bit over priced but hey you are in a 5 star hotel .my e.mail is susan_colin22@hotmail.com for any further questions just go you wont be dissapointed.\n", "\nThis was our first trip to Bali and spent 3 days at Nusa Dua and 3 days at Seminyak. The first stop was Nusa Dua. ", "Nusa Dua is definitely the \"other side\" of Bali. definitely the place for those who likes beach, and some peace and quiet. the beach was BEAUTIFUL... quiet, breezy, private and has a long stretch of spa massages for you to choose and drinks (at night). ", "That was until we went to Kuta beach... the more authentic side of Bali. In a way, we were really glad that we spent our entire days at the beach while at Nusa Dua. Kuta is the more fun, happening, noise, shopping, party...etc.", "Nusa Dua Beach is a hotel that fit for all.. family, honeymoon.etc.... they have many swimming pools, was particularly amazed by the sandy pool. But nothing beats the beach. ", "The only catch is that the rooms are slightly old, and Nusa Dua is far away from the tourist area. You need to rely on the taxis to go to the town, which cost you 80,000 rupiah return (although found out later that we could have negotiated for less..alot less!)\n", "\nWe stayed at the Nusa Dua Beach Hotel & Spa for 6 nights for summer vacation during August. Although it was a rather old hotel, its grounds were wonderful! The entrance gate to the hotel was very impressing. It was very clean, the staff extremely polite and the breakfast was simply amazing! Drawbacks are that all five restaurants of the hotel closed their kitchen around 10.30 pm which was quite early at least for us, that it was expensive for Bali standards and the beach right in front of the hotel was not the best one you could find. Overall, the experience from staying at the hotel was very positive and would definitely recommend it.\n", "\nThe rooms are decorated in a traditional balinese style which is great if you want more culture. But as the hotel is older, the rooms felt more worn and the air conditioning barely seemed to function. I spent several sleepless nights b/c the room was just too hot even though the air conditioner was on full blast. The toiletries seemed old and dirty. The overall feeling of our room was that it wasn't too clean. Finding available lounge chair was a bit of a crapshoot. ", "We walked over to the Westin Resort and regretted not staying there instead as the lobby and pool area seemed much cleaner and more comfortable. There were plenty of empty lounge chairs and the pool employees would bring free snacks for guests.\n", "\nIn Nusa Dua for sure you can find hotels with more modern setup, but after ", "visiting most of them I would say that they lack the charme of the Nusa Dua Beach.", "Of course you see that it is over 20 years old but the wonderful garden landscape ", "and the buildings in balinese style cannot be matched by the other hotels.", "The service was wonderfully friendly and calm. The breakfast buffet in the ", "Palace Lounge was excellent, witht one of the best marinated salmons I ever tasted. ", "Even the pork sausages and hams, for sure not an asian staple, were of best quality.", "A little complain: The \"congee\" rice soup was good on the frirst day, but then it ", "became stickier every day, as they did not add new soup.", "We had Palace rooms, and were upgraded to a suite, without asking. ", "The biggest problem of our stay was the dampness of the room which I feel is due ", "to the airconditioning. Instead of drying up the atmosphere for some reasons ", "the airconditioning brought wet air into the room. But from other reviews I see that this is a general problem. And finally I'm wondering that they still use roomkeys instead the ", "usual cards. Very uncomfortable and even dangerous if you loose it somewhere.", "Restaurants: Maguro Asia Bistrot was excellent with Sashimi of superb quality.", "We had Romantic dinner on the beach, with superb service, although the balinese cooking is not worth the price they ask. ( This apllies also to the balinese wines).", "Not bad the Chess restaurant, especiallz zhe buffet for dinner. The location is verz", "appaeling. We tried also some restaurants of the other hotels nearbz, but there was nothing of impressing. The best choice was the Kendi Kuning Beach Restaurant immediately after the Club Mediterranee. A fabolous Red Snapper and superb tiger prawns, verz simplz grilled on wooden fire. Tables on the beach, lanterns around. The owner drove us back to the Hotel free of charge. A place to remember !\n", "\nMyself and my partner just came back from 12 nights at the Nusa Dua Beach Hotel. ", "We decided on the hotel after reading the reviews on here and finding a good deal online. The hotel overall was really lovely, we live in Dubai where the majority of the hotels are pretty much brand new and 5*, the Nusa Dua Beach Hotel is neither of these but the staff, grounds, location and amenities definitely more than make up for it.", "The only complaint I have is that as mentioned in many other reviews our room was extremely damp. It was not just the smell of damp that was the problem, the bed sheets were awfully damp and very cold and wet - not very pleasant at all!. We complained the staff the following morning and were shown another room which was the same, I explained to the hotel staff the problem again and we were then shown another room which was fine. The hotel staff were very accommodating and helpful and changed our rooms very quickly.", "Other than this initial problem which was quickly forgotten we really enjoyed our stay at the hotel, it has a special charm about it that most of the newer hotels in the area really lack. The grounds are stunning and the service is first class and we felt at home instantly.", "We used the hotel facilities only really during the day and traveled to Kuta or Seminyak most evenings. There is also the Bali Collection shopping centre in Nusa Dua which is great to visit for lunch and a bit of shopping, the hotel operates a free shuttle bus there every hour, or you can walk which will take about 15 mins. ", "Despite the initial damp problem I would definitely recommend this hotel to anyone wanting to stay in the Nusa Dua area at a reasonably priced hotel - we had a fantastic holiday and will stay at the Nusa Dua Beach Hotel again when we return next year.\n", "\nIf you have to stay in Nusa Dua and you've got a meeting at the BICC, this is perfectly acceptable and is minutes away. Staying in a tourist complex, a gated part of Bali, is weird. Taxis are expensive to get out of the area, there is no walking, just a big shopping mall or two. I'd stay in Ubud or Seminyak if I was on vacation! But for the conference, it was fine. ", "The breakfast buffet was superb. Best pork sausages in the region. The complex is huge and luxurious, so if you really want a tourist resort holiday, there's lots of swimming pools, and a beach area. And the fitness centre looked pretty good.", "It didn't seem as luxurious as some of the neighbouring hotels (with their big day and night beds out available to lounge on in the evenings). Worst though: the room was tiny, old, no hooks in the bathroom to hang things up, in fact the sink was right off from the bedroom, not as a separate full bathroom. The balcony (and view) was nice enough but the room itself was disappointing.\n", "\nWe married in Nusa Dua Beach Hotel in June. Although we had bad expirience when we arrived - our room wasn't cleaned properly, had very bad smell of dumpness and we were asking for different room. ", "The cleanliness of the room what we got was fine, but it had worst location than the other (the other was on the ground floor with sea wiev and straight acces to the pool, this one was on the first floor facing to the garden.) So the folowing day we were asking to move again. All what I wanted just a clean room with the same location as we had at first. Thanks for Reni (our wedding coordinator) finaly we got what we wanted. She was briiliant on any other way during our stay (6 nights) in the hotel and she organised a unforgettable wedding for us.", "Except the first bad experience with the rooms the Nusa Dua Beach Hotel was just over our expectation. The hotel is a bit dated but built in traditional balinese style and that makes it special if you compare to the other luxory hotels around this area. ", "They have huge choice at the bufet breakfast, so many different kind of restaurants (bit expensive, but all right for a 5 star hotel), very kind hotel staff - they are always there if you need something, and from all of everything the spa was the best. We got a 2h 30min treatment including the honeymoon package (which is worth the price) and actually we had our own spacious spa villa, with jacuzzi, steam room and sauna where we could get relaxed and nobody was disturbing.", "There was two large pool, never crowded and big enough for swimming, great pool bar and plenty of sunbeds. ", "The beach is nice and clean (cleared by hotel staff every morning), there was some seaweed, but what do you expect, that is the Indian Ocean!", "So alltogether we had great time in Nusa Dua Beach Hotel and we recomend it for everyone who want to experience the traditional balinese hospitalyti over this luxory and relaxing location!\n", "\nThis hotel really lived up to our expectations. Its older than some of the other Nusa Dua properties but don't let that put you off. It still offers a really high standard of service, well equipped rooms and a fabulous beachfront location. We had a superior room facing the garden, which was a good size and decorated in a traditional balinese style.", "The hotel facilities were excellent, we used the gym which was well equipped and very well air conditioned! The whole spa area is a peaceful haven away from the rest of the hotel and I reccomend the loungers around the lap pool for a lovely quiet spot to read a book. Lots of eating options within the hotel, although I must confess we ate out on all but one of our 11 nights as it was considerably cheaper and we wanted to explore.", "The staff were superb, nothing is too much trouble. For example when I told them that i needed to leave very early in the morning to head to the airport they were concerned that I would miss my breakfast and insisted on making up a breakfast box for us to take with us.", "A great hotel, offering the ideal combination of location, service and facilities.\n", "\nStayed here with the whole family for a whole week. We booked standard rooms. My review is as follows:", "Rooms: Very large, comfortable and spacious. Wide King Bed, comfortable mattress, great terrace/balcony. ", "Pools: Excellent. Two large pools, plenty of lounge chairs, no issue with towels.", "Service: Truly excellent, friendly, corteous and unobstrusive. A gem.", "Breakfast: Plentiful with a great variety to suit all tastes. Quite multicultural too. Highly recommended.", "Facilities: Outstanding. A fully fledged games area at the Spa which is superb for adults and teenagers. Table tennis by the pool, futsal goals and a a couple of pitches. Great to run around.", "Restaurants: Excellent in general and not overpriced. A whole buffet would cost about $30 which is hardly expensive by international standards. Of course, we can eat outside the Nusa Dua area for less but for an international hotel it is not overpriced.", "Gardens: Immaculate and beautiful to see.", "I highly recommend this property to families and honeymooners alike. Truly good and also very good value for money. We paid around USD$130 per night which is not expensive at all by international standards for a resort of this quality.", "I would counsel potential guests to disregard the snobbery evidenced by other reviewers. This is a great place to stay.\n", "\nWhile this may have been a 4+ star in a former life it is now at best 3. We chose to stay here over many others based on the excellent reviews on this website, unfortunately it seems our expectations are higher than some other reviewers. ", "The resort is over 20 years old & has not been renovated in that time and it shows. If you arrive at night it looks very impressive & it is only by day that you can see just how shabby it is. We stayed in a Palace Club room on the honeymoon in paradise package which included many extras such as dinner in the very below average Raja's restaurant. The room itself is dated with electrical problems ( lights turning themselves on & off at will ) dirty showers ( probably due to the age rather than cleaning staff ) mouldy couch & complimentary bed bugs. After 2 days complaining about waking up each morning covered in bites they did change the mattress & pillows which stopped the problem. Although I did have to show my bites in places mosquitoes couldn't possibly have bitten me in order to have them believe me, 2 weeks later the bites are still all over me.", "The pools look quite nice but you cannot get a lounge after 10am, mostly due to guests putting a towel & newspaper on them in the morning & not returning until the afternoon if at all. Once in the pool, if you manage to dodge the balls being thrown around, you will notice a thick carpet of algae covering both the island & swim up bar walls.", "The restaurants & bars are quite expensive & not very good quality, with the exception of the Japanese restaurant, which served good sushi. After 3 meals in the hotel we started looking elsewhere. The Grand Hyatt has a great Indonesian buffet, the restaurant & bar on the beach at the Westin ( next door ) were much better quality than our hotel & I highly recommend asking the concierge to make you a booking for dinner at Bumbu Bali, a great restaurant in Tanjung Benoa.", "We walked & rode up & down the beach several times & inspected a couple of other resorts along the strip. I would probably consider the Westin or the Laguna if we returned to Nusa Dua.\n", "\nRecently returned from a 10-day stay at this beautiful hotel. We were in a group of 15 (extended family vacation). Overall our experience was very good; however, the management needs to greatly improve their beach safety facilities - there are NONE. Some of our group got caught in a strong current one day while swimming close to shore, within the safety buoys as marked, taking no risks. It was just bad luck and can happen to swimmers anywhere. Hotel staff on shore could not help AT ALL. They could not even attempt to throw us a ring to grab onto, since there were none. There was a lot of yelling from the shore, but no help! We had to allow ourselves to be washed up against the rocky breakwater and then climb out. All of us had injuries and had to be treated by the nurse/doctor on site (for which they charged us). ", "I am amazed that such a big resort has nothing in place for beach rescue. Other travelers who witnessed this horrid incident were astonished as well.", "We filed an \"incident report\" with management and never heard back from anyone. Disappointing!\n", "\nThe Nusa Dua Beach Hotel & Spa was very nice overall, and a very good value compared to some of the wildly expensive (yet not that much nicer) hotels in Nusa Dua / Jimbaran Bay. The grounds of the hotel were beautiful. The room was nice -- nothing special -- but clean and perfectly adequate. Pool was very nice -- two pools, one of them quite big, with a swim-up bar. Food at the hotel was a mixed bag -- breakfasts were large, lots of variety, and quite good overall; the one dinner we ate at the hotel, at the sushi restaurant, was mediocre and expensive -- there are much more interesting (and less pricey) restaurants outside the hotel in any event. The location of the hotel is good -- inside the somewhat sterile, but certainly quite safe compound of Nusa Dua, about a 15 min. walk / 5 min. taxi ride away from a shopping complex with a few additional restaurant options. Finally, the spa at the hotel is excellent -- massages were amazing.", "Overall, I'd definitely recommend this hotel as a good full-service, resort-style hotel -- not quite as nice as the Grand Hyatts and Oberois of the world, but a reasonable approximation for far less coin. Just make sure that, if you come to Bali, you don't spend all your time just in Nusa Dua -- spend more of your time in Ubud!\n", "\nWe had a very long flight to Bali with 24 hours of travelling but on arrival, the beautiful hotel and resort and the staff soon erased the memory.We stayed in a palace club room which is well worth the extra cost, with a spacious room and excellent service enjoyed at the palace club lounge where the staff could not have been more pleasant or attentive.The hotel and it's grounds are beautiful and maintainence was second to none.A previous reviewer stated that the beach was dirty, but what they didn't say was that the Indian Ocean is quite rough and there is rubbish that is washed up on the coastline in the morning, (like everywhere else) but the hotel have beach cleaners who clear up every last bit of this.The quality of the food is excellent at whichever restaurant you dine at and I would recommend that you try Rajas which specialises in Balinese cuisine.\n", "\nMy family and I ( with 2 kids , aged 11 & 12 ) have just returned from a 6-day stay in early June at this wonderful hotel. I scanned through a large number of hotel reviews in Nusa Dua Beach area before deciding on this property and had absolutely no regrets about my choice . ", "We booked a superior room for three and much to our delight , were given a sea-facing room which offered a panoramic view of the vast expanse of the sea from our huge L-shaped balcony . The room was much bigger than our expectations and was clean and well-maintained .The wooden,carved furnishings and decorations exuded a traditional Balinese style .", "The staff were polite and eager to help. We were however , very tickled when we asked the staff who checked us in for an additional set of ' towel' and were promptly given a potted plant with a solitary and brightly -coloured 'flower' instead . I must say the staff really went all way out to satisfy the needs of their guests . It was such an amusing and hilarious incident . ", "I must say that besides , Westin and Laguna, which also occupied the same stretch of beach , NDBH offered the best beachfront with spotless white sand and most importantly ,a large number of clean beach loungers . We spent a lot of time lazing on the loungers and were constantly entertained by the antics of the mischievous squirrels playing in the trees nearby.", "The 2 swimming pools were clean and fabulous. One of the pool even had water deep enough for diving . The lagoon pool offered a good alternative to swimmers who looked for a bit of sea-water feel and also proved to be highly popular with families with very young children as the kids could wade in easily and scooped up the sand with their buckets. ", "The poolside staff also offered very good service They were ever-present and unobtrusive and appeared magically when you need to order drinks or food. We had a few sumptuous lunches at the two restaurants near the pool. Prices were standard , 5 -star hotel rates, however, the food was immensely appetizing", "My family ,especially enjoyed the food at Maguro , the Japanese-Asian Restaurant. We ate there twice and truly savoured the sweet, fresh seafood and tender ,silky and exquisite sashimi . At other times , we also took a shuttle bus to Bali Collection for our shopping needs and dinner as well . Prices of meals there were cheaper and there were also more varieties of food to choose from but we still preferred the quality of food at the hotel restaurants.", "We did not find the beach touts too annoying as they were not very pesky and would disappear quietly once you politely decline to purchase things from them .They were well -trained and could read body languages well. ", "The activity centre and gym also boasted well-maintained equipment and games. My two pre-teens enjoyed themselves ", "with the almost brand-new table soccer set ,dart games,table-tennis table etc and even regretted that they had not discovered the place earlier.", "We had a fun time at this resort and would recommend this place to anybody looking forward to a relaxing and idyllic holiday\n", "\nMe and my husband stayed at this hotel for a week during our honeymoon in may 2009. ", "When we arrived at the hotel we immediately felt very welcome and valued as guests. The room was big, clean and the interior was of a high standard. Definitely feels like a 5 star hotel. ", "Swimminpool area is gorgeous, you can choose from two swimming pools. One is the classical one, with comfortable sunbeds around it, and it has a poolbar in the swimmingpool. The other is a \"fake beach\" which must be perfect for people travelling with children. The grounds were beautiful and tidy. Everything is just of such a high standard!", "The hotel is right next to a beautiful beach. The restaurant right next to the beach is really good and a pleasant alternative if u want to stay on the hotel grounds. DONT go for the Balinese dance show and dinner at the hotel, the food was really bad and doesn´t represent Balinese food in a proper way. When staying at the hotel you should visit the restaurant Bumbu Bali, they pick u up at the hotel, then drive u back. Best dinner experience during our stay at Nusa Dua.", "I would definitely recommend this hotel, since it was our honeymoon it was important that the rooms were of a high standard, which means that the bed has to be comfortable, the room has to be clean, the bathroom should be new and have a tub and shower. All our expectations were met and beyond. ", "The service at the hotel is impeccable, u really feel welcome and the staff make you feel like an important guest. If u want to be guaranteed a luxurious and comfortable stay - book this hotel. We loved it!!!\n", "\nWe stayed at the resort for seven nights in a Palace Club room from 8th to the 15th June. It was well worth the extra money, it included breakfast at the Palace Club lounge, afternoon tea and sandwiches, cake and scones, and then for two hours in the evening cocktails and canapes. The club rooms are are on the ground floor and you have your own patio with proper padded sunloungers. They all overlook the magnificent gardens, which are beautifully manicured and taken care of.", "The beach is really nice although we are not beach people, beware of the beach sellers, they are around all day. We prefer the pool/garden areas. The pools were good, never crowded, the pool with the lagoon style which has a small area which is sanded underneath looks like it is need of some refurbishment, the main pool was lovely.", "The hotel is next to The Westin, The Laguna and The Melia Bali, you can walk, jog or cycle along the path to all these hotels and eat in their restaurants as well as our hotel. There was lots of choice for restaurants and the food was good. We did not eat many meals as we seem to have had enough to eat after the cocktails and canapes. You can also eat at the shopping complex called the Bali Collection. A lot of the restaurants there will arrange a free taxi ride back to the hotel for you, and you can barter with taxi drivers outside the hotel security.", "You can walk along the beach to the Bali Collection during the daytime, its take about 15-20 minutes or you can walk along the main roads, which is quite safe as Nusa Dua is in a sort of gated community with security at the entrance. Just outside the main entrance to the resort there are lots of shops, a lot cheaper than Bali Collection, you can barter there till your hearts content. I had a Balinese massage at one of the parlours there, it was $15 US for one hour, amazing, and a lot cheaper than the hotel.", "The staff at the Palace Club Lounge were really helpful and friendly, especially Gin and Suni, thank you.", "We fly with Singapore Airlines, they are just simply the best and we do a lot of travelling. We flew on the new A380 double decker airbus, that too was amazing.", "To conclude we had a fantastic holiday and would certainly go back again, but not too soon as being a Travel Consultant I like to check out other destinations as well, so that I can advise my customers. So if anyone wants assistance in the future contact me by my Trip Advisor name.\n", "\nReturned from this resort two days ago, use tripadvisor a lot so decided to write a very honest review about this hotel. ", "Stayed in Palace Club Suite. Had to change room on the very first day to another suite due to large black ants crawling over the walls, floors and ceiling. ", "Room: Extremely aged and dark from the floor to the ceiling. Infested with ants and lizards. Dusty under furniture. Damp quilt. Scary faces looking down at you whilst you sleep (artwork - some may like this, our two year old daughter didn't)", "Pools: Again, extremely aged. Main pool and spa pool OK. Baby and children's pools were old and not maintained.", "Beach: Pleasant, slightly dirty - but there were men cleaning the beach frequently. Annoying numbered men and women attempting to sell some junk for exorbitant prices (you have to haggle apparentely, but if you want to go shopping...go to the shops). Old loungers, but enough for guests. Some selfish people tended to leave their towels on loungers in the shade for hours without returning - our advice...just move them.", "Food: Very good quality. All the restaurants served varied food.", "Palace Club: Great perks. Afternoon tea, 24 hour drinks, cocktails and nibbles. Lovely garden with pond, complete with ducks, squirrels and goldfish which our daughter loved immensely. Breakfast is served as you like it, just order whatever you want. (Breakfast is served seperately to the rest of the hotel). Comfortable lounge with books and DVD's that you can borrow.", "Customer Service: Besides the one lady who asked us why we didn't bring our cow along (we needed fresh cartoned milk every night for our daughter), the service was lovely and always with a smile.", "Pest Control: Ask for 'Sony', yes Sony - the man with the can (of bug spray) and you'll need him by the way. He'll pop round with a smile and use his mobile phone light to check in all the nooks and crannies for those little bugs then spray them into oblivion. Thanks Sony, for a few laughs too...", "Spa: Nice pool and games room. Definitely a better part of the resort for those without children.", "Other guests: Mainly couples in their 50's and 60's or families with young children. Not for teenagers or young couples.", "It was nice to be there, we had a good time but won't go back to this resort unless it's given a complete makeover...just too dated.", "PS. Darren the executive chef runs a great kitchen. Food was the best part of the stay", "PPS. Budi the assistant manager at the Palace Club is a helpful and friendly man if you run into any problems\n", "\nwe stayed at this hotel for a week at the beginning of June 2009 with my husband for our 5 year wedding anniversary. i did lots of research and finally chose this hotel and it was the best decision. we arrived around 1pm after a transfer of about 20 mins from the airport. we were greeted with cold towels and a drink. we had to wait about 1/2 hr for our room to be ready so we had a quick look around and were stunned! the hotel was beautiful. we had booked a standard room which was lovely and more than adequate, however as it was a special occasion we enquired about an upgrade and after looking at a few rooms, we upgraded to a palace room for $20 a night. there was a slight mix up and we should have got a deluxe room but as it had been booked, they upgraded us again to the palace room. it was well worth the price as the room was very big, with a draped bed, separate bath, power shower and toilet. it was amazing. the patio overlooked the beautiful gardens and we had our own sun loungers. it was a 2 mins walk to the pools and the lobby. we did not have access to the palace lounge as we paid suck a low rate for the upgrade which i was disappointed about but soon got over it! the room was very clean with a turn down service every night. it was the finishing touches which made it really special i.e. rose petals in the bath ,complimentary water etc. the actual hotel was just amazing but what really made our stay so special was the staff. the guest relations manager deisy was lovely and so accomodating. many of the staff remember your name and were just simply lovely. our rate included breakfast whcih was very good and there was a big selection. the food was very clean and well prepared. we had breakfast every day overlooking a pond and gardens. we also ate at Raja's which was one of our fave meals and we ate at the chess bar. depsite being veggies there was lots of choice and staff also offered to tailor the food to suit our needs. the food and drinks were expensive but i guess that's the price you pay for staying in a 5* hotel. (we had dinner one night in the Laguna Hotel were the prices were sky high! we paid £20 for 2 glasses of jacobs creek wine!) we didnt use the spa as it was expensive but it looked lovely. we did use the lap pool by the spa as it was really quiet there and relaxing. the other pools were great and we made full use of the swin up bar ordered lots of oreo milkshakes! my hubby used the gym and was impressed with the selection of the machines. we took the free shuttle from the hotel to the nearby bali collection mall twice which is nice to have a look around the shops and have dinner - it is a little cheaper than the hotel. however the best and cheapest place for shopping is KUTA. there's more of a selection of souvenirs etc. we also went outside the main gates and dinner there one night but we didnt really enjoy it as the food was a bit crap! we then tended to eat at the hotel as we loved the food and service was impeccible. we booked a taxi from the counter for a day trip and a trip to a temple it was probably more expensive but thought we would rather pay a bit more and go thorugh the hotel. the cars and guides provided were fanastic. it was quiet at night and we tended to sit at the bar enjoying the sea breeze, slipping drinks and listening to live band.", "i could go on and on about this hotel as we had a such a memorable time. if you are looking for something that bit more special then go to this hotel. it is not as modern as the luguna etc but there is something more balinese about this hotel. we would recommend this hotel to everyone and def going back there in the future.\n", "\nNormally I dont do anything like this but on this occasion I believed that I should write something about the Nusa Dua Beach Hotel & Spa.", "This property is the best all-round place that I have ever stayed at, and as an ex travel agent, I've stayed in a lot of properties, all over the world.", "Specifically we wanted a tropical beachfront resort to warm our bones in the Aussie winter and we got all of that and a lot more than we really expected.", "The Nusa Dua section of the island of Bali is almost like a \"gated community\" in itself. The roads in and out are controlled by heavy security, as are the individual properties, so you immediately feel very safe and secure.", "The stretch of beach where the resort is located accommodates 5-6 other 4-5 star nice resorts, but they are all south of it, and they dont benefit as much from the sea breeze as it does, which is very important on a hot & humid Bali afternoon with a beer or cocktail in hand. There are the locals on the beach (they are not allowed to enter the resort property) every day, all day, to barter with for imitation Rolex watches and Bolle sunnies, baik linen & clothing and so on, which is a fun experience.", "There are also hawkers on the beach to sell you fishing or snokeling trips on their boats that are moored out front, or to sell you jet-ski rides.", "We casually \"inspected\" each of the other properties during our stay, in case we found a better one than ours, but ours was by far the overall best, for many reasons.", "The pools are fantastic, the variety of restaurants (5) is great, the staff are happy and attentive, the rooms are spotless, the all-inclusive buffet breakfast is superb, and there are no flies, mosquitoes, bugs, ants or other nasties to spoil the days. The other facilities such as the gym, lap pool, kayak & winsurfer hire, internet room, games room, ATM, bank, resort shop, room service, swim-up pool bar, bike hire, taxi counter, consierge, duty managers and so on make the resort a wonderful place to stay, so much so that we will be returning in 2010.", "The cost of everything, except alcohol, is cheap by any standards, and for variety of food you can travel to the nearby \"Bali Collection\" (1.5km away) , a Mall-type design of stores, supermarkets, clothing and merchandise stalls, and many restaurants, all of which will provide you with free taxi transport to and from the resort (provided you eat at their restaurant of course).", "Note that the beach out the front of the resort is not a surfing beach as such, but the water is clear and the sand is yellow and clean. It is naturally tidal and at its best at high tide, but low tide is ok also.", "I suggest that you will benefit from using \"google earth\" to look at the location also.\n", "\nThis was our first trip to Indonesia (let alone Bali) and we were traveling with a 2-yr old, so we thought it better to splurge a little and pay for a nicer place where we wouldn't have to worry about anything. We booked at the Nusa Dua Beach Hotel after reading the reviews and were very happy we did. The hotel itself is absolutely beautiful. The room was large, tasteful, and generally very clean (the bedsheets did have a very small stain when we first arrived - I am VERY particular about such things - but this was changed after I pointed it out and all our linens after that were clean). The hotel grounds were well-maintained and the staff friendly. The breakfast buffet was nothing wonderful, but it was fine. The food at the Pizzeria, on the other hand, was quite good, and we had an excellent Balinese dinner at Raja's restaurant (both within the hotel). There is no internet in the rooms, but it is available at the business centre for a fee. Walking along the beach in the evening we noticed that some of the neighbouring hotels were livelier in terms of night life, but we actually preferred the Nusa Dua for being quiet. I am also pleased to report that we came away with zero mosquito bites - a small thing, perhaps, but we have stayed at other resorts where we ended up scratching our arms and legs for a week after we got home. We really knew that we had made the right choice, however, after my wife had a bad fall while we were exploring elsewhere on the island. At the time, we were afraid she might have broken her ankle. Upon our return, the hotel nurse saw my wife immediately and then called for a doctor, who arrived within the hour. The hotel provided us with a wheelchair free of charge not only for the immediate crisis but for the rest of our holiday. The beauty of the hotel and this sort of extra assistance really helped us to salvage what might otherwise have been a disaster. Overall, we were very pleased with the Nusa Dua and highly recommend it.\n", "\nAfter going through many different catalogues and destinations we finally chose Bali for our honeymoon getaway and we weren't disappointed. We liked Nusa Dua Beach hotel and Nikko Bali hotel the most out of all the offered hotels in travel agency catalogues.", "We arrived at the hotel at 3am. They gave us a room that was nice and had a good view but was on the farthest side from the beach. In the morning we asked if it would be possible to get one a bit closer to the pool and beach and that evening we were moved to a room that was right at the waterside - the staff was very cooperative and willing. Our room (superior) was decently furnished and equiped - very comfortable. Room service daily. The hotel itself is beautiful - it is authentically decorated in Balinese style and the atmosphere was wonderfuly exotic. The gardens are beautiful and well-kept (you have to see them for yourself to fully appreciate how lush and colorful they are). The staff is very friendly and unobtrusive. The pools were great - warm and well kept. The sandy beach is lovely with a view of one of Bali's volcanoes in the distance on one side and with the beach streching out to the right leading to one of the two peninsulas (a romantic evening walk). The hotel offers beach clean beach towels and sunbeds for free to all hotel guests. The only thing we didnt like about the beach was that during most of the afternoon there was low tide. The hotel has many different restaurants and bars but they are all quite expensive (it is after all a 5 star hotel). We usually left the hotel, stopped a taxi and went out for food (restaurants out of hotels are very cheap and good). Also the spa was very expensive. Overall I would definitely recommend this hotel if you are looking for a romantic exotic getaway and dont mind spend a little extra money for the comfort.", "Our pictures are on MESIalbum.\n", "\nWhen we first saw the resort, the front lobby was very impressive. We checked in at the Palace Club (same as the Club at the Conrad). ", "The room was not as plush or impressive as the Conrad. Some people have complained that the rooms were old and needed refurbishing. I would agree in one sense, but it depends upon what you are looking for. The rooms are beautifully deck out with extensive wood features. From the beautiful wood doors to a gorgeous wood sliding wooden screen type door in the bathroom, this hotel has warmth and charm. ", " The longer I stayed here the more I loved the décor. The bathroom was smaller than the Conrad with older features, but it was perfect for what we were looking for. The shower was large and the bathtub had both a fixed faucet and the hand held type which became very important in the second half of the trip. ", "Where the Conrad had all sorts of water features, the NDBH has gorgeous grounds with beautiful landscaping and wonderful Bali features. The area where the Palace Club was had a park like setting with a large pond with its own flock of ducks. Breakfast, high tea, and the evening cocktail hours were all held here. ", "The Nusa Dua beach area is the focal point of the resort. It has great landscaping with multiple restaurants, bars, pools, etc. all in this area. Again lots of Bali statues and architecture shows that you are in Bali. An advantage the NDBH has over the Conrad is the lack of noisy water sports off it's beach. ", "Service was outstanding at both the Conrad and the NDBH. I believe the culture in Bali tends to lead to outstanding service at many places in Bali.", "Overall, I would highly recommend the Nusa Dua Beach Hotel. We have stayed at three Hotels in Nusa Dua and I would rate this one the best.\n", "\nWe stayed for three nights with our 12 year old in the last week of May 2009. The moment we entered, the resort made an immediate impression. The landscape- gardens and flora are simply fantastic. The style is trulu Balinese, with sculptures everywhere you go. The resort is large, with great pools. What I liked the most about pools was the depth up to 2.25 meters. Most hotels and resorts restrict the depth to 1.5-1.6 m. The beach was just about OK. The sea has weeds floating at the shore though the hotel staff keep cleaning the beach. The restaurants look beautiful, but we preferred to eat in nearby restaurants. There are a 2-3 restaurants about ten minutes walk away (take a left from the resort and then first right). Even a better alternative to this is to take a free shuttle, leaving the resort every hour, to \"Bali Collections\". This place has a great choice of restaurants, some of them with live music. You can also shop here for souvenirs and also buy drinks etc. from the Supermarket. The restaurants provide free transport back to your hotel, which is very useful if you miss the last shuttle leaving Bali Collections at 10.00 PM.", "The Breakfast is served in perfect settings. The choices are not too great, but it is fairly OK.", "They have free squash and tennis courts, pool table, PS3 etc. Table Tennis near the pools was also interesting and much more used than the table in the sports area.", "Overall, it was a wonderful stay. Except for the beach, which was about average, everything was just excellent.\n", "\nWent to Bali to attend a wedding at the nearby Conrad Hotel also on Nusa Dua Island. Also stayed at the Bali Water villa 4+5 in Ungasan which is the most amazing place I've stayed in so far, yes out did the Evason Phuket!! see my other reviews :)", "Likes", "Love the setting of the hotel, the lush gardens + sandy beaches + several pools", "The check out lounge providing air-con waiting area, showers + lockers for those that want to make the most of their day after checking out of rooms before leaving.", "Excellent selection at breakfast!", "Good wheel-chair disabled facilities t/o hotel", "Dislikes", "Book sea-view room, the triple room was much bigger than our twin room!", "Saw that near by roofing / wall was in maintenance", "Rooms were in need of a revamp, old floor boards + bath rooms.", "Taxi everywhere you go outside of resort\n", "\nWe married at Nusa Dua in April. Everything about this hotel was perfect from the moment we arrived. The hotel and grounds are beautiful, the staff exceptionally helpful and polite, the rooms are gorgeous and the food was lush. Maguro restaurant is particularly good.", "Our wedding went without and a hitch and the location was stunning, we used the wedding bale on the beach front, which was surprisingly private. The decor was amazing, yellow frangipanis arranged in every which way, even on the floor up to the bale. ", "Reni and Dwi did an amazing job, nothing was too much trouble for them. Considering all of the changes we needed to make to the menus (due to 2 in our party being fussy eaters) and my indecision on just about everything, they were amazingly efficient and everything went like clock work.", "Would completely recommend this hotel for a wedding, great value, beautiful location and exceptional service...! Oh and I would definitely come back for a holiday too.\n", "\nAs a traveler that is in a hotel about 150 nights a year - this is a wonderful place..the rooms were just OK. The internet ...you have to buy a card from the lobby store to get online first (you cannot log on from your room without it)..Ok, those the less than good things,..the rest? AWESOME! Wonderful cultural vibe on this property. Wonderful ppol and beach orientation - vs. any of the other hotels in Nusa Dua strip where the beach access is cramped and the pool not so expansive. The staff (more senior staff) are wonderful- the lower level staff, a bit difficult to converese with but they exhibit the typical wonderful balinese friendliness. Stay here and relax with great food and feeling of spreading out.\n", "\nThe Hotel is simply GREAT, we all oved it even our 18 months baby. the entrance is so resorty look & resorty feeling. the check in was very fast & the rooms has good view & size. service is great & staff are very responsive to all our request ( requested to change room to a lower level & it was done instantly)", "if you are looking for a quiet area this is the right hotel 4 you. you will need a car there cuz you are a bit away from the crowded area. ", "Over all, GREAT HOTEL.\n", "\nWe came to this hotel as part of our honeymoon in July07 and we were in no way disappointed it was like staying in a little slice of paradise between the gardens, the pool area and the private beach it was out of this world.", "The rooms had a real tropical feel and were extremely comfortable the bathroom wall folded away beside the bath to allow you to have a bath in the bedroom!!!\n", "\nWe stayed at the Nusa dua beach resort for 9 nights at the end of April in the Palace Club rooms. I cannot praise the staff highly enough. Every day we were greeted by name and welcomed into the Palace Club. As many others have stated beautiful surroundings for breakfast,afternoon high tea and evening cocktails. You can have as much as you want of tea/coffee/cold drinks all day.The free internet although slow was still good and we were able to check in online for our return flights with Singapore Airlines and print off the boarding passes.(saved queuing at the airport you just went straight to the online check in desk) .Would definately return to this hotel if we went back to Bali.\n", "\nHad gone there for a 5 day holiday and Bali seemed more beautiful thanks to this amazing hotel.. it has the most amazing proximity to the beach and a lovely lake in they compound where there were ducks all day long and the kids loved it. We stayed at they club room on the ground floor with an amazing room that opened into the lawns.. they had lovely breakfast and were very helpful with the kids and they wants of chocolate milkshakes, waffles etc... They rooms are lovely... and they property is just superb!\n", "\nThis was our second stay at NDB for 2 nights in a Palace Suite. We needed to be close to the airport so decided to move from Ubud and have a couple of night in Nusa Dua - whilst there are more modern and flashy properties the service and style of this hotel are a winning combo , couple with good value rates especially for the Palace Club - a worthwhile upgrade for the money I beleive. Next time I would probably try out one of the other hotels along the strip if staying for longer but several years later the service is still very good and me enjoyed our short stay.\n", "\nThis hotel is a beautiful oasis located on the Nusa Dua beachfront. It has what the other nearby hotels don't, a traditional Bali feel, evident through the hotel's lovely stone architecture, beautiful rooms with carved doors and furnishings, fragrant, colourful gardens and very friendly staff.", "I have to add that we found all staff genuinely welcoming, professional, attentive and very helpful. We will definately be going back due mostly to their wonderful treatment of all their guests.", "We stayed in a palace room, which came with extras but as far as the room goes is probably not that much bigger than a deluxe room, so next time will most likely book a deluxe. We were never in it except to sleep and change for dinner etc. We just enjoyed lazing by the pools and the beach then sipping cocktails at the beach bar! We also ventured outside the main gates to eat a few times into Nusa Dua Village. Definately try Tropical, an easy 10 minute stroll, or they will pick you up/drop you off (complimentary).", "The hotel also has an excellent gym (which my partner used before breakfast a few times) and spa centre, with separate mens and ladies saunas and spa pools, as well as a large outdoor lap pool. We were tempted to laze by this pool many times because it is so peaceful, but just never got there.... we couldn't tear ourselves away from the beachfront!", "This hotel is older than some of the nearby ones, but it has the charm the other's don't .", "We stayed a week this year , but next year plan to stay 2-3.", "I can't recommend this hotel highly enough.\n", "\nMy husband and I stayed at this hotel in one of the palace club suites because of a friend's recommendation and we loved it! What an amazing deal because you get a spectacular breakfast, afternoon tea and evening cocktails in the palace club. The setting there is so elegant and refined. The staff remember your name and ask everyday when you come in how your stay is going. At first I was surprised how many questions they asked but then found it is polite in Balinese culture to ask a lot of questions. My husband and I still talk about the breakfasts there, they were sooo delicious and probably the best breakfast I have ever had at a hotel. The spa was beautiful and so the treatments so cheap. I got a couples massage with my husband and then the Luhlur later in the week. The ladies were amazing and so nice! The beach was beautiful and the Nusa Dua complex was also beautifully maintained. We also really enjoyed the traditional Balinese dances in the outdoor theatre. What an amazing culture and what amazing and kind people. The main pool was sometimes loud with children and splashing but the spa pool was always quiet and relaxing for an afternoon read. I would go back in an instant. Loved this hotel especially because of the wonderful staff.\n", "\nWe Like:", "- The hotel Location is wonderful", "- The Hotel architecture is outstanding", "- The satff are very kind and helpful", "- We arrange a one day tour via one of the hotel taxi drivers ( expert driver + brand new car) for about 50$, it was perfect specially ubud and rice fileds.", "- The Nusa Dua area is staylish and safe, Bali collection center and sogo shoping mall are very closed to the hotel with lots of good resturants ( balinees, western, seafood,...) and shops. ", "- Very beautiful cultural event ( dance and dinner) has been arranged in the hotel, a bit expencive ( about 100$ for two adults and one child) but all in all very good, pre-reservation is needed.", " - Visit Jimbaran ( it is close to the hotel) at sunset time for great seafood and wonderful ocean landscape.", "We do not Like:", "- Kuta is a busy place with load of cheap hotels and as I think it is not a completelly safe area, we prefer Nuas Dua area ( but for younger people may be kuta has some attractions like nightclubs, bars,...)", "- We found a lizard in the room, for a troptical area is not strange but the good point is that they immediately changed our room for this reason as we requseted.\n", "\nWe spent 6 days and 5 nights from April 1 to April 6 at this hotel. We came through AsiaLuxe Holidays and had a wonderful time. Our trip included a day long sight seeing tour of Bali including a show, visit to temples and lunch overlooking the volcanoes. Other than that we chose to celebrate my birthday and my husbands retirement right at the hotel and spa. The hotel is built to capture the feeling of Bali and certainly lives up to that. The staff is amazing - friendly, helpful and always very respectful. The grounds are amazing.", "Our room, which was one of the standard ones, was on the third floor (lobby is on the second) and had a balcony with chairs and table overlooking the on-site temple, and a pond with ducks that arrived in a line each morning. It was comfortable although not as large as the one we had the first time and had room to sit and talk as well as a refrigerator. (We'd had an upgrade to a deluxe room the first time.) Breakfast each day was included.", "The food was wonderful, with the breakfast buffet starting each day with so many choices we wanted to eat all day, the Chess bar furnishing drinks and snacks and wonderful service, and the different restaurants giving us a choice of evening dining. We tried almost everything.", "My birthday was wonderful from morning till night and I was honored to receive a beautiful flower arrangement part way through the morning, an afternoon treat of fruit and then after a wonderful Balinese dinner at the Raja Restaurant, I was presented with a beautiful folding fan as a present. I've never been so spoiled!", "The beach is beautiful and so are the swimming pools. You can walk the beach and end up at a local temple overlooking the sea. Local people set up shops along the bay if you walk far enough. It is a wonderful taste of paradise.\n", "\nFrom reviews on TripAdvisor, I was confused about cleanliness in hotels in Bali. I asked a colleague in Jakarta to recommend a hotel and he suggested Nusa Dua Beach Hotel & Spa and we loved the place. We spent 2 days just at the hotel and other days out sightseeing. The staff was friendly and helpful. The entire hotel had lovely wood carvings, even in the room. The breakfast buffet was enormous. They had live Balinese music in the lobby. The beach is awesome - clean and not at all crowded. We were there for 5 days and would have loved to stay a few more days.\n", "\nHaving found this hotel during an online search and going on reviews from this very travel site, I gained a positive impression and went ahead and booked my wedding and stay at this hotel.", "The grounds were beautiful, our room amazing (we were kindly upgraded!!!) and the staff were excellent. In short, we were not disappointed. I'd like to espcially thank and mention my wedding co-ordinator Reni Aviantari for taking such good care of us and making sure our wedding was perfect!", "We not only had our wedding ceremony there but also booked a cocktail hour and reception for our small party.", "The food was absolutely delicious and they coordinated food service with our wedding program perfectly. They also set up some personal wedding props, a speaker system, a mike and a dance stage which allowed for speeches, the waltzes and some booty shaking. Everyone had an amazing time!", "I would highly recommend having your wedding at this hotel...it really made for the perfect wedding :)\n", "\nThis is truly a world class hotel with amazing service. The rooms were beautiful and very tastfully done!! The Service by the staff here is beyond excellent!!! The location and facilities are lovely! The beach front is superb!!! I would recommend anyone to stay at this hotel!!\n", "\nI stayed at the resort with my husband and two young kids (4 and 3 years old) and had a wonderful time at the resort. On arrival at the resort, you would be greeted by the magnificent Bali architecture at the entrance and through out the hotel premise. We were staying at the family room on the 3rd floor at the corner, overlooking the swimming pool. The resort ground is huge and provides ample space for everyone. Great amenities: Free child minding service for our kids below 5), a lounge for resting with shower rooms and television (after you have checked out or checked in) and 2 kids pools + 2 adult pools. We booked a day tour at the hotel taxi counter but we later found out that the guide who spoke to us over the phone was not the guide who was bringing us around but another assigned driver, so it was not worth the higher rate we paid for.\n", "\nI split my stay in bali to 2 hotels; this being the latter, and as it turns out, entirely better in comparison. We had an early scuba trip on the check-in day, and there was no problem dropping our luggage with them as we transited from the first hotel. On arrival you will notice the beautiful landscaping and Balinese architecture, beyond the security checkpoints of Nusa Dua and the hotel.", "The deluxe room is cosy but a tad dated; the shower area is small but you can use the bathtub, bed is comfortable, tv's very small, air conditioning is great (it sinks to low mode whenever you exit the room). Room service is satisfactory, no trolleys but they leave you with the trays. Breakfast is pretty nice, with a wide selection that should go well with most people. While we were there, the hotel had high occupancy and so the breakfast queue was long but still the staff did a commendable job keeping things going and guests happy.", "The gardens, pools and private beach of this hotel are remarkable, with friendly resident squirrels as a nice addition, if you're cool with animals. There's pool side dining, beach side dining but we took a stroll and had a fabulous meal at Westin (and befriended a terrific dude) next door. The lagoon is fine to swim but I doubt snorkeling will be fruitful. Probably because of the large number of guests (families & big groups), we observed a couple of conflicts but nothing major, and the holiday atmosphere remains. The staff are mostly friendly, helpful and efficient, so the service level is great.", "My Bali experience fell short of what I hoped, but I give this resort much credit for its overall positive contribution. In fact, its probably one of the best thing this trip, thus for what is worth, I am glad I stayed in Nusa Dua Beach Hotel & Spa.\n", "\nwe stayed at this hotel for our honeymoon. cannot really fault it. 10 minutes to kuta by taxi where all the bars and restaurants are. do not get a taxi from the hotel as you will be charged over the odds. instead get a taxi from just outside the hotel and you will get it for a third of the price. nice food and better poolside bar.\n", "\nMy husband and I stayed here for 9 nights on our honeymoon. It was fantastic. The staff could not have been nicer or more accomodating. We were upgraded for free at check in and it just got better from there. Some comments on how the rooms are old and need updating were unfounded. Granted it is an older hotel, but that is why we loved it. The beautiful Balinese style and tranquility was so relaxing!", "The beach chairs do get claimed early, but we found that the spa pool is open to all guests and was never crowded! It's also shaded and does not allow children.", "The Balinese Restaurant at the hotel was superb. This is definitely the place to stay if you want the true Bali style atmosphere. The breakfast buffett was enormous and we enjoyed trying all the new and different foods each day. I don't think there is anywhere in the world more peaceful, yet energizing that having a cup of Bali coffee in the outdoor breakfast lounge.", "We walked along the beach path and ventured into some of the other hotels. They were nice, but not really \"Bali\".", "I would highly recommend Nusa Dua Beach Hotel to anyone looking for a relaxing, sumptuous stay!\n", "\nWe spent 7 nights at this resort and from the moment of arrival we were in love with the place. We chose it because of the quiet location and the facilties, we were not disappointed. It retains the Bali feel with the architecture and is immaculatively presented. The food offered at the restaurants is varied and great quality. Breakfast is the usual buffet and while it doesn't vary greatly, there are ample choices.", "We stayed in a ground floor superior room looking out towards the pool area. It is very well maintained and quiet. The rooms are very adequate for the price, cleaned daily with a bed turn down and fresh towels and water each evening. There are always friendly and helpful staff nearby. The pools are great, we spent the first 2 days near the larger pool and moved over to the grass area for the remainder as it was very hot early afternoon and on the grass area there is more shade. We ventured into the ocean a couple of times, but the drop away is rapid, so we felt safer and more relaxed in the pools. ", "Nusa Dua beach resort and others within this area are within easy access to Kuta, but if you want relaxation and quiet, we fully recommend. The front security checks are comforting, if you want to bargain without the high pressure, there are market places within 10 minutes walking and the restaurants, much cheaper than the resorts, but great quality also. Bali Collection Shopping Centre is also 10 minutes walk, with department store shopping and market stalls in a mall. Again, the security checks at the entrance are a comfort. We went to Jimbaran Bay for dinner one evening, very pricey for what you get, but very smokey and could not see our food as too dark on the beach tables. We are happy with the outing but won't do it again, there are better places within Nusa Dua and cheaper.", "If you want 5 star accomodation away from it all, with full relaxation stay in Nusa Dua. To stretch the budget, eat at the market or Bali Collection, pick up some drinks and food from either Hardy's Supermarket or at Bali Collection where you can also arrange tours, have massages and do some shopping. If you have kids, it is perfect, they are safe, in clean surrounds and will find things to do. We will be back!\n", "\nOn arrival we were thrilled with our accom selection. Having never stayed in Nusa Dua before we used trip advisor to make our selection; and were speechless (in a good way!) when we arrived. ", "My husband and I were travelling with our 2 young children (1yo and 3yo). We were taken to a 3rd floor family room, which had an incredible view over the pool; and glimpes of the gorgeous beach. With young children we were still using a pram, which was not a problem at all as we had a lift just metres from our door. There's lifts at various locations thru the hotel. ", "Loved: The lagoon pool, incredible breakfasts, impreccable service and the most friendly staff with a 'nothing's a problem' attitude - always! Great food, great room, great location - and gorgeous beach. We really had the most wonderful holiday and this hotel was definitely a contributing factor", "The hotel is located within a 5-10 minute walk to the Nusa Dua markets and Bali Collection Shopping Centre if you want to stretch your legs and do some shopping / eating, etc ", "Thank you again - and we will be back!! It really was perfect for us\n", "\nI was at this hotel in September 2008 for my honeymoon and it was a perfect getaway. I chose this hotel after a lot of research and would say that this was the best hotel one can ever experience. ", "Our room on the ground floor was beautiful,clean and very nicely done. It had a private balcony overlooking a beautiful manicured lawn. Early morning we would have our tea with some other guests like squirrels , sparrows and a few other birds. Ha Ha ..The room had nicely stocked Mini Bar,Electronic safe in working condition, TV, Phone line for International calls(though we had problems calling using our credit card.It doesnt always connect you),very nice balinese style Paintings/carvings in the room.The bathrooms too were clean and dry. The best part is that the room was just perfect for a romantic honeymoon and something me and my wife can never forget all our life. ", "The breakfast is served at Wedang Jahe restaurant which is surrounded by lotus pond. Its a very well maintained pond and restaurant and the breakfast is as usual good and tasty. We also had our dinner one day at Raja's Table restaurant which serves Balinese cuisine. Let me tell you that its the best Balinese restaurant in Bali ..serves very good food,nicely presented and good ambience. Its located just next to the pool and provides very good view of the hotel overall. But the service is little too slow.", "The lobby of the hotel is beautiful and you can just sit and relax near any pond in and around the main hotel building. The Bussiness centre of hotel provides all the facilities. There are many shops inside the hotel where you may buy balinese Souveniers and other useful stuff. The beach front has good arrangement in case you want to just sit and relax. The beach is not clean though and you cant actually go in the sea. ", "Surprisingly, every staff member here has a smile on their face which is very unlikely of the hotels in other parts of the world. ", "The location of the hotel is far off from all the major happenings of Bali. It takes a lot of time to travel from Nusa Dua to any other place in Bali. ", "But is perfect for Honeymooners and those looking to just sit and relax. Perfect for almost everyone. ", "Indulge in true balinese luxury and pure extravagance here. Go for it.\n", "\nMy husband and I stayed here with our two children aged 10 and 13 years for 1 night with a late check out (6pm) so we had one and a half days that we spent mostly at the hotel except to walk outside the Nusa Dua main gate to eat and shop.", "We have been to Bali a lot the over years and had driven down to Nusa Dua a few times but never stayed there as we considered it to far removed from the 'real Bali'. ", "I still think it is removed but not so much as we thought, we loved our short time here and would definitely spend 2 or 3 nights here at the end of a Bali holiday to just relax.", "The Nusa Dua Beach Hotel was perfect for us, I had requested a room near the pool with the travel agent and when we checked in I asked if we had been given one. The guy at the desk gave me a thumbs up and told me we had been given the best room, and I agree we could not of had a better room. ", "Room number 3129 is two adjoining rooms on the third floor over looking the pool and the ocean, beautiful view, huge rooms, spotlessly clean, bright and airy, straight down to the pool, and as you are on the corner near the royal residents there is no common wall on that side and the balcony wraps around towards the ocean.", "We usually stay in small boutique hotels so the buffet breakfast was a novelty for us, it was huge and delicious, also the setting for the restaurant is lovely surrounded by a water garden full of fish, the kids fed the fish from our table.", "We ate at the hotel pizza restaurant one night and it was really nice, along the beach front they have a fruit stand set up where you tell the guy what size plate you want and pick out different types of fruit then sit back by the pool and he brings it around to you. I can't remember the price but it was not expensive, the plate was much bigger than we expected and the fruit was delicious.", "The kids loved the lagoon swimming pool with the sand edges , you walk into the pool as you would the beach and the sand goes for about 10 feet then it very gradually gets deeper just like the beach. We walked along the beach path up towards the point and looked at all the other hotel grounds and swimming pools. I had thought from reading previous reviews that some of these hotels had much better pools but we thought the Nusa Dua Beach Hotels swimming pools and grounds were much nicer. Some of the other hotels looked more expensive and perfect but they were also much more crammed together, the grounds of the Nusa Dua Beach are larger with more grass and trees than cement and buildings, also lots of squirrels which the kids loved feeding.", "If you walk around the point there is a lovely beach with no buildings and a bit of surf, we didn't check it out properly but it looked great and hardly anyone there.", "As expected the hotel is expensive to eat at but it's only 10 mins to walk out the Nusa Dua main gate and there are markets that we found as cheap as the rest of Bali (bargain hard) we bought new style tops for rp 30,000/40,000 and sparkly shoes for 25,000.", "We ate here at the Nusa Dua Beach Cafe in the resort nasi goreng was rp 92,000 out side at the cafe it was rp 36,000.", "I would highly recommend this hotel, it's probally not the most perfect hotel in Nusa Dua , I'm sure there are bigger and newer, but I think it would be hard to beat as far as staff friendliness and ambiance go. It is in a great position for walking around and looking out side the complex of hotels, the gardens are lush and although some things are a bit worn everything is spotlessly clean and well maintained.\n", "\nIf you are willing to live a truly Balinese style - do not hesitate going to Nusa Dua Beach Hotel and Spa. Of all the hotels that lie on the same laguna strip adjacent to Nusa Dua Beach Hotel, - Westin, Melia Bali, Laguna - this is the one retaining pure traditions of Bali, best beach (the biggest of all the hotels and the only one with most sun, unlike the closest hotels) and huge territory. In 2 weeks we didnt manage to learn all the amenities in this wonderful hotel with exceptionally friendly and helpfull staff, gorgeous green gardens and pools, lots of architecture (unlike most others in Nusa Dua area). Neglect the reviews stating poor conditions of the hotel - like the hotel is outdated, old, etc. - the hotel was really restored over 10 years ago, but there's hardly anything outdated as much as to give it a negative opinion. The staff - from beach cleaners to hotel managers is smiling and welcoming you 24-7, whatever you need or ask for is done for you fast and with most sincere smile (special thanks and hello to manager Madi for prompt help and great attitude). Tips in hotel are not accepted, with very few exceptions. Compared to the hotel website the hotel itself is dozens times more impressive than it looks on pictures and video. Abundance of vegetation, squirrels, water, flowers, places for snacks and meals (though quite expensive compared to other hotels and especially restaurants in Bali Collection center). Good facilities at fitness center, great tennis court for very reasonable money - and the one which is dry even right after the rain. ", "Breakfast: plenty of food, the only disadvantage is the menu which is 90% the same day after day. But this seems to be true with all hotels in Nusa Dua. Also not many vegetables for breakfast. But bakery is fantastic!))) Also would like to mention two more disadvantages - that is the ocean and the Russians. The former - you can feel very well the low and high tides, the low tide means - you can't swim. It is not firbidden, but there's simply no water to swim in. This happens either in the first or the second half of the day. The second minus - this is a hotel, even the resort consisting of 90% of Russians - which sometimes gets very tiring. ", "If you are looking for a hotel with plenty of activities - then you might want to try sth different, since Nusa Dua Beach - like the entire Bali island - is a place to relax, not to make extra movements, not to watch time and to be extremely active - of all the activities on the activity list in the pool area none was taking place. Especially those used to hotels in Turkey and alike will feel the difference in activities. So what we did - was entertain ourselves and also tried to find team to do activities with - thanks to lots of Australians in the hotel it becomes fun, coz mostly people are not bothering themselves with activities other than sunbathing or eating. ", "If you come here on a rainy season (December, January) be ready to experience lots of rain, but it will not bother you - especially in Nusa Dua Beach - since there's too much to admire, you breath is taken away by the beauty of the hotel and the island - and you simply do not notice there's extra water coming from above. ", "Another great thing is the anti-mosquito activity taking place around 5 pm, which leads to having 0 mosquitos throughout your stay in the hotel (heard some of friends' experience in other hotels, where mosquito attacks were a routine). ", "Many thanks to the hotel management and everyone doing his or her best out of the hotel staff to welcome the visitors and make the stay and Nusa Dua Beach a fantastic experience! It is truly worth visiting and staying at if you are not way too picky.\n", "\nI and my husband stayed in the hotel for 5 nights starting Dec 18. The hotel is beautifully located with a lovely beach and nice lawns. We stayed in the Palace Club room on the ground floor . On seeing our room, we first requested a room near the pools but the one available did not have a very great view so we settled for our earlier room and I think that was a good decision. You should try to take a ground floor room as the doors open to the lawns and the duck pond. You can gaze far and have a lot of place to walk around while you sip on ur drinks. The Palce club offers a great breakfast overlooking the ponds and a great variety of drinks and cocktails during the cocktail hours. I believe that its ideal to take the palace club rooms for the privileges they offer. ", "The hotel also has a beautiful spa with Jaccuzzi , Steam Sauna and a spa pool which we really loved... just that u can't have beer there. We loved lounging by the beach and the pools while having loads of drinks. I highly recommend the Hotel for those looking for calm, relaxation and a refreshing holiday. You can take long walks along the beach which extends into neighbouring properties where you can go for dinner too. We quite liked the restauarant on the beach at a neighbouring property, I guess laguna resorts. All in all an awesome holiday. And yes, the best part of the holiday beyond the property is the staff. They are excellent and willing to help and they are a wonderful lot. Kudos to them for a great service and making our stay so memorable\n", "\nAfter a lot of careful research I picked this hotel as the location for our wedding because it was one of the few places I could find where we could get married and see the sea, which was my dream. From the moment I contacted the hotel and booked our wedding and honeymoon ( all done via email) the staff could not have been more helpful , friendly, prompt and professional. Reni and Dwi on the wedding team answered every question I had and believe me I had alot.", "We arrived at the start of Sept and alot of our family and friends were also flying in from around the world and staying at the same resort as us so it was really important to us that we were made to feel special and we were.", "As it was our wedding we pushed the boat out and booked a palace club suite which had all the benefits of being a palace club member which were worth the extra cost. I am sure our room was 2133 ( next to the Royal Residence...more of that later) and we had a fantastic view of the sea and the hotel. The other rooms which the rest of our party booked were lovely as well and no one had any complaints.", "We booked the Royal wedding package and all I can say it was amazing in every way from the 3.5 hour spa treatment in our our spa villa, to the night in the Royal Residence ( where we carried on our wedding reception till 3.30am )which really did make us all feel like we were a Royal family. (It had at least 20 rooms and its own private pool.)", "Weddings are meant to be special and the best day of your life but all I can say is that if anyone is thinking of getting married here do not hesitate. The hotel, staff and venue was all 5 star and believe me I have really high standards", "I could not have asked for more and I hope the photos I am including give you a flavor of the wonderful wedding day and honeymoon we enjoyed at this hotel.\n", "\nThe staff was gr8...As we had booked as a honeymoon couple, they made the room so beautifully that it was awesome... They decorated the bed, the bathroom etc.... It was lovely.. The management was very polite....gr8 beach...swimming pool etc....Kudos to the management of the hotel.....", "and it is a must hotel for honeymooners....\n", "\nI've just joined this site and had to review this hotel, it was August 05 when we stayed there but everything was outstanding, I truly hope it has stayed that way. The hotel itself is beautiful and has some facinating features, it appears almost like a sacred ground in places, the ancient stone features are amazing and the hotel has a grand feeling to it. We have travelled alot and I think this has to be one of the best hotels we have and will ever stay in hence me really wanting to review it.", "Our room was very nice and was wooden and marble throughout and we had the most beautiful view of the garden from our room, pink and lilac flowers everywhere, the hotel is very well kept.", "It has some fantastic restaurants on site and during our stay we had a fantastic 7 course meal in the private area at the centre of the pool - I can't remember what it is called in Indonesian now but it was amazing. The setting was gorgeous, candle lit and full silver service with our own waiter etc, they even sent over a trio of musicians which was awesome! I'm pretty sure the gourmet restaurant there is Raja's, superb food and service!", "Only one thing that we found was at the time as Australians the food by the pool is quite expensive, we paid about $55AUD for burgers by the pool one day my husband nearly died!!! : )", "The staff here are so friendly, the Balinese are really beautiful people by nature and this hotel is such a great asset to Nusa Dua, I would love to stay there again some day and hope that we get the opportunity! : )\n", "\nFrom the moment I arrived the staff were some of the friendliest I had ever met. The service was excellent. Stayed at the palace club room which gives you all the extra free-bees, and its worth the extra money. The gardens of the hotel are salubrious to say the least. beautiful balinese decor is awe inspiring.", "Make sure you don't waste your money on hotel taxi's, just walk out of the gate and you will find taxies for half the price. also change your money any place other than the hotel, the rates are way lower than what you will get out side. If you pay the bill in cash (who does) change currency out side as the US$ published on the hotel site is converted to Rupiah for the bill.", "Do not come here alone, as I did! I was here for a convention for a week and felt miserable without my special someone, in such a romantic place.", "The hotel needs to be upgraded technologically, The Tv's were old and the in room wifi meant purchasing a pre paid wifi card from the gift shop.\n", "\nWe have just returned from our fourth stay at this fantastic resort.", "We always stay at the Palace Club and each time our greeting upon arrival almost reduces me to tears the same beautiful staff (and some new ones) are there to welcome us with open arms.", "The whole resort is beautifully maintained the food is sensational ,the Spa treatment are incredible so if your looking for a wonderful stay in Bali I can \"HIGHLY\" recommend NUSA DUA BEACH & SPA RESORT the only negative is having to leave BUT we will be back. Thankyou to all the staff who work at Nusa Dua Beach & Spa...you are all wonderful!!!!!!!!!", " ", "Mark & Kerri Matulich Queensland,Australia\n", "\nWe spent a week at this wonderful hotel. From our experience, and from reading other reviews, I think the key is to book a 'Palace Club' room. This gives you an upgraded room, complimentary breakfast in your own private area, afternoon tea is free, as are cocktails between 6.00pm and 8.00pm! The service is second to none, nothing was too much trouble. At breakfast, you have a good choice laid on, then they will cook to order pretty much anything you want! Cocktails includes champagne if you want, it is a terrific bonus if you like a drink, as cocktail prices at the main bars are around £5 - £7 a go. Internet access is available free of charge as well, soft drinks are available free at any time in the Palace Club lounge. Our room was big and bright, looking out to the lovely gardens. It had a seperate shower and a jacuzzi bath, plenty of cupboard space, and an effective (and silent) aircon!", "Eating in the hotel can be pricey. The Chess Bar by the beach has a mixed style of menu, overall pretty good value, we ate there a couple of times. You can get a cab out to local restaurants, and as others have mentioned, get the same good food for about half the price! We can recommend Bumbu Bali restaurant, traditional Balinese food, a short cab ride away. You will need to book - it is worth it! They will drop you back at the hotel for free! Also 'Tropical' on Mengiat Street was nice. ", "We can recommend a trip to Jimbaran, get some seafood while watching the sun go down. Be careful as the taxi driver will drop you at his choice of restaurant. We had to walk out, then get down on the beach and have a walk along before selecting where to eat. ", "A word on the cabs - the hotel will be eager to get you to use their transport. Ask them to call in a 'meter taxi' , which are so much cheaper than the hotel's own. You will meet a bit of resistance, initially, but insist.", "Bali is a wonderful place, Nusa Dua Beach is a great place to stay. We would certainly go back in an instant!\n", "\nOn the whole this is a very nice hotel. We spent 10 nights in a pool view room. Departed on 31.10.08.", " ", "Pools: The hotel has 2 pools- main & lagoon. Both are a good size. The lagoon has built in seating areas which were very welcome. ", "The pool bar service is hit and miss- sometimes efficient and at times non existent. Drinks- fruit juice, milk shake, smoothies, coke etc cost around £3-4. Water cost around £1.50.", "Restaurants: Guests had the choice of dining inside or out for the buffet breakfast. The choice was average. Some mornings trying to get a cup of coffee/ tea could be difficult. ", "Dinner: We tried Chess Restaurant dinner buffets on two occasions- the satay on the evening we arrived and the seafood BBQ mid stay. They were both the same price R325K (ex service charge & tax) per adult, half price for children. The seafood was much better value- it included lobster and fillet steak, which were excellent. With a few drinks the cost was around £100 (2 adults and 1 child). ", "Alcohol is expensive, a glass of local wine cost around £6, cocktails £7-8, gin & tonic £6-7, glass of beer £3-4. A bottle of decent wine would cost in the region of £30+. ", "Had lunch a few times, food was very good.", "Culture evening: international buffet and dance show was lovely- cost around £100 including drinks.", "Rajah's restaurant (Indonesian) seemed very popular, always busy in the evening.", "The Asian restaurant (Japanese/ Chinese) seemed very quiet.", "The Pizza restaurant: my daughter had dinner here one evening and said the food was lovely. ", "The location of all restaurants is good- dotted around the pool, near the beach front. They look lovely at night, when all lit up.", "Kids club: My 8 year old daughter liked the club very much. The club and all activities were free.", "Beach: Generally the beach was poor but at times it looked lovely. The water is warm & very clear. However, the sand was very unpleasant to walk on- not firm, with lots of broken coral, so beach shoes are a must . There are quite a lot of hawkers who pounce as soon as you set foot out of the hotel grounds- sarongs, watches etc. Everything being sold can be purchased in Kuta or Nusa Dua village for a fraction of the price. Massages are available to the left of the beach as you walk out of the hotel.", "Outside hotel: There are a number of local restaurants that provide free transport to and from hotels. The most notable being Mai Mai- the food is fantastic and the service is great. The cost of a 3 course meal with lots of drinks (alcohol & soft) is around £20-25 for 3 people. Ring: 772406 for free transport. There are lots of other restaurants and shops in this area but they are not within walking distance of the hotel. If you use the free transport (both ways), you can stock up on drinks & snacks very cheaply either before or after dinner.", "Just outside the main gate, within walking distance of the hotel, are shops and restaurants. We tried Tropical restaurant, the food was very nice, however, the drinks menu seemed extensive but they had 'sold out' of wine and gin etc. (See above for better option).", "Bali Collection: We didn't like this shopping centre. We had dinner which was poor quality and over priced. There are shops passing themselves off as 'designer', they are not genuine. For shopping ask hotel for metered taxi to Kuta cost R70-80K (around £5). Matahari department store is very good- clothing, shoes, bags, jewellery, gifts etc with fixed prices. There is a supermarket attached which sells water, juice for R1-4 (approx 10p to P) Poppies Lane 2 is worth visiting- sunglasses & watches R30-50 (up to £3), purses R50-70 (up to £4.50), handbags R120-150 (up to £10). The first price quoted by the seller is usually ridiculously high, you should pay no more than prices quoted above.", "There are 3 other hotels in this area within walking distance, we visited all of them. The Lagoona is beautiful, ideal for honeymooners/ couples. The Melia seems to attract a lot more hawkers on their stretch of beach. The Westin which is next door to Nusa Dua Hotel, seems nice.", "Tours: Pacific World should be avoided- they overcharge and will try and take advantage of you. Go elsewhere.\n", "\nWe just got back after what can only be discribed as the most relaxing pampered holiday we have had in years.", "We took the SPA package and stayed in one of the suites on the 4th floor.", "1st the SPA - They are really well organised and provided everything you need down to disposible underware which were great as they could be used after treatment to go into the steam and sauna with.", "The Jacuzzi and hot pool were a welcome addition after using the steam and sauna to jump into (well use the steps and its deep)", "I had a facial - this was so relaxing and what i like is the staff do not talk while treating you and the birds singing in the trees along with the soothing balinese music in the back ground.", "Then i had the Ritual massarge this was fantastic made me feel so relaxed and care free (what holidays are about in my book),", "The next day i had another massarge the concentrated on the feet and legs before moving up the body right till the hair got a coconut treatment we then top off with shower then flower bath.", "All in all well worth the money.( you can get cheap massarges on the beach but never tried )", "The Manager, Gin was his nick name was Brilliant from walking in the door to checkout anything i wanted to do from white water rafting to eating out one phone call to him and it was done.", "We even got free transport back to the hotel from the local restaurants around the resort and if you phone they will pick you up also.", "The Food - one word Fantastic I never was stuck for something to eat as the choice at all the meal and cocktails were great. my favourite was the afternoon teas so many choices but i loved there scones so nice they just melted in your mouth.", "Local shops barter barter barter i got a table cover for 80 000 which was great considering they started at 250 000. dont worry they like to barter also.", "My Recommedation is to book the club package - it is great value and the alcoholic drinks keep flowing in the cocktail hours.", "Our room had vaulted ceilings and two bathrooms with balcony running the full lengh of the two rooms (lounge and bedroom.)", "first class accommodation.", "will I go back - YES YES\n", "\nCompliments the Management and Staff of the Nus Dua Hotel and Spa, on their effeciently run hotel and wonderful friendly service.", "The grounds and facilities at the resort are wonderful, had everything we all needed to relax, and feel pampered.", "We stayed in a Palace Room which well appointed, good size and great attention to detail by the room attendants.", "The food at the resort was great we made it to the Bali Show night as well as the Seafood BBQ. Food was supurb, prawns, fish, lobster, steaks, finished off with Banana Flambe, outstanding.", "Please continue doing what you are doing because it's working!\n", "\nHi", "We are just back from a three week holiday in Asia .We had a great time in Brunei ,KL and Bali.Spent a week here in Nusa Dua and a week in Sanur.15 minute trip from the airport.Stop at a mini market and get extra water and treats before going to your hotel .We used our time to unwind and relax.We did not rush around sightseeing as this was our annual holiday .Every day was spent at the pool/beach and we were lucky with the weather as only saw 1hr rain in three weeks although it did rain in the middle of the night a couple of times but won't count..We chose Nusa Dua Beach Resort from all the good comments on Tripadvisor and new it would be very relaxing so thanks everyone.After a bad start with given a room miles away from the pool we ended up only 20 mtrs away on a ground floor room as originally requested.We are a middle aged couple with walking problems so if you are the same request a ground floor room as this is a big resort.It ", "takes 10 minutes to walk from the reception to the beach.", "The staff were the most friendly we met in Bali and all happy.The room was great clean and tidy with nice garden view from our sitting area.You can sit there looking at the squrills run ip and down the large trees or the swallows flying around all day.The garden area is huge and you need a bike to get around to see it all.We were at the beach end of the resort so the long treck to the spa was not an option as it is at the front of the property.That was a shame as it's pool was the only one open till 10PM.The two large pools were never crowded and the sea was always inviting.Nice white soft sand safe for swinning even at low tide.The beach hawlkers were well behaved and not a bother.Had a few $15 massages on the beach turn left on path and they are set up at the edge of the resort..", "Get breakfast included in your room rate as they are great and will keep you going all day.They had everything you could want hot or cold food.The only let down at all these resorts are the toasters are so slow.We only dined in the hotel once and went to the Bali gala dinner with cultural show which was great all set out in the large areana and open air stage they have.All the other meals we had out and made use of the free pick up service most restaurants provide..Start with Tropical (0361 772046) Jimbaran Bay is a must to see the sunset at 6.00pm and have a meal at the many restaurants on the beach.", "Nusa Dua is a great place to relax and for people that do not need to be partying all night long .Kuta is 15 minutes away if you want that.We had a great stay and would reccomend it for a relaxing resort holiday.Try to get up to Ubud to see the shops & rice fields.\n", "\nI stayed there during Xmas 2003. Great entertainment and dinner facilities. The garden is nice and quiet to stay in. The white beach was lovely. Grat service that made us feel that we were at home.\n", "\nWe stayed at this hotel in the middle of January 2008. Overall I had a wonderful experience at Nusa Dua Beach Hotel, the rooms and grounds are wonderful, and it was fantastic to have a private beach!", "Rooms: We were lucky enough to have an upgrade so got a double room (two rooms with a door cut out in between), when there were only two of us. Because of this we had a large balcony which was great to sit on at night and have a few drinks - don't forget spray for mosquitos though! The bathroom was clean, there was a shower over the bath and a toilet in the bathroom, outside the bathroom was the sink. The rooms were cleaned everyday and the service was wonderful, we noticed one time the cleaners had actually picked up our clothes from the floor and folded them for us - something I am not used to! We were in a corner room and were right next to the stair case to go to ground level, we didn't really hear much noise outside, but you could hear the cleaner's cart some days. The rooms come with bathrobes, slippers and umbrellas, there is also an electronic safe which was perfect for us. Room service was open most of the time and the food was quite good, although was the same price as an Australian hotel. The drinks and food in the mini bar were expensive as expected, we went to Bali Collection and stocked up on the same things for a quarter of the price.", "Food: The buffet breakfast was amazing, the best I have ever had. They had two Chefs who would make you an omelette of your choice, they had a huge selection of cereals, breads, Indonesian food (rice, curries, fish, noodles) and a huge range of Western foods (eggs, bacon, sausages, hash browns, tomatoes, mushrooms, pancakes, waffles) etc. Fresh juice, fresh fruit, salads and a wide range of cheeses was also on offer. We never had to eat lunch during our stay. The breakfast is also in a wonderful setting, and I never found it too noisy. We ate at the Japanese and Pizza restaurant at the hotel, the food was OK at both, but prices were no cheaper than Australia – the pizza was more expensive. We only ate at those places on our first day when we didn’t know where else to eat!", "Hotel: The hotel had wonderful surrounds, the exclusive beach was great, and we were not hassled by anyone wanting to sell us anything. The resort gardens were always tidy. The pool was nice, and was clean. I only used the pool twice (we had a lot of rain on our trip) and experienced no problems. The sun lounges were in a good position and were always available. There was also a pool which was outside the Day Spa and next to the tennis courts which was at the front of the hotel, this pool was right next to our room and was fantastic, it was always very quiet being next to the beauty spa and was very clean. Your pool towels were also on the sun lounges waiting for you, unlike the main pool where you have to give them some sort of token for a towel.", "Spa: The spa was great, prices were OK, but I didn’t have anything extravagant done so I didn’t find my treatment expensive. The massage was good and the massage rooms were lovely, however, the only complaint I have is that there were mosquitos everywhere in the Spa area and were biting me during my massage! I used the spa bath and sauna facilities attached to the Spa and these were very relaxing, they were also separate from the men’s spa and sauna.", "Location: Having never been to Bali or any Asian resort area before, Nusa Dua was a great place to start off. There was a Bali Collection Shopping Precinct which was a short stroll up the road (less than 10 minutes). If you walk or catch a Taxi out of the main gates there are lots of wonderful restaurants there which are so much cheaper than in the Nusa Dua area. There is also a market area out the front of the middle gate, which was handy. We rented a scooter and were able to drive ourselves to a lot of the restaurants out of the gates, and had an enjoyable time every night. There are also some restaurants in the Bali Collection with competitive prices and decent food. One tip I do have is when you are leaving the Bali Collection, always walk a little bit up the street and catch a light blue Taxi instead of the Taxis Bali Collection arrange for you. The light blue Taxis are a chain of Taxis and are always clean, safe and reliable. From Bali Collection to the hotel it cost 5,000 Rupiah, whereas the no name taxis from Bali Collection were charging up to 30,000 Rupiah as they weren’t metered. The hotel isn’t too far away from Kuta, and was only a $10 taxi ride away.", "Advice: The only advice I have for this hotel and Nusa Dua area is, make sure you eat at some of the restaurants outside of the gates, they have fantastic food and are so much cheaper than the hotel. Don’t get a taxi from the hotel counter, they charge far too much and are not metered. The best thing to do is walk out of the hotel’s driveway, walk past all of the gentlemen asking you if you would like transport, and you will always see a couple of light blue metered taxis waiting across the road for customers. They were my only choice for transport and were so much cheaper (5,000 compared to 30,000). There is a supermarket in Bali Collection which is where I suggest you stock up on drinks and snacks, and also things to replace items from the mini bar. It is so much cheaper. Also, if you are going into Kuta at all, their supermarkets are significantly cheaper than the one in Nusa Dua, so buy all of your more expensive items whilst you are there.\n", "\nWe recently stayed at the Nusa Dua Beach Resort and had 4 nights there. The staff are so friendly and so helpful. Breakfast had a good choice of so many different selections. The only thing which was a bit inconvenient was the fact other restaurants were a little bit futher from the hotel so if you decide to eat at the hotel it is a bit more expensive(but then this is Nusa Dua-bit more upmarket) It was very quiet compared to Legian/Kuta but then that was the reason we stayed there before going to stay at Legian. Out the main gates to Nusa Dua is a few good restaurants.This is only an 8 min walk which you fell very safe other wise a taxi if people dont want to walk. ", "There is also the Bali Collection which is a 10 min walk but during the day which can be quite hot, we caught a taxi which wasnt much at all. There is a few restaurants there which looked nice and clean and a Starbucks too .A supermarket which was handy to stock up on bottled water and bits n pieces.", "Nusa Dua Beach Hotel catered well for children but this didnt bother us who were there to relax. All the children were well behaved. The squirels were abundant but totally cute to watch. Grounds were imaculate and staff out every morning early tidying up. Also there is a great walking path along the front of the beach and was not crowded like Kuta Beach. ", "Our room was clean and spacious and I had a King size bed to myself while my daughter and her friend were given an adjoining room and their own bathroom( having 2 19 year old girls this was a relief for me)\n", "\nWe stayed in Nusa Dua Beach Hotel for our anniversary. The lawn and garden is excellent. Staff very nice, service are personal. They leave us with a message in the room before the check-out date to let us know we can still stay in the hotel lounge after check-out and extended discount for massage in the hotel, etc. ", "Nusa Dua is a very nice resort area. This hotel unlike the Laguna and Westin nearby that has bale that you can do a lazy lying at night to enjoy the sea breeze. On a couple of nights, we just take a 3 minutes walk along the beach to the nearby hotels for bale and sip a drink there. ", "Transportation is sth that you have to prepare for. There is no shuttle bus in the hotel and nusa dua area, except a shuttle to Bali Collection, which runs every 1 hour till 10pm. You have to take a taxi to wherever you go. Taxi service in the hotel are pricy, like USD15 for a ride to Kuta. But many restaurant has pick up service. For many nights, we asked the restuarant for a pick up for dinner, then just do some shopping and foul around in Seminyak, Kuta, Jimbaran, then take a taxi back to save one trip.", "We tried snorkelling in Nusa Dua beach with hawkers in the beach. It is a 10 mins ride by boat to the snorkelling area, costs USD30 for 2 pax for 1 hour. 1 hour is actually enough.", "Food in the hotel are delicious. It costs like USD40++ (excluding drink) for a Korean bbq dinner for 2. Like other 5 star hotels nearby, the drinks are pricy, like USD8++ for a cocktail, USD2++ for a small bottle of water. There is no kiosk or convenient store within walkable distance.", "We tried the Embrace spa package for 2 pax for 2.5 hours in one of the spa villa at USD190++. It is absolutely excellent and worth the money. There is a private plunge pool, jacuzzi and steam room in the villa for the couple, so enjoy the complete privacy. You can enjoy other spa facilities for the whole day, like the spa lap pool. The staff there said the spa lap pool has underwater music facilities, though i really cannot hear, it is very relaxing and enjoyable. I tried Well Being Spa in Seminyak (a local spa outside) as well at USD64 for 3 hours, it is absolutely not comparable, worth to pay more in the hotel.\n", "\nWriting this review is a hard one for me because Nusa Dua hotel is not normally the kind of hotel that I would enjoy, however this hotel certainley swayed my opinion in their favour.", "The Hotel is very well done the staff are great and friendly and will always smile and say hello while you are walking around the grounds. the gardens are imaculate and very well tended to.", "We stayed in the paradise club which I would recommend if you can, as you get a free brekfast, afternoon tea and cocktails in the evening in a quiet out of the way reeoption room. This is nice as there is always a good selection of food and the cocktails are very good. ", "The room was of a good size and was nicely decorated, with a nice shower and decent seperate bath. ", "The hotel has 300+ rooms so this means that the pool will get quite crowded and it can be a problem trying to find a sunbed, you will get the obligatory towel reserving which is a pet hate of mine, however I had no qualms in removing towels that had been there for 30mins+ without an occupier anywhere to be seen and pinching it for myself ;-D. ", "The beach is not the best and to be honest we didn't venture onto it once, but as we had recently been in the maldives this may have just been me being a bit picky.", "If you are a diver then I would recommend the dive centre. They are very instructive and helpful and there is a great wreck towads the north of the island which is definatley worth a visit. I completed my advanced padi while I was out there and felt all the way that I was in good hands.", "There is lots to see and do in Bali, we hired a taxi for a couple of days to take us around I would recommend visiting the monkey sanctuary, some temples grand palace, temple on the sea, git git waterfall is nice, and also the volcano.", "Happy Travelling\n", "\nWe spent our honeymoon in Bali last month, September 2008. The first half of our trip we stayed at Nusa Dua Beach Hotel (was part of a really great package deal with Asia Luxe/Singapore Airlines). The hotel is very nice and big and right on the beach. We stayed in a deluxe room that faced the pool and the ocean. The hotel and our room was very clean, we were happy with our accommodations. ", "However, the hotel is your typical beach hotel - it's where you go to relax (beach is great!). The hotel is in a secluded gated 'community' with several other 5 star hotels (the Westin is right next door) and if we wanted to explore anywhere outside the hotel, we had to take a cab. Though the staff was friendly, many didn't speak English very well. The only person that was really helpful was the Head Concierge (we can't remember his name, it started with a S). ", "If this is your first time to Bali, we highly recommend that you bring CRISP currency notes from your country. We're from the U.S. and outside of the hotel, it can be difficult to exchange your money for the best rate if your money is bent, wrinkled or torn a bit (very surprising!!)\n", "\nStayed for 9 nights in a deluxe room, Bed comfortable, and excellent bathroom. Blacony also pleasant with nice chairs. Only 2 free bottles of water a day but more could be had if you asked the cleaning crew nicely! ", "The pool was nice though not large in comparision to some of the others on the strip such as the laguna or melia. Unfortunately you had to be at the pool by 7am to secure beds which I found disappointing. I saw several incidents of 'lounger rage' and is an area I feel the hotel could clamp down on - people putting towels down and not using the beds till mid afternoon or so and is selfish in my opinion. That said other beds coud be got on the grass areas or beach.", "Breakfast was only average and other meals we had at hotel were ok. Ate most nights at the neraby shopping centre with plenty of restaurants. There is an hourly free mini bus but was often full or a ten minute walk or taxi. The beach bar was good but the lobby bar was dull and lacked atmosphere", "The hotel is a 3+ to 4 star and and whilst had a great holiday if was to return to nusa dua area would stay at one of the others.\n", "\nStayed in Nusa Dua for 4 days. Upon arriving at the hotel we were told our room would be ready in half an hour and given a welcome drink in the lobby. After 30 mins we were told it would be another 30 mins. This continued for 1.5 hours until we became frustrated and asked to be told exactly when we could check-in rather than waiting around like lemons.", "We were then taken to a room past building work that was going on. Our room was dirty, the bathroom had not been cleaned properly and it smelt a bit funny. We complained and were moved to another room which was an improvement but was not as nice as a 3* place we had just come from in Legian (for half the price)!", "Despite this initial frustration, the grounds are beautiful and the pools are very nice. The water is very clear on the beach but you cannot swim out very far. The gym is well equipped and the tennis courts were available for a small fee (you can even pay for a partner if your spouse is busy sunbathing!).", "The hotel is completely self-contained with various restuarants on-site all serving good food at reasonable western prices (though not like prices in Legian restaurants). There are outdoor shows on twice a week with an amazing buffet dinner. We went to the Balinese theatre show and both the food and the entertainment were first class.", "If it weren't for the poor service and the rooms which were not up to standard this hotel would have been rated 4 or 5, just expected better for the money we paid out.\n", "\nHi All, ", "Ok a little about us, Male 34 and new Wife 31. Our Honeymoon both from Leamington Spa, England", "Report of Nusa Dua Beach and Spa Hotel.", "Overall we had a great time at this hotel, we stayed in the Palace Club Suite and had the privilages of Breakfast, Afternoon Tea and Evening Cocktails. All these functions are served by Butlers or to us commoners waiters/ress. This added benifit i would recommend! The staff are all very warm and welcoming, which we found to be a bit of fresh air! they always said hello from the manager down to the cleaner/gardener would always stop and smile and ask how you are?. The gardens are in superb nic, and are the highlight of this lovely hotel. they must have about 20 staff always working in the gardens everyday to keep in trim. The hotel food is lovely but pricey compared to other aeras of Nusa Dua, for example;", "Hotel meal for two with wine was around £75", "Bali Collection meal for two with wine was around £40", "Nusa Aera (just outside the gates) meal for two with wine was around £25 and to be honest was just as nice. (The Tropical was the best for meals) We went to The Tropical a few times as we found it to be the best one. If you go to the Nusa Dua area (outside the gates) most resturants will give you a lift home F.O.C", "The Spa.", "We spent most our afternoons by the spa pool as the sunbeds by the main pool where always taken, i did try on a couple of occasions to find beds at 8am but found towels everywhere with no-one on them ggrrrrrr. The Spa treatments are expensive again compared to others outside the hotel. However we found that the hotel was much more luxurious then others and i think was worth paying that little bit more, example;", "2hr Massage with facial in Hotel was around £130 (price for two)", "2hr Massage with facial in Nusa Dua area was around £40 (price for two).", "Nusa Dua is a very quite area indeed with the last bar closing at 1pm. However should you fancy a night on the town then Kuta is the place to go $10 USD will get you there in a taxi (about 20 mins) and you can party on till the early hours. Semenyak (is that right??) is a cool place as well and another $10 will get you there as well, great for sunsets as is Jimbiran Bay. ", "If you just want a relaxing holiday then Nusa Dua has that to offer and we found it perfect for our needs as if we wanted a quite night then we stayed at the hotel or if we where in the mood for a night out then in a taxi we would go!!", "We also found the mixture of nationals to be good as well with Brits, Dutch, Thez Germans, Italians, Spainish, Ozzies, Chinese, France and the odd Yank / Canadian making it very interesting. It was just nice and refreshing to be in a resort not full of Brits!! (went to maldives last year and was like a little butlins!! lol).", "Pretty much everything is great about this hotel and im sure if your going you will have a great time unless your a fussy and a unhappy couple!!", "If i had to be sad the only down side to this resort is its beach and sea but having been to the maldives last year i think i will struggle to find beaches and seas like it is there!!", "Anyway have a great time you'll love it.", "Hello to the Dutch couple we met and told us about the orpanage.", "Also to Tony,Donna,Kez,Jess,Tom and Chrissy", "Happy Holidays.", "Rob and Hannah.\n", "\nNUSA DUA BEACH AND SPA HOTEL BALI", "WOW just got back from Bali , Nusa Dua Beach and Spa Hotel and have to say what a great holiday. Having waited so long to get away from all the stresses of work and such like, i can honestly say this is the first holiday where i felt i could have stayed for at least another week. (was there for two weeks) Normally there is something that always spoils your holiday but this was faultless, great food , great prices, hotel was spotless, (seems they just love to clean) room was attended to at least twice a day and never anywhere ive been have i met such friendly staff, everyone was so kind and helpful. If you are looking for a holiday where u can really relax then this is the place for u. There is a certain amount of night life but not the place to go if you are looking for wild nights but Kuta offers quite good entertainment. One small usual problem which i didnt expect was that you have the same old problem of getting sunbeds round the pool, and as there was only about three familys of the usual suspects at this resort, (you know who i mean ) i guess this is now a world wide problem which cant be labelled at one particular nation. For me and my wife this has been our best holiday ever and would have no hesitation jumping back on a plane tomorrow and heading back for another two weeks of paradise. .\n", "\nWe stayed in the Nusa Dua Beach & Spa Resort for 1 week in late July, and we upgraded to a Palace Club room. This was a fantastic decision to make and one we would not live to regret.", "On arrival we were escorted to the Palace Club separate check-in area, a short distance away from the main reception. Here we were met by the senior butler who proceeded to check us in and we were promptly given ‘ice cold’ towels to revive ourselves along with the most delicious fruit juice cocktail. Following that short and painless process we were taken to our Palace Club room just another short distance away. When our Butler opened the door to our room (which was more like a suite) we were so delighted to see the fantastic room we had. Where do I start?", "The bathroom was massive. We had a massive Jacuzzi bathtub which beside it there was louvered doors which could be opened into the bedroom. There was a fantastic vanity area, massive wash hand basin and lots of toiletries and towels available. Next to this there was the walk-in shower with two different showers heads inside. One was a regular type from the wall and the second one was allowed you to sit down in (if you wanted), truly amazing and very big and roomy. The next cubicle along was the WC. All were very modern, clean and perfectly maintained.", "The bedroom area had a massive bed (King size) and it was surrounded by a mosquito net (which you could put down in the evening and left up during the day). A large TV and Unit, which incorporated our fridge fully stocked with water, soft drinks, alcoholic drinks and snacks.", "Our room opened onto our own private patio area where there were two sunbeds for relaxing on if you so wished to do.", "The Palace Club was definitely worth the additional money. This included breakfast, afternoon tea (which comprised of scones, pastries, sandwiches etc), soft drinks and tea and coffee. Soft drinks and tea and coffee were available 24 hours a day. In the evening between 6 and 8pm there were free cocktails and premium alcoholic drinks, soft drinks and fruit cocktails were also available. Along with the cocktails there was always hot finger food. For example, there would be chicken satay (skewered on lemon grass), butterflied grilled prawns, curries, breads, always a vegetarian option, lots of fresh cut crudities and little dips etc, just a perfect accompaniment for a few drinks before heading off to dinner later on in the evening.", "We went to the Bali Collection (lots of shops in an outside Mall) and made some purchases there but to be honest, it is about 2 or 3 times more expensive than the surrounding area because it mainly targets the tourists. Find a local 7-11 or Circle K supermarket and stock up there. If you are out and about during the day, your taxi driver is more than happy to stop and let you stock up (of course the meter will be running, but the taxis are so cheap anyway this does not matter).", "We would recommend getting a private taxi/driver for the day who will take you on a tour of the island, avoiding busy traffic times and waiting at the attractions.\n", "\nWe spent 10 nights at Nusa Dua beach as the second leg of our honeymoon. After spending 4 nights in the wonderful mandarin oriental Hong Kong this hotel was very disappointing. We received no special treatment for beig honeymooners and upon check in to our Palace Club room we were greeted by a very strong damp smell coming from the bathroom and balcony area. We were shown another room which was exactly the same and were told our only option was to upgrade to a Palace Club Suite for an extra $100 a night. The suite was more spacious and the living area and bedroom did not smell, however the bathroom was not as clean as I would have hoped and didn't smell very fresh.", "During our time in this room we had to kill 2 cockroaches and couldn't leave any drinks or snacks around as they attracted hundreds of ants.", "I must say that the public areas of this hotel are very nice, the lobby, palace club and gardens are very nice. Pools are OK but a bit shabby, with loads of noisy kids. The restaurants are fine we has nice shushi in maguro and lovely pizza's in Sandro's. The Indonesian restaurant offered good quality food but was quite expensive. The best meals we had were at Ikan in the Westin resort next door.", "The lifts are dodgy to say the least and the doors slammed shut on me once and bruised both of my arms. I was told that someone on another floor must have pushed the button. Helpful.", "Our Thomas Cook rep Kasna was very nice and helpful and arranged some very good trips for us at reasonable prices.", "The beach was OK but most days the sea was too rough to swim in. There are some vendors on the beach but they are friendly and don't pester you too much.", "Nusa Dua is a nice resort for a relaxing holiday but if you want a nice room this is not the best hotel to go to.\n", "\nmyself and my new wife have just returned from paradise !", "The resort is 1st class all the way through .", " When we arrived we were shown straight to our room, with lovely garden views and you could see the sea in the distance room 3215, the bed was really lovely and big,the bathroom had everything you needed,i must say that it had the best power shower i have ever had. Your room was cleaned everyday. you were left 2 glass bottles of water in your room,if you wanted more you then had to buy some,you had the choice of the mini bar drinks and snacks.", " There were several resturants to choose from with just the best views of the gardens/pool or beach which is handy if you didnt fancy a 10 min walk to the bali collection just down the road,which offers you every single food going,we usualy had a starter main and bottle wine and few beers and sometimes a sweet and it comes to about £25/30 where in the hotel it was costing £45 depending where u ate.The only thing that was alittle pricey was the drink in the hotel,while we waited for the free shuttle bus we has a beer and a spirit which comes to £8.", " we went on 2 trips with the transfer people that picked us up from the airport, we visited the areas on the way up to seeing the volcano,wood making,painting,see how the jewlery was made and others,at each of these you felt that you had to buy something as they followed you around saying \"best prices for you\" etc. the other trip was horse riding along the beach which was 1hr dive,you were there for about 2 hours,then we drove a further1hr to get to the elephant ride,it was busy and what we didnt realise that you were fed there too,so we had a meal first looking over the beautiful forest scenery,we had a 30min walk on our elephant,you could also pay for an hour,you are asked if you would like your pic taken,in the pool or with the trees only costing", "£5. Both trips cost us £150 which we thought was not bad.", " As for the sun beds, if you were up early or before about 9 you were ok, you have the usual people that set there alarms,but normaly you were ok,we always got our towels and beds then went down to breakfast, Which is really good,lots too choose from hot and cold.", " What can we say other than, enjoy your stay, its just lovely......\n", "\nThis was our 4th visit to this Resort, and since on this ocassion we celebrated our wedding anniversary we decided to take the Honeymoon Package at the \"Palace Club Section\".", "From the arrival everything was just perfect, private transfer from the Airport, wonderfull reception with a tropical fruit drink, a great room with a well chilled bottle of champagne and above all , a great staff with a very good knowledge and practice of what customer focus means.", "The Hotel has a great location in Nusa Dua. The main entrance is spectacular with a superb lobby. Most of the rooms have a balcony with great tropical, either garden or sea views. Every morning you can feel the wonders of nature right at your balcony enjoying a cup of hot coffee and watching every type of birds or squirrels right there at your footstep.", "We had a great \"Gourmet Dinner\" at the Indonesian Restaurant and it was incredible, good taste and presentation.", "In general terms, our experience was wonderfull..it was like a dream in paradise...and yes, we are planning to go back again.", "Don't waste your time looking for other hotels, this great resort is not expensive and it offers top quality accomodation in Paradise !\n", "\nAfter staying at the Puri Santrian in Sanur and the Alila in Ubud this place was a real let down. It's big and impersonal and sadly lacking in balanese charm which was a real plus with the other two hotels. It's ok but nothing special and you could be anywhere.\n", "\nStayed at the Nusa Dua Beach Hotel & Spa for 8 nights in July. Had a Palace Club room which I highly recommend. Rooms were large and clean as were the bathrooms. The staff were very helpful and friendly, and the hotel grounds were very spacious and pretty.", "Service in the club lounge was exceptional, very good breakfast, afternoon tea and evening canapes and cocktails.", "Spa facilities were very good also.", "Would recommend this hotel to all groups as something for everyone.", "Loved Bali itself and would definitely return in the future.\n", "\nWe stayed at this resort from July 2 until July 6. The grounds are very beautiful and the staff very accomodating. We stayed with our 6 year old daughter and she enjoyed the pools and beach area. The buffet breakfast was very enjoyable with selections for all tastes. We also enjoyed hand feeding the squirrels that came up to our balcony (they like raisn bran!) ", "The rooms were large and nicely decorated with wood floors, wonderful amenities and very comfortable.", "I would recommend this hotel to any travelers going to Bali.\n", "\nI booked this hotel as the last minute as I couldn't fixed the holiday date due to tentative meeting.", "When I saw the pictures in this home page, I feel like old style atmosphere, but when I finally I realized this hotel have something different.", "I suppose this hotel is the oldest 5 star Hotel in Bali, but they can maintain the condition very well.", "The room was good, staff was friendly, and the Environment was amazing.", "However, the restaurant was not as I expected. Slow respond and the taste was average.", "I hope my experience is useful for you.\n", "\nMy wife and I spend our honeymoon at this fantastic hotel! We booked the palace club room, but at our arrival we were upgraded to the palace club suite!", "The palace club is defenitely wortth the money. You really feel like a V.I.P. Though it is a large hotel, the palace club makes it feel very intimite. Almost like a boutique resort.", "The palace club members have their own lounge where they have breakfast, afternoon tea and cocktails. The people working at the palace club are very, very friendly and threath youn like you are royal. Nothing is to much for them.", "The hotel is beautifully decorated with lots of woodcarvings and other Balinese art. I thnik this gives the hotel a different and unique atmosphere.", "If you go to Bali... go to the Nusa Dua Becah Hotel. We will defenitely come back!\n", "\nWe stayed at the Nusa Dua Hotel for 3 weeks and it was fantastic! We had our wedding there and everything was perfect! The hotel made sure we had everything we wanted and we had a evening reception meal for the guests down at the beach and it was amazing. The hotel and the grounds are the best and we are planning to go back next year for our first anniversary. All the staff and the people in Bali were lovely they are so polite and work really hard I recommend bali and the hotel to anyone it was the best!!\n", "\nJim and Brigita Wallaroo South Australia. We have just returned home after 2 weeks in Bali ,5 nights at Nusa Dua Hotel. Wecould not fault the hotel ,or service fom its friendly staff. We stayed in a Palace Club room with all the xtras the club provides,including cocktails and finger food each evening. Gardens are beautiful and spacious ,with many restaurants around the pool area ..We used the shuttle to go to the Bali Collection Shopping Centre ,but all Restaurants in the centre provide free taxis.We would no problem staying at the resort again .\n", "\nAt first, I was skeptical about staying in Nusa Dua. One of the reason being that the hotel was located away from the city. And, it was our first honeymoon trip to Bali which we hope to be a pleasant one!", "We had a late arrival at 8pm, the receptionist was very helpful to accomodate us to our rooms and offered welcome drinks. The room was very clean with fruit basket and the smell of jasmine filled the air. They had a parque flooring which reminded me of home. Very comfortable bed. The best nights ever as I slept through like a baby. However, the downside was the bathroom -which every each shower the bathroom floor was flooded and the size was rather small for my expectation.", "The open-air restaurants are a must during the night time due to cool breeze from the sea...", "We plan to come again to this hotel again next year. 4 days and 3 nights were not enough for us to fill our hearts. Perhaps this time, we will try out the spa and sports activities provided.\n", "\nStayed in Palace Club Room. Beautiful gardens and lots of squirrels to feed. Butler service was very helpful. Evening cocktails lead to all sorts of adventures. Friendly staff. Quiet area compared to Kuta, Cheap watersports on the beaches. Plently of wonderful restaurants with entertainment around the area - with free transport!", "It was very cool. Wish I was there.\n", "\nWhile this is a very nice hotel, with a large pool and decent-sized rooms, I would not class it as one of the Leading Hotels of the World. There were marks/stains in the room, the service of the staff is average at best, the food in the restaurants was, again, very average. Plus points would be the pool and the spa was lovely.\n", "\nWe stayed at this beautiful resort for 9 days on our honeymoon. This must be one of the most amazing resorts that we have ever stayed at, hence the reason for it being part of the \"Leading Hotels of the World\".", "The hotel offered everything that we could ask for. It is perfect for a romantic holiday, or if you just need to relax and be pampered. ", "We stayed at the Royal Palace Suite and the room was absolutely perfect. Very spaceious, super clean, and there is nothing that I can say badly about this place.", "Numerous reviews complained about the aircon, or the stickiness in the rooms. This is so not true. You have to remember that you are right on the equator, so the humidity will be very high. I don't know of any aircon that will get rid off the humidty if the doors are open. As long as the doors remained closed, the rooms were absolutely perfect.", "Regarding the food, very expensive, but after all what do you expect from a world class resort. Try to get a package that includes some of your food, and try to eat out at some of the restuarants just outside the Nusa Dua maingate as they give you much better value for money. Also, a beach seafood meal is a must! Thank you so much!\n", "\nFantastic place!", "I highly recommend this hotel, the staff are wonderful and if you can afford to upgrade to a Palace club room. You get your breakfast in a separate area in such a a peaceful and beautiful setting and you will also get evening drinks and nibbles included in your price. The only thing I would not do whilst in Bali is go to the Turtle Island that we were taken to as it is a place where they let adults and children actually sit on the poor turtles and they have nik naks to take home made out of turtle shell! I felt very sorry for the animals and felt bad that i had just paid to get in and encourage this to continue. ", "On a positive note all the staff at the Nusa Dua Beach Hotel & Spa are very friendly and helpful. We went on a bike ride with one of the staff as an activity and I highly recommend doing this as you will see the real Bali and some beautiful scenes. 10 out of 10 for this hotel!\n", "\nWe stayed at the Nusa Dua for 8 nights as part of our honeymoon trip. As this was a special occasion we paid to upgrade to a Palace Club Room, the room was lovely, very spacious, imaculately clean & comfortable with a huge bed, and great bathroom area, the furniture in the room (cabinets, chairs, t.v) were a little old & worn however this did not spoil it at all. Benefits of upgrading to the Palace Club were seperate check in at their lounge area (which is exclusively for the use of Palace club guests), breakfast served in the lounge area (with a lovely view overlooking the gardens) also included in the price was afternoon tea & cakes (We did not try these), soft drinks all day and evening cocktails between 6pm - 8pm, if you didnt want cocktails you could have beer / wine etc as an alternative. The pool / beach area of the hotel was great, very spacious & not too crowded when we were there. The pool area could do with a little attention as it is looking a bit worn (a few loose tiles, etc) however there is a lovely lawned sunbathing area just between the beach & pools, so you get the best of both worlds. We didnt eat at the hotel so cant comment on the food (apart from breakfast which was very nice), we went out each evening to the Bali Collection, which is a shopping / restaraunt complex, its about 10 mins walk from the hotel (they run a free shuttle bus if you dont fancy walking in the heat) We tried a few different restraraunts & had plenty of great food at a reasonable price (roughly £15 - £20 for a very good meal for 2 + a bottle of wine, the bill can be much cheaper than that if you drink local beer etc instead of wine) Try & find the Banyan Corner restaraunt tucked away in a little corner of the complex - the food was superb & we received a lovely warm welcome. We loved Bali, though admit we got a very sanitised view of the place as we went to louge around in the sun in a little slice of paradise - which Nusa Dua is. The people were so freindly, all very warm & genuine, we would love to go back someday & would not hesitate to consider this hotel.\n", "\nOK, this is a nice place, it has superb grounds, lovely pools and an impressive lobby. Service is adequate, staff is friendly. I personally found the hotel massive, it is huge and it was quite crowded at the time we were there (first week of May), resulting in a not so intimate atmosphere. If you happen to go a bit late to the pool or beach area, you have the chance of not finding a chair. Maybe we were not so lucky because of holidays in Europe, I don;t know, it could be that in another period of the year it is less crowded.", "The kids had fun, going from beach to pool and back to the beach again the whole day. For young children it is a nice place to stay.", "What disappointed us were the rooms: we booked superior rooms but found them quite cramped, especially the bathroom. Moreover, and I am quite sensible to this, is that the interior had seen better days: too old, paint peeling off the wood. I guess a complete renovation of this place would help a lot.", "Overall impression: lovely place but can be crowded, rooms need overhaul. Wonder why this place belongs to 'The Leading Hotels of The World'.\n", "\nThis realy is an amzing hotel, we paid to be upgraded to the 'deluxe wing' and you really get great value for money doing this private check in, own breakfast room (with the other guests from the wing) afternoon tea included each day, all suites (ours was on the ground floor over looking the gardens and a small temple!", "The Hotel is BIG, but being in this wing gave you the feeling of being in a smaller hotel. The staff are SO lovely - they can not do enough for you and the little guy who works the pool bar is a sweetie - make sure you tip him at teh beginning of your stay and he will look after you with extra large drink through your stay.", "The beach is lovely and clean, the water is warm and has lots of fish in it - if you like to snorkle.", "Food - we didnt eat in the 'main' restauant at all, as there are some many smaller, speciallty ones. The Sushi bar on the beach is great for lunch as it the pizza bar. They do theme nights to during the week and these can be quite fun (if you like to socialise.", "BALI is one the most beautiful places to go int he World and the people are the kindest we have met ", "BIG recommendations!!\n", "\nWe just returned from a great family holiday in Bali. We stayed at the 5 star Nusa Dua Beach Hotel and Spa for 6 days. We checked into one of their Palace club Suites over looking the sea, and was excellent. Bed Room, Sitting area, private balcony, pantry and the toilets were very spacious and clean. Separate Lounge and Breakfast area for palace club members were very convenient and special. Pool, Beach front, and the Staff was excellent. The hotel is situated at a convenient location, close to the Airport.\n", "\nWe had just one night at this hotel - and one night was enough! It's not the sort of place we normally stay, as we like a bit of local authenticity. It did the job - it's relatively near the airport, and we could get an early morning transfer. We got a good deal on a room, and the included buffet breakfast was mind-blowingly comprehensive. However, this is a typical international luxury hotel with no soul. Fine if you don't want the real Bali. We really didn't like the gated community of luxury hotels with a security guard to keep out the local people. The water wasted on fountains and golf courses seemed ridiculous. The hotel restaurants served expensive international food. If you want to travel all the way to Bali to stay in a bubble, this would be OK, but if you want a real travel experience, find somewhere more interesting.\n", "\nI stayed 5 days in Nusa Dua Beach Hotel and Spa last summer during my honeymoon in Bali. ", "It was our first experience of such a 5 star hotel and it was unbelievable. Moreover we stayed in the palace club which was even more fantastic.", "2 superb swiimming-pools (we loved drinking cocktails sitting at the bar in the middle of the largest pool), 4 tasteful restaurants, a lovely beach in front of the hotel, and the amazing Palace Club facilities : a very large room with XXXL bed and jacuzzi, incredible breakfast and evening cocktail with meals from all around the world.", "The only inconvenient, which is the same for all the Nusa Dua resorts : Nusa Dua is far from Bali's most interesting places, so my advice is : first travel across the island and then have a rest in the NDBHS !", "There are also so many rooms that one could feel lost in the hotel...\n", "\nWe just got back three days ago, spending four night there. The overall experience is rather average, the receptionist was not friendly till we were told that we got the Palace Club rooms, which had its own reception area; most of the staff there are friendly and helpful, but a bit too slow sometimes. The building is a bit too old and defiintely needs renovation, and the rooms are okay, but the TV is from 80s and showing black and white while playing DVD for some reasons. The pools are good and the food is also okay. Staff serving breakfast are friendly, but not attentive -- they should have cleaned the table and change the tableware and tablecloth before next batch of customers are served proactively. We like the tress there, lots of trees, very natural and stress free. We went out to Kuta and zoo and monkey mountain which was quite fun. Unfortunately, the weather was not funny all the time.\n", "\nStayed here for four nights with my wife, son & his wife for a long weekend. My son had booked the break and when we checked-in there was some confusion, they couldn't quite sort out that there were two men with the same surname but it was quickly resolved.", "The rooms were quite spacious and well appointed with a balcony overlooking the gardens, unfortunately we were also overlooking the service block of the hotel next door.", "There are a number of places to eat some of which are open all day, the food and service was good, the breakfast buffet was excellent.", "The gardens and pool areas were quite pleasant with plenty of loungers and chairs, the beach was not quite so tidy, oil patches here and there and of course the usual constant prosession of people trying to sell you their wares, this can become a bit tiresome.", "We found the staff to be very pleasant and always willing to help,", "we had a very restful four days.\n", "\nWe have just returned from the Nusa Dua Beach Hotel & Spa, and I cannot praise it highly enough.", "From the first moment that we walked into the lobby the staff were extremely helpful and the decoration was stunning.", "We spent our first week in a delux room, and had the most beautiful view of the ocean and the pool from the balcony. Our family also spent their nights in a delux room, and none of us had any complaints about the accommodation whatsoever.", "As we were getting married in the hotel, we had booked our second week in a Palace Club room, but luckily for us we were given an upgrade to a Palace Club Suite. This room was awesome. Again, it had a beautiful view, of the Temple Gardens this time, and the room was incredibly spacious and well maintained. I would definately recommend upgrading to a Palace Club room because as a member of the Palace Club you get extra benefits like afternoon tea, soft drinks at any time, and evening cocktails. The staff all through the hotel are incredibly friendly and always happy to help with any request.", "Our son made use of the Gecko Kids club a couple of times through our stay, and he usually didn't like to be dragged away as he was having so much fun. The staff in the Kids Club are really friendly and make such an effort with all of the children.", "The pool is beautiful and we all had a brilliant time in the all the pools. The sea is just 30 seconds walk away from the pool, and it is lovely and warm.", "There are men on the beach offering boat trips forsnorkelling etc, and if you ask them, they can organise just about any water sport you can think of. Failing that, the staff in the hotel will also be able to point you in the right direction of whatever you wish to do and be able to organise it for you.", "Our wedding was beautifully organised by the hotel staff too - I cannot thank them enough.", "In so far as the previous review to this hotel, I can only imagine he stayed in a different hotel to us. We were in a party of 7, and none of us had any concerns in respect of our hotel. I agree that the price of the food is high, and indeed you can get cheaper food outside the hotel, which we did do at times. We tried the Westin nextdoor, and ate there and had a walk around, but to be honest I wasn't impressed with that hotel at all.", "The Nusa Dua Hotel & Spa is beautiful. There are wood carvings everywhere, and a beautiful water fountain in the lobby. ", "We all thoroughly enjoyed our stay in this hotel, and plan to go back as soon as we can. My only dislike was that I had to eventually go home.\n", "\nWe stayed in Bali for 8 days, the last hotel booked was the Nusa Dua Beach Resort & Spa hotel. For the 8 days we stayed in four hotels, including the neighbouring The Laguna and Discovery Partika in Kuta.", "The first impression of this hotel is a good one. The lobby is clean, staff are friendly, hotel looked nice, pool is awesome etc. We even got upgraded from a Deluxe Room to a Palace Club Room. Great!", "However, it was short lived. The Palace Club rooms are on the ground floor, and the first impression you get walking in was the smell of dampness. The covers on the bed felt damp, and the air smelt musty. ", "The other impression is of claustrophobia. The rooms haven't been renovated for some time and are quite old with lots of dark wood, making them dark and dreary. The beds are also pretty average and the air conditioning blows directly onto one side of the bed. The TV reminded me of one I had as a kid.", "We asked to see other rooms and the helpful and patient duty manager showed us every other room available (about 5 in all), but they all had the same problem - dark, musty, damp, old.", "We stayed for two days. Its not a bad hotel all considered, which is why so many people rate it highly, but in the end the room just got to us especially as the weather wasn't great and we wanted to spend more time in there. You get used to it, but you don't enjoy it so much.", "In the end we changed to the Laguna (100m away, Westin between). Whereas the Nusa Dua was ok, the Laguna was awesome. The Laguna is just that bit better in every way - breakfast, TV, guest services (ask the butler for anything, he'll get it!), but most importantly benefitted from newly renovated rooms. ", "It the room is important to you, we recommend going for the Laguna as a preference, failing that the Westin. They really are both a lot better in comparision. Nusa Dua Beach Hotel & Spa only really stands out if you don't compare it with these two neighbours.", "(We even enjoyed the Discovery Partika in Kuta more than the Nusa Dua Beach Hotel)", "My last comment is about the location. Nusa Dua is nice, but if you're expecting to do watersports, most the interesting stuff is 4km down the road from these hotels. Don't expect to just walk to the beach and rent a jet ski or anything. ", "Also, Bali is cheap to eat except for the Nusa Dua hotels. There's plenty of places outside to eat for 1/3rd the cost of the hotel, and just as good.\n", "\nWe were introduced to this hotel by a travel agent who gave rave reviews. A quick check with Tripadvisor confirmed his opinions of the place. The hotel's rates is very affordable for its standards, and offers decent amenities comparable to the best hotels which Bali has to offer.", "The hotel is situated in a convenient location, near the airport and within 30 minutes of Kuta. Most of the local drivers are familiar with the hotel which is a bonus especially when arranging transport to and from spas, restaurants and other destinations.", "However, if you're looking to travel to the Kuta and Ubud area often, note that the daily taxi rides will probably burn a substantial hole in your pocket after a while. But if you're looking for a quiet holiday away from the crowds, then this hotel is great with its private beach facility.", "The hotel staff, like most Balinese people, were very polite and generous with their smiles. Most requests were swiftly attended to, even at late hours. Check-out timing is pretty flexible even if you arrange for it last-minute, as in our case.", "On the negative side, some of the hotel's facilities are rather old. The safe deposit box in our room could not be used and the wiring of the lights was faulty, flickering once in a while. Also, be prepared to have to travel a fair bit for meals if you're not very keen on consuming the hotel's food. ", "Overall, it was nevertheless an enjoyable experience.\n", "\nToo big and crowded for our taste but it was our mistake. If you like a big beach hotel, it is probably very good. Bedrooms are small though (we were 3) and the layout of the bathroom makes it hard for two people to be in it at the same time. Breakfast was fine but it was difficult to find ripe fruits. There is a feeling of a strong push to consume and there is not much for free. No complimentary afternoon tea which is quite common elsewhere. We found the Balinese restaurant expensive and quite bland. The pizza place was bad, we had to eat there one night because Chess restaurant was closed due to a beach party barbecue. Pizzas covered in raw garlic (which we could not see because one has to eat in darkness). Lap pool is good though, quiet and possible to swim a km without trouble, nice to have sauna and steambath as well.\n", "\nBefore I booked my stay at the Nusa Dua Beach Hotel and Spa I checked out every review for hotels in the area on this exact website. And this hotel had the best and most consistent reviews for a good reason - it really is that good. We had a wander into and around many of the hotels during our stay and this one is the best by far. If you like majestic balinese sculptures, waterfalls, marble floors, silk cushions, the best breakfast you've ever had, big amazing pools, frangipani oils, spas and great coffee then stay here. Many of the other hotels we had a sticky beak at seemed to miss the point that you were in Bali - some were very bland and westernised. The mini bar is outrageous but you can catch a cab to Bali Collection shopping centre (5 mins) where you can buy cheap drinks at the supermarket, there's also a lady on the beach that sells from a modest stall (turn left on the beach) Food in Nusa Dua is expensive but you can always find cheaper fare at Bali Collection Shopping Centre but it's a bit like dining in Surfers Paradise so it's worth paying extra to eat along the beach. I'll be back to this hotel.\n", "\nMy family stayed at Nusa Dua Beach hotel on 31 January 2008 for a short vacation trips. This is our first time visit to the hotel. We choose this hotel because we are curious. This hotel is a member of Leading Hotel of the World that have a reasonable price. ", "We decided to try to make early check in because our plane arrives at 9.30am.", "The check in process was quite fast and we're allowed to get an early check in. But, the staff is doubtfully. Although the hotel was member of LHW, the staff didn't know about the leaders club that I have joined. So we cannot get any advantages of the Leaders Club. ", "We stayed in the three bed superior room. The room was huge. We're glad because we need lots of space for our belongings and doing our praying activities. Almost everything in the room was old fashioned, but it well maintained. The bathroom was small (for 3 adult) but it runs well. We just have one little problem. The balcony was quite dirty when we first arrived. But the problem was solved, after i talked to the housekeeper.", "The hotel facilities were quite comprehensive as a 5 stars hotel. The staff was overall friendly and the service was indulging. There no need to worry if you wanted to shop. There also a free hourly shuttle to Bali Collections. But, the strongest point of this hotel is on the hotel grounds. It has a beautiful landscape, compared with other hotels in Bali that i've stayed. The arrangement and the diversity of the landscape make the hotel enjoyable for jogging.", "Overall, this hotel was quite pleasant and i think it's the most value hotel in Nusa Dua Area. But, if i may give suggestion to the hotel i would suggest the hotel to do some renovations. It’s “must to do” because the other hotels in Nusa Dua areas, such as Westin, Melia, Laguna Resort, have recently doing it. I’m afraid it will lose the competition again those hotels in term of modernity.\n", "\nWe stayed at this hotel on 12 January 2008. This hotel was only booked on the Wednesday before staying on the Saturday.", "The check-in was quick and easy, including changing the reservation name on one of the two rooms booked. We decided at check in that we need a 6.00pm checkout the next day. This was easy accomomdated. (We had to pay a day room rate of 50%).", "We were upgraded by the hotel, to one of the palace club rooms. These are very big a spacious room, which was a bit of a waste for a person travelling by themselves.", " ", "Our room rate included breakfast which was of the normal standard of a hotel of this type, plenty of choice.", "I would defintely stay at this Hotel again, if visiting Bali.\n", "\nMy husband and I spent the main part of our honeymoon here. We booked 6 nights in a palace club room as you pay a bit extra but then get things like free soft drinks, canapes and cocktails in the evening, afternoon tea and breakfast.", "When we got there we were upgraded to a suite which was like a little apartment - fantastic!", "The hotel itself was beautifully clean and well maintained and the service we got was just incredible. The staff could not do enough for us and made our stay really special. For breakfast we could have anything we wanted - freshly made smoothies, boiled eggs, pancakes.", "The hotel is right on the beach which is beautiful and I particularly enjoyed our first night's dinner at the Chess restaurant by the sea. The food itself was good quality and not overly expensive considering the hotel is 5 stars.", "I would definitely go back again.\n", "\nMy husband and I stayed here for 10 nights for our honeymoon, and I can honestly say it was one of the most beautiful places I've ever seen! It is surrounded by fountains and large ponds full of fish and lilies, with temple-like parts to all the buildings making it feel very special. ", "There are lots of restaurants and bars at the hotel, and all the staff everywhere are lovely, friendly and polite. One of the best bits is the bar in the middle of the pool, you can swim up to it anytime of the day or evening and have a cold relaxing Bintang! We ate at the hotel half the time, and the food was very good although quite expensive. For the rest of the time we ate in Nusa Dua itself, which was only a 10 minute walk from the hotel, and you’re perfectly safe walking to and from there at night together. There are lots of great little restaurants where you can eat food that’s just as good for a fraction of the hotel price so definitely recommended. If you want to go a bit further out you can get a cab from the hotel but don’t use the hotel cars, ask them to book you a Bluebird cab and you’ll save £££’s!", "The rooms were really lovely, clean and very large with great bathrooms, we had a Jacuzzi bath and a double shower in ours, and the whole room had everything you could need, the laundry service was fine (nothing shrunk or lost!) and there was a huge TV/stereo/DVD player if you just felt like staying out of the sun for a lie-in.", "The spa at the hotel is wonderful, with large hot tubs and cold plunge pools, they are separate for men and women but you can pay a little extra and go in a joint one, or have massages and treatments together either in the spa huts or by the beach- this was really lovely and romantic although probably a bit expensive unless you’re on your honeymoon and happy to spend the money! Nice tennis courts, where you can play for an hour and hire all the gear for only a few quid.", "There are three pools at the hotel, one in the spa and then two by the main area of the hotel, both are gorgeous and very clean. Service around the pools is excellent, I would strongly recommend the homemade lemonade! We didn’t really swim in the sea very much as the pools were so nice, and also there was a warning about spiky sea urchins (and we saw loads!) so take extra flip flops to wear in the sea if you’re going to brave it. You can borrow snorkels etc from the pool bar and there’s loads of stuff to see in the sea so worth a go.", "There are lots of different events going on at the hotel, the traditional Balinese meal and dancing is really good although again, a bit pricey. Afterwards you can take a great romantic walk along the beach path too to wear it off!", "Overall I would absolutely recommend this hotel and resort, hardly any children there which was really nice, although it did have a good family friendly feel too. My only reservation would be the price of eating and drinking there all day every day, so I would recommend going out into the town- there are just as many lovely places to go there, and you can save your money for some scuba diving or sightseeing to the volcano, which can all be arranged through the hotel and are definitely worth making the effort to leave the gorgeous hotel surroundings for!\n", "\nThis hotel is absolutely lovely and lived up to every expectation and more. The beach front location is great, it's quiet enough to relax but only a short taxi ride away from the bustle of Kuta.", "Breakfast was delicious, such a good choice and so fresh.", "There are a few restaurants around which are nice too, not much nightlife but Kuta is just down the road.", "Rooms aren't huge, but definitely comfortable and clean. Staff are very friendly and helpful. ", "At night there are lizards all over the place (not in rooms unless you leave a window open!) but that's to be expected.", "Would definitely stay here again, in fact, I can't wait to go back.\n", "\nMy new husband and I stayed here for 8 days as part of our honeymoon. I found this site after we booked and was a little concerned about the reviews I was reading. What a nice surprise to find that the pictures don't do this place justice and the staff was unbelievably friendly and helpful. I would recommend this hotel to ANYONE going on a honeymoon to Bali. We especially loved the couples spa package. It is heaven lying in the private fragipani flower bath sipping coconut milk and listening to the birds, feeling the ocean breeze and then slipping on a soft cotton robe and lounging on a private bale... A bit of advice about the pool loungers being scarce...go to the spa pool. It is next to the spa and open to all guests. There were only a few people there and it is so quiet and peaceful. The food here was delicious and the prices were what we expected for an upscale, luxury beach resort. Breakfast buffett was very expansive and had lots of different choices each day. We had booked a deluxe room and were very happy with it! We loved this place and can't wait to go back (one day..) We really enjoyed the Balinese artwork and loved the beautiful wood carvings in the bedroon and throughout the hotel. Simply Amazing accomidations,staff and service.\n", "\nHi all,", "Although it’s been a long, long and sad time since I was in Bali (last April), it seems that after that me and my wife have been living just to fill the time between our trips…", "We had a wonderful time in Bali, and that’s in a great deal due to the Nusa Dua. It was our 5th anniversary and actually our 2nd true vacation since our marriage, so we called it our 2nd honeymoon. I booked a superior room, but they upgraded us to a Palace Club Room. Great reception, rose petals in the tub, a heart made of orchids at the bed. My wife spent the whole week taking care about the orchids.", "The staff was really friendly and helpful, but the again, I think this is a Balinese treat, so I guess any good hotel will serve you that. The hotel room and facilities are well kept, everything looking new, great toiletry, changed everyday (even a good quality wooden hairbrush, that my wife took to the beach was replaced). In general, good attention to detail. The social area is very pleasant, and the Balinese style entrance garden is certainly a plus. The breakfast is vast, ranging from a complete warm Japanese meal and European cheese, to beef sausages, for the Islamic guests. Overall good food, although the fruits seemed to us a little flavorless (but then again, we’re from Brazil, and we do have very good fruits).", "The beach itself is not great, the sand stripe is quite narrow, and the seabed full of rocks and seaweed. Anyway, for us, it was great, quiet and peaceful enough. The swimming pools are great, large, and the artificial beach is very pleasant.", "The hotel restaurants serve good food at prices comparable to what we’d find in Brazil (which by the way is not cheap, as some may think), but we found that the restaurants around the Nusa Dua gate justifies Bali’s fame of inexpensive food. A complete seafood meal for two, including lobsters, big shrimps, crab, fish, etc. and beverage cost us an average of $30~40. I mean the kind of meal that occupies the whole table… Our tactics were lunching light meals at the hotel, and walking down the road for dinner.", "Ok… That said, some pros and cons:", "PROS:", "Great hotel, service, attentiveness from the staff, cleanliness, good variety of activities. Overall great value.", "GREAT, I mean GREAT spa service. We went for a couple service, which provides includes massages with Balinese creams, and the masseurs leave the two of you to enjoy in private the facilities, including a pool, a Jacuzzi and sauna. We did it on our last day, and I can say it was an excellent farewell activity…", "CONS (for some):", "The hotel receives a lot of company workshops. That means that while you’re with your topless wife sunbathing at the pool, some people in suits walk by to get to the restaurant. While for us it was not a problem (my wife do not go topless), we observed that some guest were somewhat bothered with this;", "Our room was at ground level, which means that our balcony was also an exit to the side yard. Although it rendered us a great view and nature ambience, it stole some of out privacy. We had to close the balcony doors completely, otherwise somebody could see we showering from the garden.", "Hope this helps!", "Best regards,", "Rogerio.\n", "\nThe hotel resort is eventough a bit older and dated well maintained. Staff are very friendly and are doing everything to make the guests happy. It's a classic \"pool and beach\"-resort where you can hang around the whole day or entertain yourself with the usual staff like ping-pong, beach-volley, jet-ski etc. Overall you get a fair value for the price.", "However, since the hotel still has the label as being one of the \"leading hotels of the world\", expectations need to be setted right:", "- compared to the other LDH i've been, it is clearly not a 5* top hotel. For this the whole facility is too dated, the food variance and sophistication is too little and just many view little things. Don't get me wrong, it is still on a very fair and good level, but when claiming being on of the best, this critic is apropriate", "Plus: Nusa Dua is like an island to the rest of Bali. Everything is 3 times more expensive. But you can simply avoid this by renting a motor-bike and exploring the sourundings on your own.\n", "\nThis was a great way to spend a week of our honeymoon. We stayed in the Palace club and they made us feel very special. The room was lovely with lots of Balinese furniture including a wonderful carved wooden door to the lovely bathroom. The Palace Club gave us free soft drinks, afternoon tea and canapes and cocktails so was well worth the upgrade. We loved this place and Bali in general.\n", "\nWe spent 10 nights at this hotel to celebrate our Silver Wedding. We had booked a Palace Club room but on arrival were upgraded to a suite. The room was excellent, with a double sized balcony overlooking the gardens, sitting area, very comfortable bed, 2 TVs, bathroom and additional separate toilet. ", "It is definitely worth paying the extra for a Palace Club room. The breakfast is very good, buffet style but with eggs, pancakes etc cooked to order. Afternoon tea consists of sandwiches, cream scones,cakes and pastries. Evening cocktails are also included along with a selection of nibbles. Free internet access plus non alcoholic drinks anytime. The staff in the Palace Club lounge are wonderful - very friendly and helpful. They were able to advise on local restaurants, outside the hotel and made reservations for us.", "The Spa is lovely, treatments very relaxing. We found the pool area here much quieter than the main pool and sunbeds were always available. Glass bottom boats and snorkelling are available from the beach, which was white sand and very clean.", "The food in the hotel is good, and not unreasonably priced compared to Uk. The Ramayana dance and buffet evening is good value and in a spectacular setting. Certainly better than the Barong show included in some excursions. Themed buffet dinners are available most nights or the pizza restaurant is good for a cheaper, more casual dinner. There are other restaurants in the nearby village and also in Jimbaran which provide transport to and from the hotel. The Pavillion is fairly new and food and service were excellent and cheap, especially local dishes. The Bali Collection is also within walking distance of the hotel ,although free transport is provided there too. There is a supermarket, local craft market and a variety of restaurants as well as the usual designer type outlets.", "We booked an island tour with the hotel Tours desk which was in a private car just for the two of us with a driver and guide. It was an excellent tour, very informative and good value. You can get cheaper prices outside the hotel but these often do not include the entrance fees or a guide and the driver will try to take you to places where they get commission. We did find that some tourist attractions had lots of traders and some were quite persistent. ", "Watch out for the porters at the airport. They are quite pushy and take you straight to the money changer to get cash for their tip!", "Altogether a very relaxing holiday, excellent accommodation, good food and superb service. We would definitely recommend this hotel and would go back tomorrow!\n", "\nWe stayed here as part of our honeymoon for 10 nights. We stayed in the Palace Club which we could certainly recommend. The staff in the Palace Club were excellent and certainly made our honeymoon.", "The rooms are clean and comfortable are in a traditonal Balinese style.", "We enjoyed our stay here but one thing we did find was that we became a little bored as for us there was not a lot of evening entertainment. We ventured on an evening to other hotels along the strip but found that the same entertainment seemed to be on in most hotels.", "We found the food to be really good and enjoyed all the restaurants in the hotel.", "If you want total relaxation then this is the hotel for you.\n", "\nThe Nusa Dua Beach hotel depends on what you want. Flying half the way round the world to spend 2 weeks with lots of posing silicone enhanced sunbathers in what is really nothing more than a disneyworld of a hotel is not for me, but our travel agent sold it to us as part of a larger package", "I just found myself asking - whats the point. Apart from the admittedly impressive entrance designed in a balinese temple style this could have been anywhere in the world. The restaurants in the hotel complex for example were - a pizzeria, a Sushi Bar, A pool bar doing burgers and chips etc - and were all mediocre at best.", "Your bit of The beach isn't great (youre not allowed on any other hotels bit, see!) and i felt quite bad at the fact that there were teams of security guards in combat trousers with handguns walking around what what supposed to be a relaxing hotel. ", "The only locals allowed within 100 yards of tourists are forced to wear numbered shirts so the aforementioned security guards can keep tracks on them - we dont want the people who live in Bali to interrupt the nice tourists now do we!", "All in all its depressingly sanitised. Probably great if you have kids or just enjoy sunbathing, but it seems a waste to go all the way to Bali to stay somewhere like this.\n", "\nWe stayed in Nusa Dua Beach Hotel for 9 days in September 2007. On the whole, it was an excellent hotel with plenty to do from tennis to squash to volleyball etc. One point of warning, the rooms in the hotel are quite dated and in need of renovation. They aren't really 4.5 star standard. The staff however are world class and are so welcoming and friendly. The Chess bar is a lovely place to sit and watch the world go by. The beach sports facilities were not free, which was disappointing. The breakfasts were excellent with hug choice. The first room we were given was extremely noisy (interconnecting doors) as we could hear clearly the room next door. Upon complaining, however we were moved to a much quieter and bigger room. Food and drink is quite pricey in the hotel. If you do stay here, make sure to go to Tropical and Bumbu Bali restaurants, which are located outside of the hotel complexes. These restaurants collect you and drop you home. Tropical in particular was excellent value with lovely food. Bumbu Bali is amazing. In summary, the hotel is very large with great staff and a nice beach. The sports facilities were always available and not busy, which was great. The spa is also fantastic although expensive. some great views but way over priced.\n", "\nThe hotel was quite big with traditional architecture and ornaments which are cool. The room is nice and clean but nuthing so stunning. The crew were ok but perhaps cos its a big hotel then they were too busy to get along with guest. But breakfast menus were boring and not that tasty. Since the hotel is quite far from city center and shopping center, I was quite often had a lunch and dinner in the resto but its again, not that yummi and quite expensive.", "Swimming pool was large and always so many people there but for alternative we can go to the beach for kayaking, snorkling or any other beach activities, but (again) its quite expensive. The last option will be laying down on the beach there.", "Its good place to relax after busy week and good place for honey moon couple who prefer to stay in serene place without any amusement night (cos its too far to go! and family with kids.", "\n", "\nWe stayed in deluxe room at Nusa Dua Beach for 11 Nights 8-19 Aug. It is a nice hotel (and probably nicer than most in Nusa Dua), but I don't believe very good value. Prices for spa, meals and drinks etc are expensive. Even snorkles etc have to be hired too.", "The hotel felt crowded and there was an early morning race to try and get a sunbed (many failed as not enough).", "It is a shame that you DO NOT get extra little touches like: flowers in room, chocolate on pillow or fruit by pool (unless you pay of course). I believe \"Palace Club\" do get extra flourishes, but why not everyone? It surely would cost little, but in general think they would rather make the extra money from their guests.", "Our room was slightly on the small side and noisy.", "Pools were fine (although busy) and beach ok. Gardens good.", "There are many places to eat within walking distance for 1/4 price of hotel. Kendi Kuning 600m left up the beach past Club Med is good.", "Bali Romantic (081338507291) do a good day long private tour incl lunch for only $25 US per person.", "Don't pay more than $15 US for taxi to Hotel from Airport.", "Weather was good, hot and sunny during the day with welcome breeze and occassional rain at night.", "Consider staying a few days at Kajane Mua Villas in UBUD which excellent. You get your own Villa with small pool in lush garden setting with extras you don't get at Nusa Dua Beach Hotel for $200 per night and much much better value spa ($25 US for 2 hours), food and drinks etc. Only downside was wetter.", "\n", "\nWe went to bali after a fab 2 night stay in Singapore which we loved (didn't actually want to leave!).", "We stayed at this hotel for 9 nights. On arrival we were taken into the palace club to check in where we were given a drink. The exerience was very calm and personal. We were then taken to our room (Batur Suite). Towards the end of our stay we found out the we had been upgraded twice! ", "The food was lovely, with a never ending range of fresh fruit juices. It's definately worth paying a bit extra to have palace club access if you're staying here for a special occasion. We had free cocktails every night. I went for the champagne ones!", "My new hubby would have liked a beach where you could swim properly - the water is very shallow, take a pair of water shoes and you can explore the shallows. We also found that you have to get up REALLY early to reserve a sunbed, many are already taken by 7.30am!", "A short walk to Bali Collection or outside the main gates and the food is dirt cheap but still with fantastic service. ", "A great hotel if you want to relax and get away from it all.", "\n", "\nMy wife (still not used to saying that!) and I stayed at this hotel for just over a week a few weeks ago as part of our honeymoon.", "Having read all of the reviews on this website before we left, I was slightly worried that the hotel may not live up to our expectations. However, I'm pleased to say that we had a fantastic time and the hotel was lovely.", "The entrance to the hotel is spectacular and makes a great first impression when you first arrive. We stayed in one of the Palace Club rooms, which was furnished in traditional Balinese style and had everything we needed, including doors out onto a patio area which looked out over the impressive gardens.", "We definitely felt the benefit of the Palace Club, and took advantage of the excellent breakfast in the Club Lounge every morning, as well as the complimentary cocktails and nibbles every evening. We would definitely recommend the upgrade if you can stretch to it.", "The staff all over the hotel were unfailingly polite, and all spoke good English, so we had aboslutely no problems on that front. In terms of facilities, there are 5 restaurants in which you can eat lunch or dinner, and although more they are pricier than restaurants outside the hotel complex, we didn't find the prices particularly expensive - perhaps that's because we're used to London prices - but we never paid more than £30-40 for a 2 course dinner for two with wine/beer. If you do decide to venture out of the hotel for dinner, head to the Tropical in Nusa Dua, at which the food was tasty and very reasonable. ", "The two pools on the complex are not huge considering the number of rooms, but as the hotel seemed to be no more than 2/3 full whilst we were there we never found this a problem. Having said that, a top tip is to go and find the Lap Pool over next to the Spa, which was almost empty compared to the main pool. It's not big but is perfect for a cooling dip after sunning yourself. The beach was fine but narrow (and literally 10 seconds from the pools), contrary to some other reviews I've read, although we stayed on the loungers near the pool most of the time as there was more shade. ", "There are various cultural performances put on at the open air theatre in the middle of the grounds, and I would recommend that you see at least one as they are a great way to take in some traditional Balinese culture.", "In terms of the location of the hotel, yes it is situated in a very sanitised complex which is very secure - you go through one checkpoint just to get into the Nusa Dua area and then another one to get into the hotel - but there is plenty of opportunity to book day trips out to other parts of the island if you want to experience the 'real' Bali. ", "Overall, we would defintely recommend this hotel. If you are after a very comfortable, relaxing hotel, and are looking forward to spending the majority of your time chilling out rather than sightseeing, stay at the Nusa Dua Beach Hotel. We would love to go back one day...", "\n", "\nARAL fammily istanbul Turkey", "we spent our honeymoon at this lovely hotel.From the moment our cab get close to the hotel we both siad o h my god...its like alice in wonderland...amazing entrance ,,,cool loby..good service ...rooms are clean and fresh..but our favorite was the breakfast...beach and pool was also great.Esp. i like to thank Yasa..kind guide for our diving experince.he is a pro.and he had to work hard to pull me inside the boat:)))..and the prices were affordable.we really mean it.if you planning to go bali.this is the right spot", "unforgetable honeymoon.we will come back again.", "\n", "\nMy husband and I stayed at this wonderful hotel for 8 nights, we upgraded to the Palace Club which we highly recommend doing, the service was excellent and the staff could not do enough for you, the room was marvelious, the grounds wonderful, squirrels, roam free and are lovely to watch. the only downside is that you have to get to the beach or pool early to reserve a beach/pool bed so I do think that they need to look into getting a few more but that is just a small niggle, About 10 mins walk from the hotel is the Bali Collection a shopping complex with some nice shopping and lovely restaurants that are very cheap to eat in and the food is great, this is all to cater for the tourist so you do need to get out of your hotel and see the proper Bali, i can recommend the mountain bike trip 2 hours downhill so hardly any peddeling and you go through the bali villages and see the children, schools, paddi fields and end at the elephant sanctury this is a wonderful day. All in all a very nice holiday in a lovely hotel", "\n", "\nI don't know why people are writing bad reviews of this hotel?", "I have stayed at this property at least half a dozen times ( in", "all different room categories) and have no complaints! I have stayed over a period of years, and have found the hotel to be well ", "kept and maintained perfectly. It is not looking old and does not need updating. The rooms are all spacious and well appointed.", "The Palace Club is well worth the upgrade and the satff are", "divine. They all speak English and cannot do enough for you.", "From reception to management I cannot praise the hotel enough.", "The pool area has been renovated in the last 3 years and the beach is clean and not a lot of hawkers ( expected in this part of the world though....) I highly recommend staying here, and yes the food may bit a bit $$$ than being in Kuta, but that;s the choice you make either stay in a 5 star hotel and don't whinge or go", "back to Kuta and eat in the cheaper restaurants or off the street.", "Happy for anyone to contact me with any queries...", "\n", "\nWe have just back from this piece of paradise and we are already missing it. Everything we found there was amazing but, most of all, the unforgettable atmosphere, with tropical flowers and trees everywhere, amazing rooms, fantastically decorated with wood all over and musicians playing the local instruments during breakfast time: a real paradise on earth. We actually recommend this place and do not miss the SPA, is something difficult to find elsewhere! We will never forget this place.", "\n", "\nTravelled to Bali in June 2007 with my boyfriend + friends of us (a family with 2 children aged 8+14years)", "I actually stayed of couple of nights at Nusa Dua Beach Hotel&Spa already 7 or 8years ago but not on holidays..", "After 6 nights at Bali Hyatt, Sanur we moved to Nusa Dua Beach Hotel.", "Everything about the hotel met my expectations. Me &my boyfriend stayed in a deluxe room and our friends stayed in a superior room for 4. The hotel was nice enough to give us rooms with pool&seaview. If You´re just looking for a room for 2 people it is definitely worth the pricedifference to stay in deluxe instead of superiorroom. The bathroom of the deluxeroom is so much better - both shower and tub and open shutters so You get a view of bedroom and even a bit beyond. Beach is very nice but again seaweed in water makes swimming a bit difficult. The 2 pools are very nice. The table tennis and snooker table was much appreciated by everyone in our company. Brekafast was plentiful. Apart from breakfast the only meal we had at hotel was one lunch- pizza and it was OK but too expensive! Service was good as expected at 5star hotel BUT not more - I did not feel the same \"personal touch\" as I did at Bali Hyatt. ", "Our friends and especially the children however liked it more at Nusa Dua - more things happening around the hotel area!", "If You do not want to have all Your meals at the hotel there are some restauarants( and also shops) right outside the gate into Nusa Dua area, it takes about 10minutes to walk (and if You do not want to walk all restaurants have transportation)", "\n", "\nI with a friend went to Nusa Dua for a nice relaxing break. Which i have to say we had but i was totally disappointed in the lack of professionalism within the food and beverage departments within the hotel. ", "I stayed there for 9 nights and on their defence maybe my expectations were too high. The quality of the food all over the hotel was way below average for a leading hotel of the world status.", "The service was very poor and as for the english language skills well", "as far as i was concerned they were terrible apart from a couple of bar staff. ", "The cost of everything in the hotel is exceptionally high compared to the small restaurants just outside the hotel grounds and to be honest their service and food standards were much higher and friendlier. Some of the male memebers of staff could be taught a bit about personel hygiene as it could be quite offensive on the hotter days.", "We checked into the palace rooms and on the 7 occasions we went for breakfast our order was wrong. A couple of times i can understand but", "7 morning in a row is a bit passed it. When i am eating i dont expect", "to be covered in ants each morning either and yes i know it is an outside area but there are ways to prevent this from happening. On a plus side for the hotel i have to say the landscaping was beautiful and really made the hotel for me. The rooms could do with a bit of a touch up but all in all they were comfortable and spacious not that you spend much time in it.", "We did have a lovely holiday just a shame about the operational/f&b of the hotel.\n", "\nWe stayed at this hotel for 5 very relaxing days. The pools and the beach were great. Our room was spacious (standard room), and it was cleaned twice a day. The best point of this hotel was the food (I didn't expect such quality and variety) and the service.", "\n", "\nWe have just returned from staying at the Nusa Dua and although our experience ultimately turned out to be a good one, there were some problems. To be frank, this does not seem worthy of it's Leading Hotel status; it's some boast to be voted Best Hotel in Asia in 1997 and I think the reputation has diminished somewhat. The property is shabby and does not have the \"wow\" factor present in other hotels. Language is the major problem here because although the staff speak English, general communication including trying to resolve difficulties or ask for anything out of the ordinary is terribly frustrating. At Palace Club level the general choice of food was fine but somewhat disappointing at cocktail hour. Our suite was good though and the senior staff did listen to our qualms and must be credited highly on acting upon them and providing us with a series of \"treats\" which were delightfully unexpected. We understand renovation works are planned for the future and look forward to returning in order to report on the progress!!!!", "\n", "\nThis was my fourth visit to Bali, fourth time staying at Nusa Dua but first stay at Nusa Dua Beach Hotel. To address some other reviewers comments, yes, Nusa Dua is a purpose built resort enclave that doesn't really give you a taste of the real Bali (although a walk through Tanjung Benoa or Bualu village will help in this respect). If you are not aware of this fact before you visit Bali, I would be criticising your travel agent, not the hotel. The thing that I like about Nusa Dua is it allows you stay in a location away from the hustle, bustle and touting that is Kuta and (to an extent) Sanur. Yet, being such a small island, nowhere is far from Nusa Dua, so day tours to pretty much anywhere on the island are possible (although a week in Nusa Dua and a week in Ubud would allow you to see and experience more). As for the hotel, there is not much else to say other than perfect. Sure, food is expensive, but you expect that at such a hotel. Most restaurants in Tanjung Benoa and Bualu offer free transport to hotels, so there is a pretty good range of places to eat away from the hotel (recommend Bumbu Bali, Jalan Pratama, Tanjung Benoa). Room was nicely furnished and cleaned well, recreational facilities and activitiies were great and the Kecak dance and buffet dinner on the beach (Sunday evenings) is highly recommended.", "\n", "\nDuring my stay in Bali, I spent 5 nights at Nusa Dua and several nights at other hotels in Bali. The Nusa Dua was a nice hotel...both the room and the beach. However, the hotel did not even compare to the more traditional hotels where I stayed, including Tandjung Sari in Sanur. One could spend a week at Nusa Dua and have no idea what Bali is really like. In fact, this hotel could be in Mexico or anywhere else there is a beach. ", "The hotel is located on a peninsula with several other major resorts (many of which appeared to be nicer). This area seems to have been created solely for tourists. It is not located near anything in particular but an outdoor shopping mall, which only tourists appear to frequent. One needs to take a taxi ride (about 12 bucks or so) to get to the other areas like Kuta or Seminyak. More more Ubud or Sanur.", "The food at the resort was below average and overpriced. The service was frequently bad. Other services such as internet and laundry were fine, but again, overpriced. I made a couple of short local calls that ended up being very expensive.", "Overall, the room and hotel grounds are nice, but I did not go to Bali to stay at a hotel that could have been anywhere. You may enjoy swimming in the pool and sitting by the beach, but know that you will not experience Bali.", "\n", "\nStrongly recommend this resort which is the only one in Balinese style there. No need in looking for something better! Everything is perfect! Would definitely visit again.", "\n", "\nI travel the world for business and usually stay in five star properties. This hotel ranks as one of the finest hotels I have visited. Of all of the superlatives, what sets it apart is the quality of the service. The staff and management are attentive to your every need, always anticipating your requests. Yet, they are not aggressive or intrusive, giving the guests an atmosphere of absolute calm. The staff and management are clearly sincere and friendly in their individual and collective desire to serve the guests. The food was fabulous for this nine day visit. The chefs and the kitchen are skilled in the cuisines of Asia and Europe and each day provided exceptional dishes. The desserts were outstanding. For those travelers concerned with digestive problems, the offerings including the salads were all safe! The property is a welcomed departure from the usual five star resort, reflecting the indigenous culture of the Balinese people. My room was decorated in fine carved wood, and while it had all of the modern conveniences, was well grounded in the local culture. The property is beautifully situated on the beach. Visit the Spa and try the Balinese massage for relief from a long airplane trip.", "\n", "\nWe arranged a trip taking in Singapore, Malaysia; Bali was our chance for a rest. We had an excellent hotel in Malaysia and were a bit concerned that the Nusa Dua might be an anti-climax. We are pleased to report that it was not. We opted for a Palace Room, and the all-day Tea & Coffee, afternoon tea and evening cocktails were excellent. Generally we seemed to have two or three people looking after us when we were in the Palace Lounge (where meals and refreshments are served).", "Room was excellent and comfortable, effective air conditioning and well maintained. They had a very good stock of DVDs, which we made some use of. My advice to anyone staying in The Nusa Dua would to try and get a room above the ground floor. We had no problems, but sitting on the patio outside your room, it feels a bit public. Would have no hesitation in returning to this hotel and would happily recommend to friends.", "\n", "\nDriver was waiting to pick us up at the airport (offered as part of the additional benefits package), which was a great start to the 7 night stay. Breakfast, Afternoon Tea and evening Cocktails with Appetisers are a real treat and quite sufficient to keep you going throughout the day, if you wish. Staff at the Palace Club were all brilliant, couldn't have been more friendly and helpful. The Hotel in general was beautiful, well maintained and laid out, but the service was not as impressive as in the Club. Our room was clean, traditionally furnished (incorporating Balinese wood carvings) and offered all the facilities you would expect in a 4.5 star Hotel. There was a slight musty smell when you first opened the door to the room, but then it quickly dissapated. It certainly wasn't something to get upset about. We will definitely be returning and probably book a one bedroom suite next time.", "\n", "\nWe recently spent 2 nights at this hotel (Feb07) and we loved every minute of it. We’d spent 4 nights in Jimbaran Bay in a 3 star, so walking into this hotel was like walking into a palace! From the minute we arrived we felt very well looked after – the staff are outstanding, the hotel was breathtaking and the rooms were so well appointed… no wonder this is part of the leading hotels chain.", "The pool was the best we’d seen in Bali (we also spent a night next door at the Westin and hated it! Even though it was free!) and in fact there was a choice of two pools.", "There were about 5 restaurants to choose from, but the breakfast was the best spread I’ve ever seen! From Japanese style, to local style, to English eggs on toast, to donuts and waffles with maple syrup – there was something for everyone and in fact they even had good coffee!!!", "The complex is large and we were a long way from the main pool area, but still the room was perfect, the view over the gardens was lush and we even had squirrels to watch! ", "The staff were helpful and there is a free shuttle service to a local shopping mall many times a day.", "I can’t recommend this hotel enough – we felt like we were in a top resort and were very well looked after. The only complaint is that the beach was very unpleasant…. Dark gritty sand, dirty warm water and there were warnings about jellyfish & sea urchins. I can’t wait to get back here!", "\n", "\nFor Chinese New Year we decided to go to Bali and celebrate my husband's birthday. We were a family of 4 with 2 teenagers 14 & 17. The hotel is beautiful. Our rooms were on the Palace Club side but we did not opt for the palace club upgrade. I recommend the lower level with your own stone patio walking right out to the gardens of the hotel. The pools were so nice and never felt noisy or crowded. Like I said, we were there for CNY, but never had a problem with resturants, spa or beach loungers. The staff is wonderful and food quite tasty. I booked the pool bale for just the 2 of us for a birthday celebration. It was so romantic and fantastic, including champagne! They closed the pool for our meal and we were surrounded by candles and flowers. It was definitely a highlight of our trip. The beach is not so great, we are beach lovers, with sea grasses you have to walk through to get to clearer waters. But in them we found sea urchins, star fish and all sorts of critters. We did the Uluwatu temple, but i would not go at sunset. We went around 5ish and noticed great crowds coming around 6. It would have been impossible to take the pictures we did with a crowd. We did a local dinner one night at Sharkeys that was very fun and great food you pick out of the aquarium and is cooked for you. You are sitting in plastic chairs on the sand so no heels, but like I said, very local with vendors coming around selling wares to all the tourists eating. I would absolutely go back and stay at this hotel.", "\n", "\nWe have just returned from a 16 day stay in this resort. We were greated with the flare of a 5 star hotel. We booked the Palace suite with the Club advantages which are a blast and well worth it. The services is without compare. The staff is friendly, courteous, generous and humble. The food offered in the Club was excellent. The happy hour (6-8) is best described as a social adjustment hour; excellent in every way. This place is not dated as some reviews indicated, it is always being updated. The Spa would best be described as Balinese and is worthy of the treatments. The lap pool, spa facilities are very nice. The room is very clean, fresh sheets every day, towels twice a day if you want, free water, ice if needed and supper delivered to the room if so desired. The beach, lounges, lagoon pool and grassed lounging areas are all excellent. It is evident that the administration is working very hard to make each and everyone comfortable and contented. The food in the restaurants varies from pick-up to the best of dining in all of Nusa Dua. I would recommend this hotel to any of my friends.", "\n", "\nI am from HK so actually don't think the balinese style in the hotel is not such balinese...e.g. the lake beside the restuaurant with breadfast, it really decorate in a chinese style indeed.", "The top of all the house in bali is like the style in ancient chinese.", "The Bali ppl are very polite and nice, the beach near hotel is clean and good view.", "Overall, bali is a good place to have a relaxing vocation, except the high living standard.", "\n", "\nI stayed here for 7 nights with my family (4 adults) in February and found the hotel the perfect place to unwind in the sun! The staff are all super friendly and helpful and the hotel backs onto a fantastic stretch of beach. The rooms are clean and comfortable and our superior rooms had a balcony which overlooked the gardens and ocean. ", "Breakfast in the main restaurant is delicious and plentiful. We mainly ate in the hotel and there are a number of restaurants including a lovely outdoor pizzeria by the main pool. There is also another poolside bar and restaurant which serves drinks and lunch by your lounger!", "We mainly stayed at the hotel taking advantage of its excellent spa but would recommend a BaliHai trip to watch the dolphins playing in the ocean. Word of warning though - don't eat breakfast as the boat is a fast inflatable and can be a bit choppy!", "Other amenities in the hotel include a money changer, tour organiser and a small variety of shops. The hotel also invites local traders to set up stalls in the hotel grounds in the evening which gives a market feel.", "We visited in the rainy season (although it barely rained) and there were a fair few mosquitoes in the evening so take some insect repellent.", "Overall would definitely visit again and recommend this hotel to anyone.", "\n", "\nNusa Dua Beach Hotel and Spa is a fantastic accomodation and has everything you would want for a relaxing holiday. The hotel has outstanding restaurants, a nice theater and very friendly staff.", "We were there for 10 days and really loved it. I am sure we will go back within a couple of years. ", "We would definitely recommend to book the Palace Club room, it is more than worth your money! The complimentary afternoon tea, cocktail hour, great breakfast in the Palace club garden and excellent service are just a couple of reasons. ", "Also, we did not find the hotel, room or pool dated at all, like some other people wrote in their Tripadvisor review. Maybe all the renovations mentioned are completed by now?", "If you are looking to take a trip around Bali, we would strongly recommend our driver, Mr. Sutama (wayandriver at yahoo.com), which gave us a wonderful tour tailored to our preferences at a competitive price.", "We're already looking forward to our next trip, and are sure we would prefer Nusa Dua Beach Hotel and Spa above the many American hotel chains.", "\n", "\nNusa Dua is the best example of the balinese hospitatlity the staff, food, spa,bars,landscaping,Restaurants & especially the evening market which they set up everything is simply amazing. They just have to do one small change & that is to their pool which looks slightly outdated. Otherwise it is one fantastic hotel with best value for money.", "\n", "\nThe NBH is an excellent hotel in balinese style. We had a superior room, which was nice and spacious enough. It had a very good kingsize bed and a nice balcony. The pools are great and so is the garden. We loved the spa pool. It was very peaceful there and very quiet. Breakfast was excellent. Although the restaurants are a bit expensive, the food is great. Overall just a great place to stay!", "\n", "\nIm a travel agent and this is where is stay every time i go to Bali, This hotel is one of the leading hotels of the World. It beautiful i cannot fault it. All of the rooms are luxurious and clean. All have magnificant views either over the manicured gardens or the ocean. The hotel is right on the beach, The pool areas are very nice.", "\n", "\nSix friends booked via Tradewinds and stayed seven nights out of a three week far east holiday,", "Nusa Dua Beach Hotel & Spa was just esceptional. Book extra with the Palace Club and you wil have the time of your life.", "Service is exceptional, everyone is born here with a smile that is so sincere it rubs off on to everyone. The manager is from Dublin and Danny is a fine man with a superb sence of humour. He is also an active Rotarian and they meet weekly in the hotel!", "All in all a not to be missed place and we are so please to have made it part of our special tour.", "John, Lyn, Duncan, Jan, Kelvin and Organiser Jane, (Top job!)", "\n", "\nNusa Dua Beach Resort was simply amazing!", "The staff, the pool, the beach were completely wonderful..I would recommend this resort to singles, families or couples - it is accomodating for all. Taxi ride to kuta beach is a bit long but well worth staying at this amazing resort.", "\n", "\nWhat a great hotel! The staff were excellent and the room beautiful! I really recommend the in house restaurant! fantastic local baliense food.", "Pool area was lovey and direct access to the beach!", "\n", "\nAn excellent international class 5 star hotel with all the amenities you would expect. Nusa Dua is a secure enclave of luxury hotels well away from the real Bali, but the hotel facilities and service are of a very high standard. Prices to match.", "A great place, very relaxing, but you really could be anywhere tropical.", "\n", "\nthis is one of the best hotels i have stayed in the world. The hotel may not be completely to everyones taste but the rooms were traditonal and the customer service second to none. ", "If you come to Bali I would strongly suggest you see some of the local culture and temples which this island is famous for. We booked 3 day trips with the hotels driver- Mr Youdana, who is so patient and considerate especially if you are travelling with kids. He is affiliated to the hotel so he can be gooked through the nusa dua hotel.", "Overall I would definitely recommend this hotel .", "\n", "\nThis was my 7th visit to Bali, and my first honeymoon there! I've visited every hotel at Nusa Dua and some are fancier, more modern, newer, and more international than this one. But, you're going to Bali, aren't you? Some of the others could be Tokyo or some generic beach resort.", "This hotel is truly Balinese, especially in terms of the attentive staff with truly loving Balinese spirit. The landscape is fully grown in, and while not brand new, all hotel amenities and rooms are in good working order. You won't find stainless steel and glass moderne here. Traditional Balinese looks and style.", "We sprang for the extra charge (honeymoon, after all!) to be in the private club wing with concierge services, cocktail receptions, etc, and found it well worth the extra cost. ", "I have stayed in the main part of the hotel on previous visits and have always been consistently impressed. The daily included breakfast is just amazing. You won't need to eat until dinner, and will probably find yourself lingering a long time because of the ambience.\n", "\nAfter a not-so-warm welcome from Customs at the airport, we were a bit anxious and not sure what to expect from the Nusa Dua Beach Hotel. We needn't have worried - the staff were lovely, and our deluxe room, and the other amenities were all more than adequate.", "Breakfast choices were extensive, and the tables were overlooking ponds with fish and water lilies to look at as you dine!", "We had booked half board, and you can use any of the restaurants for dinner. We would particularly recommend Raja's for Balinese cuisine and excellent service. Also, the entertainment evenings in the Buddaya theatre on site were really good, with superb buffets set up, and beautifully decorated surroundings.", "While the spa looked good, we actually opted to use the Westin next door for a Balinese massage beach-side. The masseurs were lovely girls, and the whole experience of being outdoors, listening to the ocean and the palm trees in the breeze was fabulous.", "There are plenty of options for lying in the sun - round the pools, in the gardens, or on the beach - the choice is yours.", "I think all the hotels are still experiencing low levels of trade since the bombing in 2002. It's such a shame because the hotels all seem to be of a good standard, and the people are genuinely nice people. The resort is immaculately kept, the security guards ensure the environment feels safe, and the shopping centre is worth a visit too - the \"labels\" are amazing value. ", "I would recommend a trip inland to get a real feel for the island - we visited the lake at the volcano, and a spice plantation, and it was fabulous to see the rice terraces/ fields all over the countryside.", "We weren't sure what to expect of our visit - but this place really gets under your skin by the time you leave!", "\n", "\nWe spent 15 nights at the Nusa Dua Beach Hotel, and can recommend the hotel and facilities to anyone looking for a spotlessly clean hotel with extremely helpful staff.", "The hotel has a gorgeous location with pools and bars/restaurants overlooking a wonderful beach.", "We stayed for one week in a Superior room and one week in a Palace Club Room ... believe me - there is such a huge difference, and if you can, choose the Palace Club Room!!", "A huge Jaccussi bath in a modern luxerious bathroom with fantastic seperate walk in shower and seperate toilet. The bathroom can be seen from the bedroom if required by sliding open beautiful wooden doors and you can then watch the tv whilst relaxing in the foam bubbling bath!!! The bedroom is huge, and the bed enormous. Two lovely lemon upholstered armchairs compliment the decor, and a DVD player and Music system were also included. A beautiful fresh flower arrangement and bowl of fresh fruit are lovely touches when you first arrive into the room. The patio area has two comfortable sunloungers looking onto immaculate quiet gardens. ", "We had our breakfast in the Main open air Restaurant overlooking the shaped lilyponds, and the choice was overwhelming. It was a pleasure each morning being greeted by such friendly, helpful staff, and the food was of a high standard. Breakfast is served from 6.30am to 10.30am, and we visited the Restaurant varying times from 7am to 10.15am and each time the food was fresh and plentiful.", "If you're looking for a western style, ultra modern hotel, then it's not the Nusa Dua, but if you want Balinese culture, a quality service and a hotel offering excellent facilities - look no further.", "Some of the hotel areas do indicate the age of the hotel. ie. chess bar and restaurant look a bit tired and in need of updating, and the lagoon pool could also be freshened up, but these are minor observations of ours. You may not even notice them.", "Generally, the hotel is well maintained and indeed work to balconies and the Reception flooring was being undertaken whilst we were there.", "ALL the staff are helpful and exceptionally friendly..... you find yourself trying to learn some basic balinese greetings just to say thank you etc., although it's not necessary as most speak English.", "From the time you get out of your transport bringing you from the airport to the time you leave, you will receive a first class service from this hotel. We certainly can give our recommendation to anyone considering the Nusa Dua Beach ...... choose the Palace Club room .... you won't be dissappointed!", "\n", "\nWe stayed in Bali as the second leg of our honeymoon in June. Nusa Dua is a very strange resort, it is beautiful and impeccably clean, there are large ornamental gates to the resort which is essentially just several high quality hotels down a nice stretch of beach. I say strange because it is just so manicured it doesn't quite feel real. The roundabouts have huge sculptures and water features on them. ", " It feels incredibly secure as all cars must go through a security gate where they are opened and checked by several guards as they enter the resort and again a similar security check at the entrance to the Nusa Dua hotel. ", "The entrance to the hotel and lobby are impressive. We opted for the upgrade to the Palace wing which we would highly recommend. The rooms have large balconies which lead straight out to a beautiful garden with pond and fantastic trees and plants - a little slice of heaven when you wake up in the morning. The room was clean and large with lots of ornamental carving and wooded flooring it certainly felt luxurious. We were very well looked after at the palace club, a short walk across the garden - they tended to your every need and offer DVDS, internet access, all day drinks and butler services, breakfast, afternoon tea and evening cocktails and canapés all included in the room upgrade. ", "The rest of the hotel is nice - large but not too big. The beach is nice, though you can't swim in the sea. The pool area was OK but to be honest even with the supposedly low occupancy rates in Bali at the moment we never got chance to sit by it as the beds were always taken. There are plenty more on the beach however. We visited the chess bar for a meal and Raja's twice. Chess bar was fine but we would highly recommend Rajas where we were treated extremely well by the staff and the food was fab. ", "Overall we were very happy with this hotel, it was pretty, very clean and the staff couldn't do more for us. As far as the leading hotels of the world tag goes, I am not quite sure what this means and who awards it, but if you take it literally you may be disappointed, a discerning traveler, used to staying at the worlds finest, will probably find that this does not quite compare.", "We would recommend the hotel though would be unlikely to return to Nusa Dua. This is purely personal preference. As a rule we like to leave our hotel, go for a stroll and pop into a few bars/restaurants etc, there is very little around nusa dua at all and as the weather wasn't great when we were there we felt a bit bored, though it is cheap and easy to get taxis to jimbaran kuta etc and excursions to ubud etc are also cheap and you will get private tours and your own guides which is great. There are also lots of water sports available at Benoa just down the beach.", "\n", "\nThis was the first stop on our honeymoon trip (for 5 nights), this hotel is accredited in the 'best hotels in the world' programme and, having travelled extensively in recent years we can say with confidence it is exactly that! The room we had was huge, well furnished with a modern balianese feel, the bed was really comfortable and the balcony looked over the sea. ", "Nothing was too much trouble for the staff who were really friendly. I had always dreamed we would have a champagne breakfast on the beach during our honeymoon, but this is not something they normally do. They said it would be no problem though, and at 6am a feast of local fruits, cereals, breads and champagne was set on a table on the beach with a some fantastic displays of cerominal flowers and an arch way with our names on with 2 waiters to serve us. Amazing as I only asked the night before!", "A visit to the Spa is a must, we chose the Studio massage for two which seemed pricey at nearly £50 each but was the most relaxing experience in the world we each had a full body massage on beds next to each other with one masseusse each for 1 hour and gives you exclusive use of pool with floating frangiopani flowers, and a sauna, steam room and jacuzzi all in you own exclusive villa that is yours for 2 hours. Amazing....", "The hotel is well placed to make a day trip to Ubud - (a must for a Bali trip), sun set with Balianese dancing at a local cliff top temple (name escapes me!), and just a short walk from the fabulous Bumbai Bali cooking school run by Heinz von Holtzen, classes from £60 each for a full day including a market tour in the morning to collect the produce - very entertaining. Off the beach is also some reasonable coral to explore, well priced beach massage and water sports available too. All beach sellers are licensed and you will get none of the hassle you may experience at Kuta beach. A great place for relaxation, honeymoons, weddings and all.", "\n", "\nMy husband and i stayed here for five night on our honeymoon and couldn't have had a better time.", "The staff were amazing and we made great friends with Astawa at the pool bar who ended up taking us on a tour of Bali for FREE!! Everyone always said hello when you walked past with a big smile on their face which was so nice to see.", "We used the spa and had a joint scrub and massage treatment which i have to say was just awesome, my husband still can't stop talking about how good it was. We also had a massage in a hut looking out at the ocean which was bliss.", "We just absolutely loved the food, the people and the place and couldn't recommend a better resort especially for such a great price.", "\n", "\nMy boyfriend and I stayed in August 2005 for 6 nights. This hotel is fine if you are happy staying in a huge resort that could be anywhere in the world. The gardens and sculptures are beautiful, and your first impression of the lobby is beautiful.. then you get to the rooms. They are very dated and shabby, should have been upgraded years ago. The drains were smelly and noisy. Could hear the neighbours talking.", "We were made to wait 45 minutes before our room was available, and it was not at all what we wanted or expected, it was tiny and above the main driveway, we were upgraded when we told them it was not what we wanted, the upgraded room was better, but only just! The walkways to rooms always had room service trays outside the doors.", "The beach was pretty, but not really swimmable. The pool was beautiful, but we had to get there at 7am to make sure we got a lounge! Some lounges were left empty (but reserved with towels) for the majority of the day so people just came down and used them at their leisure. This is unfair, and something the hotel should stop.", "The breakfast was great, and the staff were very friendly. The pool bar was also great, and the bartender very friendly.", "We ate there once (room service) as it seemed very overpriced. We caught taxis into Kuta every day to eat / shop (don't do it in Nusa Dua), then went on to stay in Ubud.", "One memory of the hotel that I really enjoy is us watching the squirrels in the early morning and afternoon, they were great!", "Overall we were pretty disappointed with the experience, though we had a nice time, we would steer clear of this hotel again.", "\n", "\nMy husband and I stayed here for our honeymoon for 7 nights and it was wonderful. We wanted to be spoiled and we were. The hotel resort was very big with a variety of restuarants and bars, and if you didn't want to go to any of them there was regular entertainment in the evening. We went to two shows, both were Balinese dance shows where the buffet meals were brilliant. We definately reccomend the show on the beach. ", "The staff were all very friendly and helpful. They all seemed as if they couldn't do enough for you. Always asking if you are ok etc. We had problems with the light in our room, we called reception and it was fixed within 15 minutes.", "We used the spa facilities and booked a joint honeymoon treatment. This was very luxurious, you felt completely relaxed and pampered. Language was a slight problem here but it didn't seem to matter.", "The pool area was always busy but never felt busy. There were always sun loungers free and it was very spacious. The beach was nice to but not for swimmers, be careful of the seas urchins. Nice for a stroll.", "The room was big, clean, very comfortable but similar to many hotel rooms we had stayed in.", "Overall a wonderful place. Lovely gardens everywhere. You did feel as if you were in some sort of paradise. We definately reccomend this hotel.", "\n", "\nMy husband and I stayed at the NDB Hotel and Spa for 5 nights in March 2006. We had purchased a package through Asian Affair Holidays - an incredible deal. We enjoyed our stay here. The grounds are beautiful, but dated. The monuments and decorations are incredible. However, I wish they would update the walkways, corridors, and rooms. Overall, this hotel is beautiful and clean and more Balinese, but not luxurious or modern.", "The morning was my favorite time of day at the hotel. We would wake up to birds chirping. For breakfast, we would sit by the pond and watch the birds and fish while we ate nasi and mee goreng. Then we would walk on the walkway which extends along the beach. This walkway connects almost all of the Nusa Dua area hotels. ", "We did not eat any other meals at the hotel, because we either went to Ubud during the day, or to Jimbaran beach for seafood, or to the village outside of the Nusa Dua gates (Ulam seafood restaurant was nice.) ", "There are so many hotels along Nusa Dua Beach. The Westin was next door. This hotel is more modern. I preferred the NDB Hotel because of a more traditional feel. We also explored the Hyatt which seemed even more manufactured. These hotels could be at any beach (from Hawaii to Phuket), but at least with the NDB Hotel, you knew you were in Bali. ", "We spent the rest of our vacation at the Ritz in Jimbaran. Overall, I enjoyed this facility much more, but of course it was much more expensive. For a couple, looking for a romantic beach vacation, Jimbaran or Legian are nicer. ", "The Nusa Dua Beach area was completely manufactured and isolated for tourists, so if you want western conviences (there is even a Starbucks in walking distance at the Bali Collection) and safety this is the place. ", "I hope more tourists come back to Bali. It is really amazing. I felt very safe the entire time!\n", "\nMy boyfriend and I had a wonderful time here in March 2005. We booked this as part of a package and were very impressed! The lobby is lovely, the beach is clean, the pool is pretty. Staff was very welcoming and accomdating. Don't hesitate to book this hotel!", "The spa is lovely, though no bargain. My massage therapist was wonderful - a worthy splurge.", "\n", "\nWe stayed here in April for our honeymoon after getting married at a villa elsewhere in Bali. We chose it as our honeymoon hotel based on reviews and star ratings in brochures, and to be honest we were quite disappointed. We had stayed at the Bali Mandira and the Bali Hilton prior to the wedding, and preferred both of the those to the NDBH. The rooms are quite small, particularly compared to the Hilton, the beach wasn't that great, the pools were cold, the lobby not that spectacular. On the plus side, the buffet breakfast was terrific, but not all that different to the others. Considering that both the Hilton and the Mandira were cheaper, we felt really let down, having spent more money on what we thought would be the better hotel for our honeymoon.", "\n", "\nAlso based on several reviews on this site we had high expectations. However, we were disappointed. We booked a Suite at their Palace Club. This room, though spacious, had obviously not been used for quite some time; it just not smelled fresh.", "After having spend wonderfull days in two fabulous boutique hotels (Alila) this hotel was just too big for us. 480 rooms and in fact just one main pool with the size of a somewhat larger bathtub. It was not clean either. If the hotel were to be fully booked, one would have to run 'the German way' each morning to get a spot beside the pool. One towel per guest can be considered somewhat poor for \"one of the Leading hotels of the world\". Restaurants were OK but again not that special. Furthermore it was quite obvious that the hotel works with numerous travelagencies who seem to be offering last minutes as well, which was reflected by the general standing of the guests.", "However, the setting and gardens looked great and the Palace Club offers nice drinks and snacks. Can be a fairly nice hotel if you plan to travel with your kids.", "But, if you can spend a little, and are keen on visiting this touristic part of Bali, one could recommand other hotels in the neighbourhood, such as f.e. the (fabulous) Four Seasons.", "\n", "\nWe stayed here for our honeymoon for over 2 weeks. We loved the hotel and the staff couldn't do enough for us. The hotel has great character and is not what you would call truly modern but that added to the charm of the place. You felt like you were in Bali and not anywhere in the world which some of the other hotels seemed to appear as. The rooms are very well equipped and comfortable. The Palace Club is worth the extra money which includes afternoon tea with sandwiches, cakes and then cocktails in the evening with hors d'oeuvres. The staff there all speak English perfectly and there is entertainment most evenings. There are a variety of restaurants so you can choose what you want from Pizza through to 5* cuisine. The grounds and the Spa are beautiful. We would thoroughly recommend this hotel for a relaxing and self-indulgent holiday. We came back very relaxed. Again, we were bowled over by how charming, efficient and friendly the staff were. It is well worth a holiday.", "\n", "\nWe have just returned from 9 nights at the Nusa Dua Beach Hotel and could not recommend it highly enough. The resort is beautifully maintained and the pools were stunning. Excellent beachfront location and we were not hounded by hawkers. So many watersport options available at a great price and a breakfast buffet to remember !! The staff were so friendly and genuine. We travelled with our two sons 9 and 7. The Gecko club was perfect for the 7 yr old but did not hold heaps of interest for the 9 yr old. We have suggested to the Hotel that they look at ways of catering to slightly older children as well. We are going back in Sept 06 and are counting the days.", "\n", "\nFirst, the good things :", "1) as my wife and I celebrated our 1st Anniversary in Bali, the hotel granted us an upgrade for a Deluxe Room instead of the Superior we paid for. So, as for the room, nothing to tell except this is not quite a “Leading hotels of the world”-style room, compared to the other hotels where we stayed all around the world, with some of them members of this label.", "2) The Spa is honestly really good.", "But for the rest, what a disappointment!", "1) Barely half of the staff speak English which is weird for a leading hotel though,", "2) Restaurants… Well, freshly squeezed orange juice directly from the freezer, meat loaf from the microwave oven, outrageously high price compared to the quality offered, welcome at the Nusa Dua Beach Hotel & Spa,", "3) Beach? No, one-meter sandy path!", "So, please if you come to Bali, avoid Nusa Dua, unless you want to stay in Disneyland: No Bali atmosphere, sellers on the beach with numbers on their back: In case you would have a problem with one of them, it’d be easier to find out with whom you got an issue… Just shoking as it does remember me a bad period of History during WWII!\n", "\nWe had a lovely stay at The Nusa Dua.", "Bali itself was not what I expected. The beaches were very crowded and we were not able to swim, because the water was quite cold with lots of sea weed. ", "However our hotel was great. We upgraded before we went to a palace room, which I very highly recommend. It included breakfast, afternoon tea and evening cocktails. We therefore had to spend very little on extras. Our bill for 9 days was £120, and we were room only. Not bad for £18 to upgrade. ", "The food in the hotel was lovely. The Pizza's are to die for. We also had some great meals outside of the hotel. The hotel will arrange a pick up.", "All in all a great time had by all!!!", "\n", "\nI spent a lot of time researching hotels and villas in Bali. It was a tough decision but I eventually decided on the NDBH because of the many glowing reviews I read about this hotel, it’s location (we wanted somewhere quiet and peaceful) and it’s good facilities for children. I also found it to be cheaper than most of the other hotels in Nusa Dua. ", "We had a Family Room (Superior Room) for 4, which consisted of 2 rooms with an interconnecting door. There was a King bed in the main bedroom and twin beds in the 2nd bedroom. It had 2 bathrooms (1 with a bath). We requested a ground floor room, close to the pool which we got. The rooms were spacious, clean and comfortable, but certainly not ‘luxurious’. If you want absolute 5* luxury it would be better to get one of the Palace Club rooms or suites. We had a look at these before we left and they are wonderful plus you get all the club benefits such as free 24hr non-alcoholic drinks, afternoon tea and drinks and hors d'eouvres in the evening. ", "Overall, we were very impressed with the NDBH. The entrance and grounds are beautiful and well maintained. Lovely gardens, pools, statues and water features. The staff are wonderful – very friendly and helpful. Buffet breakfast is included at the Wedang Jaye restaurant. This is a lovely setting overlooking a large pond and gardens. There is a good choice of food and eggs are prepared fresh anyway you like them. Bottled water is provided free of charge in your room. We requested more water and this was no problem. There is a fully stocked mini-bar in the rooms and tea and coffee making facilities are provided but no fresh milk. The rooms also have Australian power outlets in the bedroom and bathroom so you don’t need to bring an adapter! ", "The hotel has good facilities for children including a playground, kiddies pool, babysitting service and Gekkos Kids Club (free for hotel guests). The kids club is very clean, bright and well run by qualified staff. They have an interesting program of activities which changes daily.", "The Nusa Dua Spa is wonderful. We used the gym, spa, sauna and steam room facilities which are all very nice. I also indulged in one of their spa packages which was fantastic - the spa pavillions are very tranquil.", "\n", "\nI just came back yesterday from Bali, where I stayed at the Nusa Dua Beach Hotel & Spa. I read countless reviews on Trip Advisor before deciding where to stay - Sheraton at Nusa Dua was my first choice, but it was fully booked, so after reading lots of good reviews of Nusa Dua hotel, I decided to book it. Thanks to the reviews, nothing surprised me at the hotel - good service, very comfortable rooms, good breakfast (though I didn't like the beef bacon, give me pork anytime!), nice beachfront, good value for money. The hotel is quite old, but you won't really feel it cos its very well maintained. I read some people say that Nusa Dua had a white sandy beach - its hardly white, more like light golden brown, but its pleasant enough. Its also a bit out of the way - 2-way taxi to Ubud costs 300,000 rupiah. But overall, we're very statisfied with our stay here.", "\n"]