[" ", "\n", "\nwe needed a break and it was the perfect place. it lived up to our expectations and more!!", "congratulations to all the staff they were wonderful, happy and courteous.", "always ready to assist with enquiries. I would recommend the Nusa Dua Beach Hotel & Spa in the future.", "\n", "\nWe went to Nusa Dua Beach Hotel for our honeymoon. It was an EXCELLENT hotel! Definitely the most beautiful hotel in Nusa Dua. The staff was really nice and the location of the hotel was really amazing.\n", "\nOur stay was great as usual as this is our second time there and will be back again. Onesearckenzan thing is the kids club really needs improving. It is really not good at all my kids saw it and didn't want to go at all. Before that we stayed at hard Rock kuta and kids club was amazing. this is the reason why my family would stay there too long. Please improve. Maybe PlayStation movies. Rock climbing. Kids need physical activities\n", "\nI felt there needed to be a bigger gluten free range but everything else was fantastic. The massages that we had were fantastic and the staff were very friendly and nothing was a problem. I would have liked a list of all activities that were going on every day including any sport that we could have partaked in.", " ", "\n", "\nFirstly can I say we had a wonderful time at the Nusa Dua Hotel and Spa - just got back from an 8 night Luxury Escapes package. Food was good - breakfast buffet extensive. Great staff - always happy to assist with a smile.", "Happy hour bar snacks are really yummy but happy hour drinks not cheap - normally you can get 2 for 1 - nothing like that here. A happy hour cocktail is still going to set you back $9-$10 each. Wines and Sparkling run at $10-$12 a glass. Bring a bottle of spirits duty free, have some ice delivered to your room, and buy mixers and Bintang at the market and have your own happy hour on the beach to keep costs down.", "Beautiful gardens - great options for lazing on loungers and chilling away the days - we chose to set ourselves up under the trees on the beach so we could swim in the pools or ocean - pools get quite warm by lunch time so recommend morning swim in pools and ocean swims in the afternoon. Cute little squirrels running around in the trees - fun to watch. You will get the sellers on the beach but if you say no they don't hassle you. Lilly (46) is a lovely lady - she sells silver bracelets. ", "Rooms very tired - I couldn't give the resort overall any more than 4*. No fresh milk for coffee and tea in mini bar only that awful powdered creamer - no top sheet only a feather quilt - our air conditioning was not working properly (set at 5 degrees and we were still not cool) so we ended up sleeping on top of the bed - we did mention this to Guest Relations but nothing appeared to change during our stay - I feel bad complaining as the hotel was wonderful to my husband who was ill with a chest cold but it did impact on our experience.", "You can take a Bluebird taxi anywhere in Nusa Dua and Tanjung Benoa for $3 AUD - don't limit yourself to Nusa Dusa hotels for dinner - try the restaurants in Tanjung Benoa - excellent food at Bumbu Bali and The Tree - lots of others to try - also the Bali Collection offers quite a few restaurants to choose from.", "You can hire a minivan with driver for half a day (8 hours) for $40 AUD and they will take you wherever you want to go. Use the new toll bridge when you can as it saves sitting in the heavy traffic (get used to that though as heavy traffic is the norm in Bali.", "The ladies at the Spa are lovely - the Spa itself - I couldn't rate it more than 3.5* if you compare it to the spa at The Westin next door. There is a lovely pool at the Spa if you want some quiet time.", "We would definitely stay here again.\n", "\nWe have just arrived back today. OMG is all I can say. We (2 adults / 2children) had a 8 night stay. Location perfect, hotel and staff perfect. I couldnt have wished for a nicer place to stay, our 15 Month old broke out in a rash which we took him to hospital to get checked. On our return ... staff and management had flowers and a fruit bowl delivered to our room wishing our son a speedy recovery. we all didnt want to leave xxx\n", "\nOur family group ,three generations. 18mts to 63 years, first time for some.", "Was all we had hoped for and more.A traditional respite in busy Bali.Escape from the hustle and bustle of a busy World. Peaceful with a happy vibe.", "All amenities are top notch:-food & drinks, entertainment, activites for all,spa & sports facilities,private beach no hassles. HUGE peaceful gardens with fish ponds and water features,butterflies ,birds and bats.Excellent location .", "Great value for money. We will be bringing back friends and family for more stays. Thanks to all the staff for making our time very memorable for the right reasons. If your looking for a peaceful garden,revitalize escape this is a place to visit. Rose\n", "\nI was disappointed that we were not given the room I had booked when we first arrived we had 2 single beds pushed together. We waited for 2 days for it to be corrected. We are business owners and we had been waiting for a long time to have this holiday, we were disappointed that we had the room problem! We paid much money and had given plenty of notice when booking.The air con in the second room was below average. Over all the staff were excellent and we did enjoy our stay, we would like to return there for another holiday in the near future", " ", "\n", "\nThat was perfect honeymoon at this hotel. Staff was friendly, helpful. We stayed here for 13 days. Some minuses i can set only for the beach (was not so clean) and shower cabin can be more comfortable.\n", "\nWe spent a short family holiday visiting Bali for the first time. ", "Staff was very friendly, the room was ok although the shower could be more convenient. ", "Nice location next to the beach with good choice of restaurants although on the pricey side. Hotel transport is considerably cheaper if self organized. ", "Overall a very nice vacation and a place to recommend. ", "\n", "\nThis was the second time my Wife and I have stayed at the Nusa Dua Beach", "& Spa and it won't be last . It has traditional architecture being one of the oldest", "resorts in Bali and very well maintained . The service is second to none and great packages available if you keep your eye out , this place is just good value.\n", "\nMy girlfriend and I spent 5 days in this wonderful resort. We had an amazing time and the hotel lived up to all our expections. We were treated with great big smile from the staff, exellent food with multiple restaurants and plenty of fun activities.", "The breakfast buffet had an exellent spread with western and eastern cuisine. The hotel landscaping was unique and gave a true Balanese experience. ", "An unforgettable holiday and we will always recommend this resort!\n", "\nA relaxing experience in a beautiful garden setting with the most helpful of staff. The resort is not the newest on the strip but it does have the best location on the beach. You have to love those squirrels!", "\n", "\nWe stayed in a Palace Suite and were very spoilt. Staff were exceptional. Food was good and cocktail hour fantastic! Excellent value for money!", " One criticism - they need to introduce a few more female ducks!\n", "\nHotel is in an excellent, quiet, upmarket location with good beach. This is a quality hotel providing excellent service and a real Balinese atmosphere. We've stayed three times and the quality always remains up to scratch.", " ", "\n", "\nMy wife and I stayed here four nights back in October. We had a lovely time. NDBH is situated on a fine stretch of beach, and is well-outfitted with multiple pool areas. We enjoyed relaxing by the water, soaking in the sun w/generous amounts of arak (well, tequila anyway). The service was generally good, and its hard to complain about anything given the friendly and attentive manner of the Balinese staff. The only two dimensions of our stay that were underwhelming were the food and the food prices. Breakfast was good, and we found the upscale Balinese restaurant on sight quite scrumptious. But the food offered at the various bars and beach-side eateries was only ever fair, and overpriced in my view. Despite this small complaint, we really did enjoy the atmosphere, service, and various amenities at NDBH. If you need a respite from the grind, a time to relax and enjoy sun and water, give NDBH a try.\n", "\nThis hotel is everything you would expect from a 5 star resort. Staff are all fantastic every one from concierge to cleaners are friendly, food is very good at the restaurants - I especially liked the italian - and breakfast buffet is extensive, hotel grounds and the beach are beautiful and pools are clean. Room was very nice, spacious with big balcony. I don't have a bad word to say about this hotel and will definitely consider visiting again if in this part of the world in future.\n", "\nThis was our third trip to the Nusa Dua Beach Hotel and it did not let us down. We chose the indulgence package and the extras were fantastic. Well worth the price. We chose to stay in a Palace Room. Breakfast and evening cocktails make this the best deal around. You will not be disappointed. ", "\n", "\nThis hotel is one of the best where i have stayed. Beautiful authentic Balinese hotel. The breakfast is top! The spa is fantastic! Just try it out, it gives you the feeling to be in heaven! And close to the airport.", " ", "\n", "\nFrom the time we arrived until we left, we really enjoyed everything about this hotel. After a couple of days we thought we should get out and about and see more of Bali, so we had car with driver who took us to places we requested to see which was great. After that though we decided we were enjoying a lovely (unusual) rest and relaxed and lounged around the pool, the beach, caught the shuttle to Bali Collection and we just really enjoyed our holiday. We thoroughly enjoyed the breakfast and were very happy with the theme dinners that were part of our Luxury Escape package. We definitely would like to return to this hotel one day - soon!\n", "\nMost enjoyable retreat holiday with wife. So-called Deluxe room a little tried. Breakfast was very good. Grounds & Gardens prefect. Spa good but over priced. Local map of outside stalls would be good to walk and see!", " ", " ", " ", " ", "\n", "\nThis was our first visit at this resort, my wife and travel to Bali annually, and stay at 2 different resort which we had inspected the previous year. We booked this stay via a travel site, luxury escapes, were not sure what to expect, but were familiar with Nusa Dua. This resort far exceeded our expectations, very balinese in its character and atmostphere. Staff could not be more helpful and nothing is to much trouble for them, We will come back next year. We are happy to recommend the Nusa Dua Beach and Spa to others.\n", "\nThe hotel was extremely overpriced and it was in quite a poor location. Certainly not somewhere I would recommend. We had booked 8 nights but only ended up staying 7 simply because the hotel just wasn't to our taste and we didn't feel that we were experiencing the real Bali.\n", "\nThis hotel has the best beach front in Nusa Dua. If you can leave the pools and fancy the beach the shelter from the beach trees is perfect. Perfectly clean, constantly attended for stray litter (rare) and falling leaves. Idyllic. There are 4 restaurants to choose from; all excellent. If you feel like a change there is a courtesy bus for the 5 min trip to the local shops and restaurants.\n", "\nits was have a nice days stay there although only 1 night but feeling cozy around ..never forget this hotel ..with have private beach and nice breakfast ,went staying there there is wedding party just front our room but happy can listening music I really recommended this hotel for holiday ", "\n", "\nI stayed 2 nights here with 2 friends - we had a splendid time. If you are looking for a resort which has lovely staff, nice pools, good food, and sporting activities all on one site, then this is for you. Plus as its right on the Nusa Dua beach, you can pop right out into the ocean, do some kayaking or SUP and be back at your room in minutes. Not close to other shops or restaurants, but a super easy and relaxing experience. Lovely vibe from the staff. Highlight was the breakfast - best i've had in Bali!", "\n", "\nEnjoying every happy moment with my family here.", "Will come back again Nusa Dua Beach ^^", "Cute squirrels all around the hotel. Make my kids happy of course.", "Swimming pools, playground and the beach are absolutely fantastic.", " ", " ", "\n", "\nExcellent location for a weeks getaway with the wife and friends. Perfect for what we wanted as it was away from the busy parts of bali and we could basically stay at the resort the whole week. Breakfast bar outstanding.\n", "\nWe stayed in Nusa Dua Beach Hotel for the 4th time and again had a lovely stay. We love the ambience and the traditional architecture. The gardens are beautiful and well kept and the pools, restaurant, everything looks exactly like I expect a nice resort in Bali to be like.\n", "\nMe and my husband spent the last part of our honeymoon here. We stayed in one of the palace club rooms that offers all the additional extras such as afternoon tea, cocktail hour and wifi in our room. All in all it was ok but it wasnt great. I did feel like the hotel was trying to rip us off, generally things in hotels are a lot more expensive which I understand but this was excessive. Avoid having dinner in the hotel restaurants, the restaurants in the local area are nearly a third cheaper and offer a taxi ride home as part of the meal. Also do not get a taxi from the hotel. Its better to walk out a bit from the resort and catch a blue bird taxi from there which is on a meter and a lot cheaper. ", "Other than that, it is just a typical resort, nothing special!\n", "\nReally nice clean traditional hotel in a beautiful location with well maintained gardens and pools by the beach with helpful staff. The only negative was the price of transport arranged by the hotel was twice that of the local taxis.", " ", " ", "\n", "\nWas well worth the 16 hour flight, hotel was very clean, absaloutly massive, they put us in a room near the spa, We are beach and pool lovers so asked to move closer and was a bit embarrassed about asking but they had no problem with our request so helpful, the 2nd room was perfect for us. We took £500 to start with as its a lot of notes in (local money) they have a cash machine on site so glad we didn't take any more. ", "In total for a 10 day holiday we spent about £1500 this was on 2 brilliant day trips and a lot of food and drink, ( we ate and drunk loads) :-) we were going to go all inclusive but the prices were very reasonable. ", "You have to do trips, the best one was a 3 in 1 day package we did - (bali adventure tours) bike riding through the heart of bali mostly down hill so really easy, stoping of to see different places, then of to ride the elephants had a tear in my eye they was amazing and very well looked after, then white water rafting was incredible, we will never forget it, amazing day. We would recommend to everyone, if you don't fancy all 3 trips you don't have too, we booked all activities in our hotel. ", "Pool was huge and beach is amazing warm sea and very calm waters. Food was lovely a lot of choice.", "You have to pay to get in and out of the country even if your a child, worked out only £10 each.", "Taxis are easy to get when you arrive and very cheap, go with the men in the blue shirts there called blue bird taxi. October was perfect for us no rain at all and very hot we looked at a lot of hotels around nusa dua, not just saying this but we think best stretch of beach and best hotel on nusa dua. Go here we would again ;-) a lady called ade in the bali restaurant was such a sweet heart and very helpful.\n", "\nMy wife & I had a recent 8 night stay here using an online coupon with a number of extra inclusions .Generally speaking for one of the first 5 star properties at nusa dua this place has been well maintained & managed .I used the spa for a number of massages and found all the services o f very good standard .the pool area is quite big and there were a good number of shadey spots available .The breakfast was quite satisfactory with most of the usual menu items .The themed dinner buffets were about average at around 250,000 rupiah ++( $25 AUD)& I would give them a miss .Try Bumbu Bali ,Sakala,& Tao (at the Radisson ) all in Benoa ,just a short cab ride away .Alternatively ,treat yourself to a 30 min ride to some of the dining delights in Seminyak ,now that it's a bit quicker to get to due to the expressway ..Note you MUST tell the driver that you wish him to use the expressway ,at your cost of 10,000 rupiah .", "When ordering transport at the front desk ,in general ASK for a bluebird cab as it will be cheaper than the HOTEL transport .Overall the total experience of this older property is still good although not as glitzy as some of the newer neighbouring properties .Free wifi in the lobby areas with a rip of charge for its use in your room .\n", "\nFor my first visit to Bali I was glad my accommodation was at the Nusa Dua Beach Hotel. From arrival to departure it was a truly positive experience and I cannot compliment the staff enough for their efforts. Food and beverages always served with a smile and concierge area most helpful. Great location topped it off.\n", "\nWe spent 1 week here and had a great time. The hotel is big which makes it feel quiet. The staff are all very friendly and helpful. The room was clean and spacious. The food was was good. Would recommend!!\n", "\nA wonderful place to stay, exemplary staff, fantastic food, great massages and facials, lovely pools, and a memorable suite, plus the lounge with afternoon teas and cocktails almost to die for!!! We intend to return four times a year!", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", "\n", "\nNice ambiance, nice location, nice beach, nice pool, nice friendly staff, nice food (but gets a bit bored after a few days of routine).", "The spa can be developed a bit more. I did not have much of a time to explore most of the amenities available though!\n", "\nWe have been coming to ND for over ten years now and always come away feeling welcome, rested and genuinely appreciated as a guest.", "Over the last two years all levels of service and facilities have improved under the management of Urs, the new General Manager.", "For us Nusa Dua Beach Hotel is our safe and pleasant home away from home.", "This time we stayed at the Palace Club rooms, wonderful!", "Thanks team and the Hotel, Pieter and Lia Mulder, Western Australia", "\n", "\nThis was our 5th trip to Bali, and the second time we have stayed at nusa dua beach hotel and spa! This place never ceases to amaze us! The most friendly helpful staff, wonderful atmosphere and food!!", "\n", "\nGreat location, facility and service from attentive, professional and attentive staff. Food was of high quality and was the themed dance/ dinner nights. Facility is true to Bali's culture and is a good balance between the provision of services and facilities and open space.", "Easy access to Bali Collection but importantly can get to other main tourist areas and airport simply via the new bridge system\n", "\nThe Palace Club at the Nusa Dua Beach hotel, is very unique with personalised service, a separate check-in, a lounge area for Palace Club guests where they can enjoy breakfast, afternoon tea and cocktails at sunset overlooking the perfectly trimmed garden. The rooms have traditional designs reflecting the elegant details of the beautiful Balinese architecture.\n", "\nStaying in this hotel as our annual retreat since the last 7yrs, we enjoy the very relaxing environment, esp beach walk, yoga, spa,hospitality, and is a place that make ppl like us to come back. Staff are very kind, friendly and engaging..i always recomend my family and friends to come to Bali and stay in this hotel. ", "A minor comment from me as regular gym user and attending yoga class, amenities like water, wet towel is no longer provided. ", "Good morning complimentary drink for joggers at the beach was good and welcomed ", "Food provided at Palace club was excellent and all the staff from Manager to waiters and waitress and very nice, friendly and helpful. Congratulations and keep it up.", "One more minor comment is the internet excess in the room needs to be improved.", "Thank you", "\n", "\nOverall the hotel offers good value . Thus is the third time that we have stayed at the hotel .staff do their job but lack warmth when compared to the Westin Hotel which we have also stayed in three times . Rooms and pool area are very good . Quality of food served in restaurants also good although could be served in a more timely manner . Yes , most definitely would stay again , but attention should be given to lifting the overall staff performance .one final point , if you are staying at the hotel when there is also a wedding , be prepared for much noise . Unfortunately , the music is allowed to go on close to twelve o'clock .Not very pleasant if trying to get an early nights sleep\n", "\noverall a really good place to stay, impressed with facilities. It's a beautiful resort, mature & well maintained. Our only suggestions for improvement is for the food delivered must match the description as on occasion components of the meal did not arrive, eg pizza delivered wasn't as ordered, minor ingredients missing, drinks ordered never came, wait times occasionally seemed out of sync with the number of patrons.", "The staff were amazingly helpful & always spoke in passing making you feel welcome. We are not sure which hotel some other reviewers have stayed in as we don't recognise the hotel they described. No stay is perfect but this one was very close, with the above comments to note, we will stay here again and hope to do so within the next 18 months.\n", "\nWe made the booking through \"Luxury Escapes\". The resort was everything we expected and much more! Great value all round. Special mention must be made of the staff -- they are just fantastic -- cant do enough for you-- we have found a new bechmark in exceptional costomer service!", "Highly recommended.", "\n", "\nGreat resort. Wouldn't hesitate to stay again. Much better than staying in Kuta or Legian if you want some quite, relaxation away from the madness. Enjoyed the beach which was kept immaculately clean and the pools which are no more than 10 metres from each other. Accommodation was very good. Staff extremely friendly. Will be back for sure!", "\n", "\nWe stayed at this resort because we have a 2year old little girl now. It was absolutely perfect for what we wanted. The pools are fantastic, the gardens beautiful, access to the beach easy and the staff were absolutely wonderful.\n", "\nGreat location, wonderful staff, fantastic facilities - just what you'd want for a relaxing resort holiday. I came with two girlfriends and we had a lot of fun. The rooms were beautiful, the view wonderful. Never slept better!", "\n", "\nWe loved it. The biggest highlights for us were: the cuisine and the spa area. We normally like to eat out when travelling, but the kitchen was so excellent that after a couple days we found ourselves looking forward to dinners in the hotel. The other highlight for us was the morning, which we many times started in the long outdoor pool, next to the sauna world. It is just perfect to relax. Only one downside: back then during my visit the internet connection was not exactly up to date. But, anyhow, at least we could completely switch off\n", "\nWe booked this resort through Luxury Escapes and upgraded to the Palace suite. It was fabulous value for money. We have holidayed in Bali 3 times before staying in Villas, we found the resort location fantastic, great beach with everything at hand. Staff were very helpful and welcoming, we will be back.\n", "\nThis property is meticulously maintained and is a delight to visit. Rooms are very large, beds and pillows are top rated. The fact that this hotel has been here for many years is a positive rather than a negative. The grounds are amazing and brilliantly laid out, and the huge and interestingly shaped swimming pools are also lovely. Lots of shade trees. We would love to return. Safety is also addressed with guards and vehicle scrutiny at entry gates.", "\n", "\nThe hotel was awesome..everything from the beach to restaurants to ambience to rooms - amazing! It was a pity tho that sucha great hotel had terrible staff. Always irritated, unhelpful and unhappy....", "\n", "\nWe had an amazing stay at the Nesa Dua Beach Hotel & Spa. The staff were ALL welcoming, friendly, informative and courteous. This would be at the top of our list for best Hotel. We will not have any hesitation in recommending this hotel to our friends.\n", "\nI travel a lot and this hotel and spa were exceptional in all areas. The staff, grounds, room, spa, food, drink (my favorite new cocktail is a Palm Mojito)", "I would highly recommend this property to everyone.\n", "\nFirst visit to Bali so wasn't sure what to expect however as we were driven into the hotel I was struck by how beautiful the setting, the grounds and the buildings were. From the moment we arrived we were treated very graciously by all the staff. The Balinese are very friendly and always seem happy and polite. Everything about the resort was lovely the interiors, the decor the grounds the setting. For once the weather was kind to us for our entire stay so we made the most of the main pool area and its swim up bar. My wife and I also had three one hour Balinese massages each in the Spa which were heavenly. The ladies giving the massages were all very good and knew what they were doing. The pool in the Spa area was very tranquil and relaxing. The breakfasts were great everything you could ever want and the theme nights gave you a taste of Balinese culture.", "The prices in the resort for drinks and meals are more expensive than outside the resort but not exorbitant. We went on a package deal which I think was very good value it include two welcome cocktails, two beers, six one hour massages, three theme night dinners, one pizza and Nusa Dua dollars to use in the resort.", "I would have no hesitation in recommending this as a wonderful place to go and stay on your Balinese holiday.\n", "\nThis is our second stay in the hotel. The restaurants were very expensive and very mediocre. Even breakfast was just ok minus the fruit, which is weird to say about a buffet. The theme dinners were $35 and little vegetarian options. The only thing this hotel has going for them is their beach, great location and not crowded at all, unlike the pool that everyone reserves their chair before breakfast. I did enjoy renting a bike to explore the nearby properties. What I really didn't like is that they charged my credit card $200 when I checked in as a \"hold\". I travel a ton and stayed in many hotels and no one has done this. The property has a wild cat that wanders the hallways.I tried taking the shuttle bus to the local mall but like the hotel the mall was a tourist trap with food prices the same as in the USA. ", "I made the mistake of booking a tour through the hotel which is done with a private driver. I paid over $100 to just have a driver who dropped us off places, I'd see all the other tourists walking with their guide explaining things, but ours stayed in the car. When I stayed in Ubud I got guides for a third of the price who actually gave tours. The annoying part is their guide kept trying to hustle us. Then he kept coming up with other suggestions for us to give him our money. It was incredibly annoying! ", "Note that if you're in Bali to see temples, this hotel is at the bottom of the island and you will be driving 2 hours to get places.\n", "\nThis was my second visit to this resort this year. My firs visit was so wonderful I had to go back. I was a little concerned that my return visit wouldn't be able to match the wonderful experience of the first trip but I neednt have worried. We had an absolutely fabulous, relaxing time. The spa is one of the best I have been to, the resort is so well kept and the staff are all so friendly and genuine. I will definitely be back.\n", "\nVery beautifull hotel . Big hotel , but it did not fall on. Large beautifull garden ,everyting very clean , situated residentiel and on the beach . Good price-quality.The biggest,best breakfast ever !", "We come back !", "\n", "\nWe enjoyed our stay very much.", "Friendly staff , Beautiful pools & gardens , The hotel atmosphere was excellent. lovely restaurants , great food from Bfast till Dinner.", "Fantastic weather all our stay.", "Superb,many thx", "\n", "\ni've been staying at many resort in nusa dua area, such as hyatt, laguna, grand nikko, ayodya. but only in Nusa Dua Beach hotel i can feel the true comfort. yes, it is a big resort but not too big as hyatt or ayodya. so u don't need extra long walk to reach to the lobby, pool, or to the beach. a grace resort because well maintained garden and building. the standard room just ok, but the club room was amazing. wood carving decorate the rooms beautifully.evening cocktail at the club was so so. the breakfast was superb. delicious and a lot of variety. indonesian, western, japanese, italian pasta. fresh salad. ohhh... want to move to nusa dua beach hotel because I'm trapped in ayodya now.\n", "\nWonderful hotel In beautiful balinese style", " Staff Very welcoming.", "Beautiful fountains and lakes all over The hotel!", "Amazing beach and beautiful and well cared tropical garden", "Great food In the restaurants a la cart not só good food In the buffets", "\n", "\nFrom check in to check out the experience was very rewarding.", "Having stayed in Nusa Dua on a previous occassion, I already knew a little of what to expect.", "Like safe enviroment; really effective security;extremely clean beaches; away from the hustle and bustle of other areas of Bali.", "The staff were extremely helpful, cheerful and eager to please, and always had a smile.", "The pool area was fabulous.", "The room and buildings were kept clean and tidy, everything worked as it should, although some areas were showing their age.", "But this was of minor concern.", "All in all we had a wonderful time and would certainly come again if in Bali.", "I would rate this facility 9.5 out of 10.\n", "\nFantastic trip with the family. Beautiful hotel with gorgeous gardens and pools. The food was excellent and the staff so friendly and helpful. Can't wait to return! :-) :-) :-) :-) :-) :-) :-) :-) :-)", "\n", "\nI like the traditional of Bali atmosphere and the jogging track which connected the beach and several hotels around. Easier to walk and have beautiful view if you have meeting in several hotels. Would you please put more lights in the jogging tracks at night maybe up to 11.30 pm and more of direction sign to help us? Would be better if the lift could be renovated as a bit slow. Thank you for the hospitality of your stafs.\n", "\nGreat hotel and location. Good for families, we had family room (interconnecting rooms) which were ideal. Ate in the hotel lots but also visited other hotels nearby. All the hotels in Nusa encourage you to visit each other. Kids loved the tree house - a short walk along the beach. Hotel service was great.\n", "\nThis was my third visit to this hotel, and it was like coming home... the staff are lovely, magnificent gardens, wonderful spa area and the hotel itself retains a sense of old Bali which is becoming harder to find. If you are looking for a peaceful place to relax and recharge, then I can't recommend this beautiful hotel highly enough and look forward to returning again next year.\n", "\nThe resort was amazing the lagoon pool was great huge with plenty of sun beds drinks and food a bit expensive considering Bali, but would definitely would stay again. It was a short 10 min walk to local shops and small market", " ", "\n", "\nReturned to the hotel after a number of years and was once again enchanted by our visit. Booked our stay direct with the hotel and opted for the Indulgence package and this proved to be exceptional value.", "Staff are incredibly warm, welcoming and delightful with nothing being too much trouble.", "Breakfast provided a fantastic variety of options, with a wide selection of both western and oriental fare. ", "Rajahs restaurant was a great experience, not only for the wonderful Balinese food but also for the ambience and service. ", "Chess restaurant was perfect for lunch, a few steps from the beach and in the evening dinner on the deck was a great experience.", "Spa was wonderful with excellent staff and facilities and was a tonic to both the body and the soul.", "The location of the hotel was perfect, beach was cleaned regularly and no problem finding a sunbed.", "The rooms were excellent, well maintained and spotlessly clean. Had a garden view room and in the evening the beauty of the gardens, with the fountains in the lake, was very, very tranquil. Perfect spot for a nightcap.", "Alcoholic drinks are relatively expensive, however I understand these are a consequence of Government taxation policies and would be unfair to compare prices other than with similar establishments.", "Enjoyed every moment of our stay, with the staff, location, facilities and ambience of the hotel making our stay very special.\n", "\nWonderful staff, room, amenities and extremely wide variety of good food...all very satisfying.", "Could management look into providing courtesy buses to and from the other centres like Kuta, Legian, Seminyak etc to enable guests to do some shopping and return after 2-3-4 hours ?...We found the cost of taxi services quite high...otherwise NO complaints...thanks for a great holiday...Don & Kerry Martin...Perth, Western Australia.\n", "\nWe enjoyed our stay very much due to the efficient service n very helpful staff. The hotel atmosphere was excellent. The breakfast selection was fantastic with a wide selection of foods that was displayed in a creative manner.", " ", "\n", "\nEvery moment greeted with kind, friendly hard working staff. Beautiful surroundings. Kids enjoyed the occasional gecko club session. Luxury escape package inclusions fantastic value. Spa facilities sublime. Relaxing luxurious tropical paradise. Suksma", "\n", "\nless expensive food and drinks in the hotel would encourage guests to eat more at the hotel instead of outside for example Bali Collection.The taxi service is also expensive compared to outside.Air con was a bit noisy in the room.Overall a great complex with excellent staff and amenities", "\n", "\nCourteous staff, always with a welcoming smile and greeting...you could find places that have more reasonable prices but for where you are staying you could not want for anything else.", "We will return!\n", "\nGreat resort, if you find anything significant to moan about here you must be hard to please. Just had a week ( first time to Bali) and thought both the country and the resort were spectacular holiday destinations. Cant wait to go back.\n", "\nHow can be this poor hotel be a 5 stars !!! We came for 2nights & couldn't stay after 1night , lizards everywhere , path was dirty & water all over the ground.", "Internet not free in the rooms !! Thank god it was only 2 nights i booked cause i tried to leave after the first night & to get my money of the second but they refused so i left cause be4 our flight we need a good sleep & this will never happen at this poor dirty old hotel\n", "\nAfter bypassing the Padma hotel this year due to ridiculous prices we decided to try Nusa Dua Beach Hotel and Spa. With our luxury escapes deal we held our breath and closed our eyes. Our Palace Club suite was well appointed and we enjoyed having a bedroom to ourselves for once. the kids had their own beds and TV/dvd player for those nights after long days of swimming. The resort sits right on a clean and perfectly usable beach. At low tide the sea disappears but leaves a cool reef to explore. The pools suited our young kids (5&6). The hardest working staff on the resort are the pool cleaners, I saw one to submerged for the day fixing tiles and making sure the pool was spotless. The kids club was ok, but the kids didn't really seem to want to go back like in other resorts, it's an area that could be improved. The palace club serves great breakfasts, but the food seems to go downhill as the day goes on. The staff are so warm and polite in the palace club. If only all of the staff were as well versed in English this resort would be a true winner. It makes for a deeper knowledge of the local area or activities in the resort very challenging. Do not try and hire a paddle board, I ended up walking away in utter frustration with the staff member not caring at all. Overall the resort Has traditional bali charm but needs a small amount of work to bring it back to life, the food is hit(Japanese restaurant) and miss (checkers by the oceanfront). The food and day spa is soooooo overpriced, and if we didn't have vouchers from he holiday deal we would never have eaten or got a massage on site. A massage from the beach was $10, a massage in the spa was $65. A coke from the street was 70c, at the resort it was $4. It takes the gloss off an overall charming resort. I'm sure the new food and beverage manager will sort this out. Overall it's clean and relaxing and it never felt too busy, it has charm and a lil something about it. Just let it wash over y for the first few days and it will charm you by the end of your stay.\n", "\nDrinks are far too pricey.......12 canadian dollars for a gin and tonic.......over $4 for a bottle of water by the pool.......good yoga classes.......friendly staff.......good early bird special at Raja restaurant\n", "\nGood location, Nice staff and service, Rooms were clean !!! Good quality and choices of food. price is high for any services in the hotel such as taxi service, doctor service , water bottles, Overall enjoyed the stay !!!", " ", "\n", "\nWe came here for our honeymoon and stayed for 3 days, had a wonderful time, we got delayed by 2 hrs due to immigration but our cab driver was still there waiting for us at the airport, great service indeed, the private beach was perfect for spending a lazy afternoon, the buffet breakfast was really good and had great variety, however we did find a lack of options in the restaurant menu, after a point there weren't a lot of options to try from, but all in all a really great experience.\n", "\nIts a shame when remembering a holiday that was in most parts so pleasurable , that the first night when a Free flow drinks option was on offer with dinner that the lasting memory was having Houdini as our drinks waiter , this one act was a mistake by the staff ,an otherwise helpful friendly and informed staff has been criticized by his disappearing act.\n", "\nAfter touring NZ we required a relaxing 5 days. This hotel fully met this requirement. Whilst being a gated community away from the frenetic life of Bali itself, it had many of the characteristics that reflect Balinese culture, far more so than the adjacent hotels. Staff were without exception smiling and helpful. The gardens are exceptional, and the spa pool a hidden gem. Food was excellent. Absolutely nothing to complain about!\n", "\nAbsolutely loved this place, location, rooms, friendliness and efficiency of staff. Our room was immaculate and nothing was too much trouble from bringing us some ice or requesting an extra towel. The breakfasts were probably the best buffet breakfast assortment I have ever experienced and a real highlight. The gym was also great, compact but with everything one could want for a great workout. The restaurants were great, the beach was absolutely lovely with plenty of beach lounges available. Could not fault it\n", "\nIt could be nice to get a little more information about the what to do in Bali like a day program or where to shop .", "Also of how to use taxis and how much to pay .", "Overall very friendly and nice people and good service\n", "\nExcellent hotel - grounds & facilities.", "Lovely kind staff and wonderful service.", "Only feedback would be that the pools should remain open longer (to 9pm perhaps?)", "Looking forward to a return trip.....", "\n", "\nWe had a very relaxing time staying here for 8nights. Great customer service, close enough to go to Seminyak using toll road 17mins approx, however you may consider this an inconvenience it's only a small fair to pay while staying in this beautiful resort ($10-$14).large swimming pool and four restaurants within resort. Beautiful beach with very minimal rubbish ( unlike legian)so you can swim in the clear water! And walk the beach!", " ", " ", " ", "\n", "\nWe absolutely loved this place as soon as we arrived. The service and the food was the best we have ever had anywhere. The staff would always greeted us with a smile and were very helpful. We didn't want to leave but we will look forward to coming back someday.\n", "\nI had a wonderful time whilst staying at the Nusa Dua the staff were awesome and very helpful and nothing was to much trouble will be back for sure as I've all ready got plans for next September thank you Michael.\n", "\nmost tirreble hotel i have ever seen in my life! this should be 3 star not 5 star towels very dirty!my bed sheets very dirty and smell like somebody vomite on them!!! when i was cheaking in the indonisian in the front desk blocked my cridet card because he use it wrong so i had to wait 2 hourse to call my bank and they open it again toilet very dirty!!! they never clean the floor in the room every day i am angry with them my trip was disasteare because these hotel i wasent happy at all because every day i am angry they doing something wrong i dont advice anybody to stay there as i said its 3 star i dont understand why they call it 5 star!!!!!\n", "\nBooked online and advised early check in but Hotel did not get message. OK, but asked if they can help, said they advised Cleaning to prepare room. Waited 1 hour and I had to ask myself again and found the room was ready for some time. Poor service, left me sitting in the Lobby waiting with no advice how my room was going.\n", "\nHave been here before 3 yrs ago and wanted to see if everything was still as nice as it was then. This holiday i booked 2 times 3 nights here and both times it was a pleasure to stay in this beautiful hotel. I booked a club room so got some extras like breakfast a la carte, tea time, free cocktails in evening. The staff is very friendly and efficient, make you feel you are at home and help you in any way they can. The breakfast was a la carte as i said with also small buffet. Tea time at noon was a joy with drinks and some small bites. The free cocktails were enjoyable every time. Maybe compared with 3 yrs ago everything was a bit less but still ok and worth the extra money. The pools are great, sometimes a bit crowdy but Always found a seat next to pool. The beach is very nice and clean, you can even have lunch or dinner at the beach when you want. There are 4 restaurants in the hotel and they are all good. The food is good quality and places are clean. Didnt try the Spa this time but it was ok the first time and i didnt hear anyone complain. Checking out was the only negative thing i can think off, staff did a great job and was accurate. Maybe pay attention when you use the taxi counter, you can find cheaper ways. For the rest...i will be back..\n", "\nOur 6-Day Family Stay at the Nusa Dua Hotel & Spa can only be described in one word - \"Superb\"! They really do understand the meaning of the word \"Top Class Customer Service\". This was our 1st visit to Bali and the Nusa Dua Hotel & Spa is the reason whey we will be going back again. The staff became like friends to us over the 6 days we stayed there and we have only wonderful memories from the time we spent there and definitely did not want to leave so soon!\n", "\nIf you're in Nusa Dua for a convention and wants the convenience of being close to the BNDCC, this is the place to stay as it is just right across the convention center. Hotel, room, food and facilitates are top notch as expected in a Nusa Dua resort hotel. The only drawback was the shower. I had on overhead shower in my room and it wasn't running fast.\n", "\nFantastic hotel, very helpful and friendly staff. Good choice of food, amazing beach and pools. Close to markets and other restaurants. The room was very nice, clean and comfortable. Highly recommended!", "\n", "\nWe were a family of 4 and we had an absolutely beautiful stay in your resort, the pools were devine, beach awesome, spa treatments and tranquillity of this hotel makes it an outstanding place to stay!", " ", " ", "\n", "\nWhat a beautiful hotel! At the same time we were here, our daughter was staying at a #1 hotel in Legian. In spite of loyally choosing the same hotel for the last 4 years, she visited us at Nusa Dua Hotel Beach Hotel and Spar and decided that our hotel was the only place she wanted to return to! She was entirely awestruck by the beauty and luxury of the Nusa Dua Beach Hotel and Spa! But really, from my husband and I, this hotel, with its beautiful staff, is the best! We commend the following Staff : Waitresses, Werni, Ayu, Nona, Fedelia, Nofi, Ulan, Waiters, Gin, Sugiati, Wardan, Sedyana. Finally, what a wonderful housekeeper, Kastawar - dedicated to cleaning to the nth degree - never seen a housekeeper like him, scrupulous, trustworthy and so respectful. Chief Chef, Ian - wonderful human being and so dedicated, the food is of the highest quality and deliciously nutritious! As far as PR goes, you can't go past Ian and Bruce. Please, don't let these guys slip through the corporate fingers. We specifically want to say that Nona has been very helpful and pleasant to us, helping to solve minor problems, as has Fedelia in the past. We could go on. What a wonderful combination of people. So beautiful, we cant wait to return. So sad that we have to wait until next May! Hope they can accommodate us in a Palace Suite! .... So, if our message is any way ambiguous! What else can I say? Its in walking distance of a Bali Central and another number of resorts - all of them offer a variety of dining experience that we didn't have the need to try. The hotel has a variety of choices, but we have to admit, that we didn't venture further than Chess! We just didn't want for anything!\n", "\nBoth my husband and I enjoyed our spacious Palace Club Suite room. The staff were very friendly and helpful. The gardens were beautiful and serene. Loved the spa treatments. I would recommend it highly.", " ", "\n", "\nWonderful stay! We experienced everything and more at Nusa Dua Beach Resort and Spa! Our package blew us away with more extras than expected, the staff were always prompt in assisting us, the facilities were great - didn't have to leave the resort if we didn't want to, it had everything!\n", "\ngreat resort and we thoroughly enjoyed our stay. my only criticism is that some guests would reserve pool lounges early in morning but not use them until afternoon. thus it was very hard to get a lounge.", " ", "\n", "\nEverything was excellent !!! All very friendly and helpful. Nothing was a problem for your staff. Plenty activities, very good musik and musician. Price was acceptable and easy exchange any time with good...smile !", " ", "\n", "\nHighly recommended - very spacious grounds, great features, gardens superb. Hotel is right on the beach although the sea WAS tidal and has a lot of sea grass. ", "Staff are brilliant - very helpful and a pleasure to talk to.", "Food and drinks - try the Chess Bar and swim up pool bar.", "Take a bike ride along the Nusa Dua seafront with open access to all the other hotels in the area.", "An unforgettable holiday in a truly fantastic hotel!\n", "\nGreat hotel and great for kids, service a little slow in palace club lounge sometimes but otherwise very friendly and helpful, had a lovely stay, got the luxury escape price but don't think its worth over $6000 for the standard price. ", " ", "\n", "\nWe visited the resort in October 2013. It's a great hotel to just relax and laze around. Of our 5 day holiday, we spent 4 days entirely in the resort. We booked the palace club room which came with a lot of perks including evening cocktails and a separate breakfast buffet. If u r willing to spend a little extra, its totally worth the money to book the palace club rooms. We booked a couple's spa on the last day which was absolutely superb. It is definitely on the more expensive side, but saves u the time and effort to travel for a spa treatment. All in all a relaxing stay and great hospitality!\n", "\nPeople return to this hotel year after year and although this was our first visit, it will certainly not be our last. Whilst not the most contemporary or trendy resort in Nusa Dua, this hotel more than makes up for it with its lush gardens, beautiful pools, proximity to the beach and friendly helpful staff. We were visiting with our teenage daughters during the school holidays and whereas neighbouring resorts seemed to be much more crowded and overrun with young families, we never had the feeling that our hotel was busy, as there is so much space to spread out. The elegant pavilions, combined with traditional Balinese architecture and extensive grounds mean you can always find a quiet spot to relax and although the loungers by the pool are often reserved with towels by breakfast, there are plenty of loungers under shady umbrellas a minute away on the beach or by the stunning lap pool near the spa and tennis courts. Many people rave about the Palace Club but we booked the 8 night package which was great value. It includes an upgrade to Premier room, three dinners for two at the Balinese banquets, free cocktails, three spa treatments per person at the beautiful spa and free breakfasts every morning. The breakfasts offered so much choice with fresh juices, eggs and pancakes cooked to order and a huge buffet spread of fruits, pastries, cereals and other savouries that we never needed more than a smoothie or juice for lunch. The only negative was that the weekend we arrived the hotel was almost booked out with a big Japanese convention so we weren't upgraded for the first two nights and the first room smelled of smoke. Just speak to the rep at the Customer Relations desk and be very firm if you require a change of room and they will come eventually come through. As with most resorts, the taxi can be quite expensive if ordered from the front desk. We booked an fantastic private driver for day trips to Ubud, white water rafting and the Elephant Sanctuary. Jonto speaks excellent English and has a very comfortable 7 seater. Call him direct on +6281 338 532 873 or email: jonto57@yahoo.co.id He is from Ubud, is totally reliable and took us through the traditional villages and back roads to avoid the appalling Bali traffic.\n", "\nWe have been in your resort many times and have always been happy but this time we found not proper service and poor quality for restaurants meals. We were not being taken care of and not sure if we will ever return\n", "\nAfter staying at this hotel last year for 5 nights, we decided to have our wedding here (Sept. 2014), which was conducted in the quiet gardens of the hotel near the duck ponds. Our wedding co-ordinator Metalia looked after us from start to finish, and everything went off without a hitch! We combined our wedding and honeymoon (2 weeks), and once again enjoyed all the facilities of the hotel. The staff are always smiling and happy to help with anything you need. Our favourite squirrels came to visit every morning and afternoon to munch on snacks with us. Will be back soon!\n", "\nThis hotel is absolutely fabulous. The location is perfect- right on the beach ( also gorgeous!) with well furnished rooms and plenty of facilities. There are several bars / restaurants to choose from and the quality of food was great. Breakfast has everything you could think of and more and unlike some hotels, doesn't finish ridiculously early! All the staff we dealt with were so friendly and genuinely helpful. Some people have commented that sun beds all go around the pool, and yes this did happen, with people booking them early on but there were always plenty of sunbeds on the beach which was literally over the path from the hotel garden. There is only one really tiny negative thing I could think of ( just so it's doesn't read as too gushy!) and that is the Chess Restaurant could sometimes get really busy in the evenings and then the wait to get a menu, have order taken etc could be very long, but this only happened a couple of times so it wasn't that big an issue.", "We went on a couple of trips out, and the hotel will kindly book a taxi for you and you pay the hotel direct, which saves haggling, but you will pay over the odds for this, but these were small people carriers as opposed to minicabs. But very reliable service. Definitely worth a stay here!", "\n", "\nI booked Premier room and requested for high floor. Was very disappointed the the room I was given was on the ground floor. ", "When I reached the hotel, one of the attendant took a bag and disappeared. I hunted around and saw it next to a pillar with no one near it. While waiting at the check in counter, the only staff in attendance was busy handling a couple who may have made some request and took him a long time to handle. The next staff took quite a while to come out of the room behind to help with the booking, by then I have waited for more than 5 minutes. Luckily, the second person was very fast and professional in handling the booking and made me feel welcomed. ", "Everything about the Premier room was above my expectation, from the bed to the shower facilities. ", "Definitely will recommend the hotel, but hope that they pay more attention to the first impression given to guest from arrival to check in.\n", "\nMy wife and I stayed at this hotel recently for 9 nights along with our two small children (1 & 3).", "The hotel is architecturally stunning in traditional Balinese style, but is some way off it's glory days with much of the hotel looking quite tired and a bit run down.", "We stayed in a deluxe room for 4 and the size of the room is ample but not spacious, my parents stayed in a club suite for only a little bit more $$$ and their room had oodles of space and was much more modern and up to date so families may find better value for money doing it that way.", "Babysitting was excellent at $4/hour, very reliable and trustworthy. The staff in general were extremely friendly and nice but lacked basic comprehension if you wanted something. ", "Some things at the hotel make you scratch your head, for example the hotel has a great breakfast buffet spread, yet you have to scramble to find your own table, search to find your own high chair, you aren't offered any tea or coffee and if you aren't randomly asked halfway through your breakfast and ask a staff member, they seem confused and need to be asked 3 or 4 times before doing anything!", "Aside from this the facilities are very good, the kids club is tiny with quite boring and limited activities and from looking at nearby hotels their clubs seems much bigger and more fun, but the pool area was fantastic with a huge sandbank area for kids to play in and plenty of communal toys provided for kids of all ages.", "The location itself is fantastic, extremely secure and a world away from the likes of Kuta. 12 luxury hotels line up on a great beach front with a nice open plan shopping centre in the middle. ", "Overall a really nice place to bring the family for a week's break.\n", "\nI had before stayed at the Nusa Dua Beach Resort in March when I attended a nearby conference and enjoyed the pools, rooms and laid back and friendly service although there was definite room for improvement.", "Yet, on returning this week with my husband I can still only give this hotel 4 stars because there are two many lapses in staff professionalism and the F&B offerings in the Palace Club fall short of what one expects from a 5-star hotel in Nusa Dua given the competition. I would be happy to liaise with the hotel directly in regard to my comments.\n", "\nStaff very friendly and helpful. The rooms were well presented with a late variety of TV channels. Even though it was a resort, I found the prices to be a little high on most food and beverage for my liking. 5 mins down the road we got a Bintang for 1.95 compared to 6.9 so that was annoying however, when staying in a resort one can expect prices to be higher.", "The pool areas were great. 1 suggestion I would say is there needed to be more free entertainment on nightly. I've travelled to Vanuatu a few times and at the resorts they have live bands and traditional dancing which was all free and would be a great addition to anyones stay at the resort.", "\n", "\nNusa Dua Beach H&S is the best hotel in the area. It is the one with more green areas and gardens and beautiful buganvilles, other hotels could get too crowded but in NDBHS you get enough privacy and quite space. The pool is just few meters away from the beach ( in other hotels pool is not so close). The second pool is PERFECT for the whole family to enjoy, specially if you have small kids. Staff couldnt be more attentive and child friendly. We had an amazing vacation and have no complain at all! Also, its architecture makes it the most unique hotel, if you want to feel you are in Bali, go to NDBHS, it is beautiful!!!\n", "\nStaff and overall experience was great as well as the spa. Restaurants were great and we had a wonderfull stay. If I have to mention anything negative I would say that the check-out could be faster. Maybe a better system instead of paper tickets will do the job. ", " ", "\n", "\nWhether lazing by the lagoon pool or sipping a cocktail on the beach in the natural shade of trees overlooking the Indian Ocean or having a Balinese massage at the spa this hotel has a long list of indulgences that will take you to a level of relaxation that will make you feel like you have been on holidays forever!!!\n", "\nMy cousin and I had a marvelous time. The only facility we didn't use was the laundry. We dried things on the balcony! The breakfast buffet was to die for. The restaurants offered plenty of choice, the pools were great, the spa massages were absolutely wonderful. Best of all, the staff, friendly, helpful, and if they couldn't answer a question they would steer you to someone who could.", "\n", "\nThe hotel provided all that was required for an excellent three day break. All the F&B facilities provided excellent value for money along with wonderful food and friendly attentive service. It may be one of the oldest properties in Nusa Dua but it is one of the best!\n", "\nThis is a very big hotel on the beach with every thing laid on. There was really no need to leave the hotel. There were two wonderful pools with lovely casual restaurants close at hand. There was a huge selection at breakfast from fruit and juices to hot dishes and salads.", " ", " ", "\n", "\nMy husband and I just stayed at the Nusa Dua Beach Hotel for 8 nights and found it to be very good. We purchased an online deal through luxury escapes that included transfers, breakfasts, spa treatments, and a bunch of other meals and inclusions. I have visited Bali many times before however this was my first time in Nusa Dua; this area is perfect for a romantic couples trip or families (probably too quiet for singles- go to Seminyak or Legian)...Overall I don't have a bad word to say about the resort, it is a perfect escape for couples or families. The hotel is about 35 yrs old and is well maintained, the rooms were spacious and appointed in Balinese styling, we upgraded to a premier room which overlooked a beautiful part of the grounds.", "We accidently booked during school holidays however this didn't prove to be a huge issue as there was enough space and room at the pool/beach so that we weren't fighting for a beach chair or tables at the restaurants.", "The spa was very good. I had several treatments and I can highly recommend Buni as i think she gives the best massage! thanks Buni :)", "I will go back.\n", "\ndon\"t get me wrong we really enjoyed our stay at this hotel but after staying in a private villa in seminyak the week prior to staying here we found the hotel very expensive, over five dollars for a beer plus tax and plus a service fee, restaurants were ok with plenty of variety. hotel is located on a lovely beach which is kept clean by hotel staff, the other thing is your trapped in the resort unless you order a taxi to take you into town, if you want peace and quite and happy to lie around the pool all day than this place is fine.\n", "\nexcellent place to recharge the batteries in style and enjoy the culture and relaxed atmosphere of an excellent resort. The sunrises were great over the Island of Lombok and the staff were friendly and very helpful. I will be returning in the coming years", "\n", "\nWe had a great stay at the Nusa Dua Beach & Spa hotel. Very nice hotel facility, delicious food (you can choose between several restaurants), incredibly friendly staff. We will definitely come back again.", "\n", "\nPlusses were: Comfortable beds, good breakfast, good and many restaurants,large pools, fine garden, nice setting by the sea. Cleanliness of room not in the same standard (chairs little bit dirty). Friendly staff.", " ", " ", "\n", "\nThis was one of our best holidays ever, great resort.", "We are traveling a lot but this was really excellent, amazing hotel and perfect service, thanks.", "There attention for our wedding date was great.", "Definitely that we are coming back :-)", "Best regards,", "Patrick.", " ", "\n", "\nBeautiful hotel in fantastic location. Loved the pool areas, spa treatments, amazing gardens and very helpful friendly staff. This resort made our family holiday a wonderful positive experience and we will b back!\n", "\nThis was our third stay in the Palace Club and it was just terrific. ", "A little busier than on previous visits ( great for the hotel ) but I prefere it a little less so .It appeared that they were short staffed and although the wait staff did their best to cope with the extra guests it was a big ask .", "The setting and cleanliness of this property is a credit to all the staff and ground keepers..including the beach cleaners . ", "We still enjoyed our visit and look forward to returning for our next couple of weeks in February .It really does feel like seeing old friends !!", "\n", "\nThe room was nice and comfortable. Wonderful atmosphere. Most of the hotel staff were very kind and gentle. Therefore it was pity that the Spa treatment was lack of its skill compared to other Hotels.\n", "\nFrom our phone booking at Perth International on the day of travel, the reservation staff were exceptional in assisting our intended one night stay. The hotel is amazing and we enjoyed the traditional style that they have maintained. The food options were more than acceptable and the beach access is the best we have experienced in Bali. Above all though, the buffet breakfast was like nothing we have ever seen or experienced. Amazing! Thanks NDBH, we will be back.", " ", "\n", "\nAlthough we both got Bali Belly we still very much enjoyed our stay. We only ate at the Hotel as well. Room service was excellent as was the hospitality of all staff. The spa also very good and look forward to staying withyou again next year.\n", "\nWe stayed in the club Place suite. Rooms were excellent but perhaps slightly tired. Beautiful gardens and beach in easy reach. Highly recommend the Palace Club lounge,beautiful surroundings and even more beautiful staff. The extensive Cocktail list was the best we have ever encountered in any lounge. The afternoon tea was exceptional (excellent food), breakfast was without fault. The spa treatments and the massages were out of this world.We will be returning in the not to distant future.\n", "\nEgh. Finally took that long awaited break, excited to lap up luxury and get absolutely spoilt.", "What a HUGE disappointment, and may I say a RIP OFF.", "First of all, nusa dua is at least 40 minutes from anywhere that is worth going to. If you want to be stuck At the hotel and have no interest in sight seeing or shopping/dining then this is the place for you.", "However, at $25 for a decent meal (pool side toasted cheese sandwich and fries!!!) , I think I could have saved the cost of flights and stayed in Australia.", "Upon arrival, the room I was put in was depressing, filthy, small and mouldy. Was moved to a nicer room later.", "Further more, staying in nusa dua is synonymous with \"filthy rich\" so they charge you triple the price to get a ride into civilisation, and try to discourage you from using a meter taxi (so that you don't find out what it ACTULALLY would cost to get to seminyak, for example, where you will pay only $8 for a delicious meal, compared to $25 for an edible meal, at best, at the resort)", "The beach might as well be non existent as when the moon isn't full the tide is so far out, all you get is 500 meters of mangroves with sea urchins...", "As for the venue, it is out of date, shabby, and smells of sewerage.", "Staff can barely speak English, which, I would expect I from a budget hotel, not a 5 star resort.", "All the restaurants Are waaaay below any Kind of standard considering the ridiculous prices charged for the food. Again - a 3 star delivery at the most, with deluxe 5 star pricing.", "One night, upon returning from the disgusting buffet (charged $50, food was terrible), my daughter was so exhausted, just wanted to go to sleep, I open the room and find....a cot in the room. ?????? At first I thought I was in the wrong room. Called reception to notify them that as I have no babies, I don't see why there's a cot in the middle of the room, and obviously there's been a mix up as someone else is probably waiting for it. Also explained my 6yo is very tired and needs to sleep so could they please get it out ASAP so we can call it a night. Took 5 phone calls and 30 minutes to get someone to take it out. My room was 20 meters from the Lobby.... ", "Never again.", "Ps, the pool was amazing. That's the ONLY good thing.\n", "\nBeen there 5 times, very good service, good food, going back, everybody is so friendly, we stayed at club suit, fresh fruit delivered every day to your room. best time to go September, weather is just right", "\n", "\nBeautiful setting and location. Stayed here April this year and the service and food were very good. Stayed here again September this year and the service was not as good ( some misunderstandings due to poor English). The food in all of the restaurants was very good, but the Palace Club was not as good as in on our first stay. The Palace Club food was frequently cold, the breakfast menu was not as good. Overall, though wonderful hotel, Palce Club priviladges are good value, the rooms beautiful and spacious. Will come back.", "\n", "\nWe have been in Nusa Dua Beach Hotel many times and it's still Excellent every time we look to escape for holidays!", "Facilities are our prefered and very good for our Kids.", "We defineletly recomend it for families. Beach area is also very nice", "\n", "\nThis is my personal perception and experience and may easily differ from others.", "I returned to Australia today after nine nights at this resort.", "Often in life enjoyment is about 'people' and this experience emboldens that ideal. Staff make such a difference. More on this at the end.", "I stayed in a palace club suite with my wife and my son and wife with two young children in the family wing. We chose this hotel because of very good TripAdvisor family reviews.", "The Limo transfer from airport was excellent but we had to wait until after 5pm for a room. This was unacceptable as we were already sweating from the walk to the limousine and although the waiting area overlooked a very beautiful garden it was still three hours in heat and humidity not accustomed to and although the tea was very nice we just wanted a shower and to freshen up.", "Cocktails are 5:50pm to 7:00pm but unfortunately there was no tables left, so we were pretty disappointed with our start.", "Next day was much better, a very nice breakfast made so not by the food but the wonderfully caring staff. And here lies one 'sweet & sour' enigma, such wonderful staff but so much incompetence. Boiled eggs are either raw or hard given a four minute instruction. Bacon is awful, sausages worse. Fruit juices good, coffee good and teas strained and perfect. Forget toast and because although great marmalade and jams they have no idea of toast (unless you like conrete consistency). Cornflakes are good if you use the drawer and take out a large spoon, otherwise the wooden spoon provided provides one flake at a time. You then need to fill a glass with milk (at one drip per second) to take to your table to enable you to get some sugar on before the milk. All explained several times but they only do as instrucred, no common sense is allowed.", "But despite the food the ambiance is exceptional and the staff so kind and lovely. We both enjoyed it.", "My son and family had a great time. This really is a great place for little ones, sand shallow pools and Gecko club really good.", "In fact the setting is awesome with the shallow beach a few metres away, 150,000 Rupia per hour massages there and great snorkeling so inexpensive. My wife did 8am yoga three times and it was very, very good. Beach bar food and drinks are good value and good quality. It is a great location.", "About the location: Free shuttle bus to Bali Collection on the hour, nice supermarket an Frangipani restaurant was excellent, but this is more international than Balinese. Ten minutes walk from hotel is the Nusa Dua gate and here I found great shopping, Yanti the best massage ever, and the Tavern restaurant (4 star TripAdvisor). Now these guys not only have great food but drop you back at the hotel too. The new national golf course is awesome but expensive. $200 a round and $50 in club hire. Unfortunately $100 in lost golf balls for me too, gee it's so hard an so much wind and water. But it's a great experience.", "Back to the resort. Well get up before dawn to put a towel down early or sit on the grass. Yes the inconsiderates of Europe have reached Bali! But its not that important.", "I had to buy a lemon for gin and tonics on the odd time I went for cocktails, afternoon tea spoiled our dinner so we didn't bother.", "Son and family rated it 4 star for their family experience.", "Rooms were 'tired'. aircon pathetic and I gave up trying to get high speed internet after an hour with their contractor. Never got it but Wifi was good.", "But in reality the decor was great considering the wonderful Balinese architecture and gardens complemented the rooms.", "Last night getting a taxi was tough and the Samuri warrir at the front told us that it was always better to walk. Management decreed that a taxi dropping off a passenger could not be used and we had to book at the 'taxi counter' (a seemingly empty area), so we walked as usual. ", "Departure was not the Limo we had expected but it arrived ten minutes later than ordered and we managed to board our plane on-time, yet with concern.", "Wednesday was a cocktail evening with management. I must say that the assistant manager, Dermott, was impressive. I think he will be a great manager if not a much higher management position. Sadly, the manager Urs ( who I perceived to have significant similarities to \"Mr. Bean') appears to me to consider his hotel perfect and any suggestion on improvement to be the thoughts of heathens. ", "THis tells me that he listens to nobody, doesn't accept imperfections and anyone with that mindset will not make improvements in my experience.", "So sorry guys, great location, some lovely people and everything for it. ", "But people are the difference and the culture is set at the top management.", "Count me out whilst Urs lives in cloud cuckoo land.\n", "\nI really loved this resort. It was very big and grand yet had a lovely tropical feel with a Bali theme. Gorgeous pools and lovely room with balcony and views of ocean. Loved Nusa Dua and the white beach and blue water. ", "\n", "\nWe stayed at this hotel in September 2014 for our Wedding Anniversary trip. I have to say, it was everything you could expect and more. Prime location (On the beach), impeccable food (The breakfast buffet is superb) and service to match. The hotel and its grounds are truly beautiful and the pool is great too. The Fully stocked bathroom cabinet (Replenished daily) is a bonus.", "Drinks are a bit pricey and they seem to have a strange way of adding taxes and service charge to some stuff in advance and not others. Apart from that, We loved it. Location wise it's an easy walk along the beach path to the Bali Collection (Great Value Shopping and Restaurants)\n", "\nMy friend and I spent 5 nights at your resort and just flew home on October 3, 2014. We thoroughly enjoyed the beauty, service and feel of this resort. I am recommending this Hotel to everyone I know and will be back again soon. The people who served us were so friendly and lovely and the two massages I had were so relaxing and reviving. My only complaint is that I wish I had of stayed longer. See you soon.\n", "\nYou need to have a rack to hang wet bathers and hooks in the bathrooms to hang things on. Need more cupboard space in the bathroom. Would like to have free internet in the rooms.", "We were in Rooms 1213 and 1214 and the patios and chairs on the patios were not clean very disappointed with the patios. Need to put racks on the walls outside to hang our wet bathers.\n", "\nThe staff at Nusa Dua Resort were absolutely fantastic from the moment we arrived. We had a great stay here and would recommend it to anyone. Our 3 year old son enjoyed the swimming pools and the food. So a great place for a family holiday", " ", "\n", "\nThe resort lived up to our expectation in every way.It was a wonderful experience in every aspect be it the location, the aesthetics, the ever smiling courteous staff, the small thoughtful touches like personalised photograph, live music, tour services, spa services...I could go on :)", "The only improvement I can suggest is to expand the vegetarian food choice which was woefully limited despite the resort having a 6-7 restaurants. Being a vegetarian, I had a difficult time . The gigantic and wonderful breakfast spread bailed me out.\n", "\nI like the hotel a lot, because the overall experience is great and the staff is very attentive. but they should include the taxes and service fees in the prices in advance. Also, toothpaste and toothbrushes should be free in a five star hotel. ", " ", " ", "\n", "\nStaff were exceptionally helpful. Great facilities. The gardens were beautiful and well maintained. we liked the older style of the hotel which was reminiscent of the old Bali. My husband really enjoyed the squash courts and was able to get a game easily whenever he wanted at a good standard. The vouchers we received made the holiday affordable. we really enjoyed the quiet areas at the spa especially the pool.", "\n", "\nOverall great location friendly staff great service spa area and staff were great however some areas were a little outdated and in need of an update also perhaps somewhere to hang your wet clothes on outside on the balconies would be good. But as stated very enjoyable and great service by all whom we dealt with.\n", "\nWe are both in our 60's and have been coming to Bali on and off since the mid 1980's... this is trip number 21... Our last trip was in July 2014 and we focussed on SANUR 3-4 star hotels ... In the past we have always stayed at Seminyak, SANUR, or Kuta but this time we thought we might splash out and stay in a 5***** ... I cannot believe the contrast between Nusa Dua and other locations in Bali... It's like chalk and cheese - by far this 5***** resort has exceeded our expectations in all areas... A typical day here", "06:00 down to the 50m lap pool at the Spa for 20 laps - for the whole 8 days I was the only silly bugger up at that hour and had the pool to myself. ", "07:00 ish one of the best buffet breakfast spreads we have enjoyed anywhere in the world ", "08:30 ish nice leisurely 30-45 minute walk along the beach Boardwalk... NO HAWKERS allowed and everyone we passed was definitely in relaxed holiday mode.", "09:30 ish in the cool of the \"lobby area\" to do the emails and catch up on the news via the complimentary wifi.", "11:00 massage - in the Spa area anyway you like it for up to 1 hour...", "12:30 ish down to the In-house beach \"Chess Cafe\" for a quiet lunch and a cold Bintang (happy hour 16:00-19:00) ", "14:00 ish up to the room for a \"nana nap\" ", "16:00 ish catch the shuttle bus to the Bali Collection (5minutes max) for dinner from one of the 20+ specialty restaurants.. But make sure you do not miss the in-house outdoor dining and cultural show on Mondays and Wednesdays ...booking essential via reception... Great show and food and beverages selection (prices very reasonable for a 5*****)", "20:00 ish nice leisurely walk back to the hotel along a well lit road or alternately along the beach Boardwalk for some fresh sea breeze air (about 15-20 minutes max)", "20:30 ish nice quiet night cap at the lobby bar (happy hour 21:00 - 01:00", "The ambiance of the Nusa Dua Beach Hotel and Spa, the available free and user pays facilities, the cleanliness of the whole venue and the genuine friendliness of all the staff we encountered, from gardeners, security staff, restaurant staff, in fact the whole team made our stay nothing short of magnificent ... After our experiences enjoyed here it is now not feasible for us to return to anywhere other than the Nusa Dua area when next we stay in Bali... Thank you Nusa Dua Beach Hotel and Spa for opening our eyes to a different side of Bali ...you have made our stay in Bali the best ever...!\n", "\nI stayed here with my two year old and she absolutely loved the pools, beach and the little playground.", "Reception staff is very friendly and accommodating. We arrived a little early for check in but were allowed to get to our rooms straight away. This is a big help when you're traveling with toddlers. Check out is swift and efficient. No hassle at all, unlike my experience with some pretentious hotels. We needed a taxi to take us to the airport, and the concierge helped us call the cab. 5-10 minutes wait for the taxi to arrive. ", "As I mentioned before, the pools, beach and playground are great. They also have a kids club which we didn't try because we were happy to swim with the little ones. ", "Breakfast is great. The choice is excellent, couldn't fault it. They also have espresso machines, so I could enjoy a decent coffee with my breakfast. Baby chairs available, again great for families traveling with young kids. ", "At one point there was a cute little squirrel playing in our balcony, which was very adorable. ", "The only thing that marred what would have been a perfect stay was the fact that I got a smaller room than my sister (my room had no bathtub, hers did), although we paid the same price. They said that's because the rooms are connecting. I would have been happy with non-connecting rooms but the staff informed us that our rooms were already upgraded. I didn't want to make a big deal out of it so I let it go with slight disappointment. ", "Despite the room difference, we enjoyed our stay so much that we will definitely come back.\n", "\nHighly recommended for a family break! The property is really well maintained, clean and has all the 'resort' features a family needs. All staff were focussed on ensuring we had a great time. The food and live shows were a real treat.\n", "\nGreat hotel, very beautiful. Great staff, location was perfect. Easy access to local restaurants, shops, free shuttle to shopping mall. Hotels Balinese theme was fantastic. ", "Great info for excursions..\n", "\nStayed at Nusa Dua Beach Hotel recently with the Luxury Escapes Package. Great deal, Great place, rarely left resort.", "Staff were amazing, would do anything to help.", "Palace Club suite was a good size for us as we were travelling with a one year old.", "Access to the Palace Club was a great bonus, afternoon tea, a la carte breakfast, cocktail evenings etc.", "gardens and pools are immaculate", "Plenty of restaurants and bars on the grounds - can be expensive eating there though.\n", "\nTotally recommend the Balinese Restaurant excellent food and service. Hotel grounds and gardens beautifully maintained , great pool bar and good snacks to be had with your drinks. Nice beach restaurant called Chess and you can hire various water sports equipment. Good aqua fitness fun in the swimming pool in the mornings to be enjoyed. The spa is a real treat with a lovely relaxing area with pool and separate massage rooms. Great kids club with plenty of activities all day and a rest from the sun in a nice indoor play area. Thoroughly recommend the hotel for family holiday ....the only downside was having to pay for wifi in the room and all water around the pool had to be paid for ..... Staff and service was excellent !\n", "\nOverall a great stay in the resort. There were various options for dining in the resort. The downsides were 1) No wifi in room; and 2) Cleaing matters. There was cleaning bleach left at the basin area and we thought that's water. Our clothes accidentally in contact with that and was bleached.\n", "\nNice hotel with a good location and friendly service. Several pool options with a great lagoon pool for the kids.", "Negatives were that our room was so far from the pool area and replenishing of the room was not very thorough.", "Room was advertised as sleeping 4 but only had the king and a single bed.", "While it was a nice place, I did find that the balconies were a bit different in that it was just a handrail separating them with no privacy. With this in mind, better security on the balcony doors would be recommended. ", " ", "\n", "\nOverall a very good experience. Good atmosphere , very good location , good service and very good value. Breakfasts were great and overall we rated it as a great holiday. Only downside we found was the cleaning. Toilets were not cleaned to a satisfactory level.\n", "\nFirst time in Bali, thoroughly enjoyed our stay. The facilities were top notch and the food to match. The staff were all welcoming and friendly. The rooms were clean and spacious and serviced appropriately. Loved the spa and hopefully return soon.", "Lin McDermott", "\n", "\nOur third time at this beautiful resort, and it certainly gets better and better. The new chef and F&B director have made eating there an absolute incredible experience, every meal at any of the 5 restaurants is a winner ! The pools are lovely, great now that you can get bar/food service by the pools and beach areas - the beach is clean and private , and the gardens a delight to walk in. The staff , each and everyone, are polite and helpful - we were so pleased that the driver who fetched us from the airport made a point of saying 'welcome home' to us, a personal greeting that says a lot. The driver who took us back to the airport asked us if we were happy with our holiday, thanked us for staying at NDBH - and said he hoped to see us again soon. The buffet dinners - we went to all 3 - are not only good value for money, but beautifully presented with wonderful entertainment. Proximity to Bali Collection is a short walk , there are also bicycles to hire at the Spa. The daily activities organised by the hotel are also really well organised and the staff friendly and knowledgeable.", "Only things I could fault were the toilet in our room which had a faulty flushing system, the water ran consistently - and the aircon is set too low and a tad on the chilly side, and it doesn't change temperature. Otherwise I would highly recommend staying at NDBH.\n", "\nWe were picked up from airport as promised but when we arrived our room had not been booked. This was quickly sorted and we were given a room for the day and were able to upgrade to an adjoining suite on the ground floor near kids club as requested when the room was ready, which was perfect when traveling with 2 young kids. My children loved the Gecko Kids club and sometimes wanted to stay longer when we went to collect them. The Staff there are excellent. The pools are extremely clean and so is the beach. My children loved to see the first turtle hatch in your Turtle Hatchery on the last day of our stay. Would highly recommend. Thank you and we look forward to returning next year.\n", "\nWe absolutely loved our stay at the Nusa Dua hotel. Staff were fantastic, so friendly and always smiling and greeting you. Our room with a pool view was most enjoyable. The location and the beach couldn't be better. We definitely will be back to stay again. They made our 50th Wedding Anniversary one to remember.\n", "\nFollowing a hectic tour of China the Nusa Dua Beach hotel was just what we needed th relax and unwind with staff who attend to your every need great hotel the spa was also very relaxing, on site restaurants were good but quite expensive", "\n", "\nVery nice hotel with friendly staff, a lot of services, 2 nice pools and a beautiful view when sitting on the beach. Rooms are spacious and luxurious, no comment on that!", "However, it's important to be aware of the fact that the prices for beverages and food as well as for the services (watersports, massages, organised trips) are just ridiculous and where actually insulting, having travelled around most of Bali and Java for 2 weeks before arriving at the hotel. You easily pay 3 euros for a simple coke, excluding the infamous '20% service charge and government tax'. Food is nice, but not worth the money. The solution? We rented a scooter for 2 days and went to the nearby town for diner (about 1/4th of the hotels price) and massages (300.000IRP for 2 massages, a manicure and pedicure while the hotel charges 550.000 for one) :-). And you're probably better off there as well in terms of quality!", "In short: if you're willing to spend that much and are the stay-in-hotel kind of people, the hotel is just awesome. For the young more adventurous people like us, I suggest to enjoy the pool and room and get out as soon as you're thinking about doing or eating something :-).", "Be prepared to see a lot of British families there as well. I don't know why, but the UK doesn't seem to be in a financial crisis!\n", "\nFantastic Resort, great spa, hard to fault anything in regards to the facilities or location. Breakfast staff wonderful but day staff in restaurants did not have the same welcoming atmosphere. Would have given 5 out of 5 if not for this. Definately will return in future.\n", "\nIt was our 3rd stay in the hotel. We love the location and atmosphere. This time", "breakfast was better than before, fantastic variety, especially of fruit.", "We were a bit disappointed with spa; dark brown towels with traces of oil smell\n", "\nThis was my second visit within 9 months and it was fabulous. The staff, facilities. location, room made our second visit more memorable than the first which was great hence our return... we look forward to coming back soon!\n", "\nMagnificent resort with all that one could ask for, beautiful location with warm, friendly and helpful personnel. Service and selection at all of the restaurants was superb and the breakfast selection is one of the best I have ever experienced.", " ", "\n", "\nWe thoroughly enjoyed our stay at the hotel. The staff were all extremely friendly and helpful!", "We would would certainly recommend this hotel for anyone wishing to have a relaxing yet enjoyable family holiday!", " ", "\n", "\nAs a first time trip to Bali, this holiday was fantastic for the whole family,great location, Excellent buffet breakfast, we had adjoining rooms to our 13 & 15 year olds who also were impressed. Only complaint would be didn't book for long enough (8 days)", "\n", "\nElizabeth Duggan Sep 26 2014", "What a wonderful place Nusa Dua Beach Hotel and Spa was Our stay was so relaxing and enjoyable. The staff and facilities were A1 Everything you needed was within a short walk pool ,restaurants and bars.All the staff were very friendly\n", "\nJust arrived home from 7 nights in the Palace Club. I stay at this resort on a regular basis (3 times a year), purely because it gives me what I need and expect from a luxury hotel. The first 4 nights we spent in Seminyak as we also do business in Bali so by the time I hit Nusa Dua I want to relax and unwind.", "Very busy at the hotel this time as a lot of people took up the Luxury escape package so it had more families in the club than usual but this was not a problem.", "Although this hotel is def. an older style compared with the more contemporary resorts, it feels like Bali. ", "The Palace Club is fantastic and well worth the money. What truly makes it is the staff. I could pick out a few names but I think this would be unfair to the rest of the staff as they all are so professional and friendly to all guests.", "There have been a few changes in the club since April when I was here last. Thankfully they offer a small buffet at night instead of table service which works much better, especially because it so much busier now the staff can concentrate on their guests. However, that was until our last night when out of the blue they went back to table service which was a disaster. The staff could not keep up with service and the guests were getting annoyed because of the time they had to wait for their drinks. Please stick with the buffet table it works much better.", "Another small point was the pancakes. I love my banana pancake so was disappointed when told this was no longer on the menu unless you want a healthier egg white one(yuk). Please bring back the original and I will do a longer run in the mornings to burn off the extra kilos.", "Overall this resort is excellent value for money, and now with the the new toll way it is easy to get a taxi to Seminyak for some excitement if you get bored.", "You wont be disappointed.\n", "\nOverall we thoroughly enjoyed our 8 night stay at this Resort. The grounds are superb, the Premier rooms comfortable and the breakfast delicious with a wonderful variety of fresh fruits and cooked dishes to choose from. On the down side, the meals at all the restaurants are expensive which meant dining elsewhere, most nights. The pools and Spa were excellent, although the lack of sun lounges poolside needs to be addressed, with guests \"reserving\" them early by placing towels and bags there. The wildlife at the Hotel and care taken by staff to feed and look after them was great to see, especially the turtle who came up to lay her eggs beside our table at the Restaurant on our last night, much to the delight of our grandchildren . The pillows in our room were the best I have ever slept on and would love to source some for home! 18 of our family and friends all stayed here for our son's wedding which was held at Uluwatu.", "We would definitely stay at Nusa Dua Beach Hotel & Spa again for a relaxing holiday.\n", "\nThis was my first time in Bali. From the moment I arrived I was impressed. The staff were friendly and attentive. I travelled with our extended family on ten people of various ages. I didn't hear a negative comment. I would definately recommend it to friends.\n", "\nStayed here with our 3 children aged 5yrs, 3yrs, 4 mths and it was great. Perfect room set up with two adjoining rooms. Kids loved the pools and kids club. Nanny service was very good and reasonably priced. Overall had an amazing holiday\n", "\nWe stayed in a Palace Club room for 8 nights and wish we had of stayed for 3 weeks. There are not many hotels that I would say I am looking forward to returning to, but the Nusa Dua Beach is definitely one of these. ", "Checking in at the Palace Club reception was relaxing, effortless and civilised. The ground floor room was in traditional décor and was lovely. The size including the bathroom was good and was fully equipped. Our room overlooked the beautiful gardens which had a pond and some amusing resident ducks! It was so relaxing sitting on the terrace listening to the sound of the waterfalls. ", "The Palace Club lounge was literally a 10 second walk from our room and provided all day soft drinks, breakfast, afternoon tea and evening drinks and canapés. The service was faultless and the staff were lovely as they could not do enough for you. The Place Club room is definitely worth the upgrade, if not just for the lounge access.", "The hotel was very traditional, well kept and the front entrance was stunning. It's certainly not like the western style modern hotels down the road in Nusa Dua. The beach was very clean, long and sandy and a nice place to relax in the daytime. The sea was warm and shallow to swim in but did have a fair bit of seaweed as you ventured out. ", "We ate 1 night in the Chess restaurant and had a table on the beach which was very nice. The food was delicious and reasonable in value but drinks were a bit expensive in the hotel compared to the restaurants down the road at the Bali Collection. ", "We were given a complimentary massage in the Spa and this was just the ticket for de stressing. The spa had its own pool which looked very inviting. The hotel had 2 other pools, one of them had a swim up bar. We spent most of the time on the beach and in the sea. ", "The hotel has a cash point which is handy for getting the currency, There is a complimentary bus that runs to the Bali Collections or you could walk it in 15 minutes, but the last bus leaves at 10pm. Use Bluebird taxis as these are metered and it cost 90,000 IDR (5 quid) to get to Kuta. After visiting Kuta we could not wait to come back to the peace and nice surroundings of Nusa Dua. If you want to see the sunsets then head for Jimbaran or Uluwatu which are both about 30 minutes away in a taxi. I would probably say the only disadvantage of the hotel is that you don't see any sunsets.", "We done a day tour with Bali Essential Tours and had Kadek as our guide. This was a great day and would definitely ask for Kadek. ", "The area of Nusa is immaculate and well maintained. The Nusa Dua Beach Hotel is one of the nicest hotels I have stayed in and the staff are brilliant. I would definitely recommend this hotel. Missing Bali already!\n", "\nWe chose the Resort to celebrate our 50th W/Anniversary,it exceeded", "our highest expectations in all aspects.The management and staff combined to make our Special day one we will never forget-Great Time\n", "\nWe booked an 8 night package through Luxury Escapes. The resort was beautiful and maintained to a very high standard. Our travel style is very much non stop with plenty of exploring... Nusa Dua Beach Hotel provided an ideal base for this where we could come back to a comfy room. Breakfast was fantastic and a great way to start the day. The squirrels were an unexpected favourite.. we loved watching them around the resort. The service was outstanding... each and every employee was very helpful and friendly. I can appreciate this resort would also be perfect for those who are after a much more relaxed holiday than what we had. The pool and beach were very popular with couples and families alike.\n", "\nIf you want to holiday at a resort where staff make you feel part of the family in tropical paradise settings. Nusa Dua beach resort and spa is the place to be,brilliant gardens and pools, rooms give a real Bali experience and plenty of high class food options", "\n", "\nA really fantastic holiday in this beautiful & relaxing resort. Great for our young kiddies. The pools were varied, the proximity to the lovely beach was very very close & the Spa was top notch. Very enjoyable stay.", " ", "\n", "\nThis is a great place to relax. Beach is fine, the sea is warm and calm, although very shallow during low tide, wonderful staff and very good restaurants. It's recently renovated, the landscaping is beautiful and the squirrels funny. Only downside (for a 5-star resort) is that the rooms are relatively small. And, when you want to get a good taste of Bali, Nusa Dua is not very authentic. But for the rest: lay back and enjoy.\n", "\nThe hotel exceeded our expectations in almost every aspect. Although older and maybe more worn than some of it's newer counterparts (it's 30 years old), the hotel retains more Balinese charm and for us was a far better choice than some of the more sterile (and expensive) brands further along the beach.", "For those staying 8 days or more, the Indulgence package is a no-brainer and fantastic value!. Breakfasts were awesome and service was first class. Even al a carte restaurants were very reasonably priced with great food and great and friendly Balinese service", "One small niggle was the daily scramble for pool or beach loungers - often arriving after a leisurely breakfast to find virtually all of them reserved with towels but not being used - not what is expected of a 5 start property - management needs to sort it out.\n", "\nWe had a very restful time at the resort, it has the most beautiful grounds.", "The staff were very friendly and most helpful!", "The club facilities and staff were excellent, the afternoon teas a delight!", "The evening cocktails were a great experience with the chance to meet other guests. Overall a wonderful experience, we will be back!\n", "\nVery nice resport suitable for all. Family with children, young and elderly couples. All restaurangs are excellent including beakfest. ", "Very silent area. The resport is recommendable even if the beach not 100%. Shallow water due to tide.\n", "\nBuilt around 1983 it's becomming a little jayed but if you want a resort style getaway it is all that you need. A safe enviroment for kids and adults with all the facilities that you would want in a place like Bali. Staff very polite and attentive, several restaurants and a buffet breakfast included, and theme nights also. A safe beach to swim and a walking/running path along the beach between all the resorts, along with several pools which cater for kids and adults. I would recommend this resort to familys and friends staying together.\n", "\nVery good location, just 15min-walk to Bali Collection. Stayed in a Palace Club room. Dressing room was a bit too small for 2 adults. Breakfast in the Palace Club lounge was very peaceful but the pancake there was so disappointing, far less my avarage. Other breakfast buffet was very crowded and noisy with kids, but served what we needed.", "As some reviews said, all deck-chairs with shade (parasol) around pools were all occupied with towels or books even at 08:00 in the morning. Wasn't it a nasty sight? Very unpleasant.", "However, it was a good stay there overall, no, I was more than happier, because I was too careless that I dropped my purse when I checked out at the Palace Club Lounge. But one of the hotel stuff, Mr. Sugi picked it up and kept. Nothing was lost when I returned to the hotel collect my laggages. I really appreciated their sincerity.\n", "\nStayed at this hotel, in Palace Club. Best hotel have ever stayed at, treated like royalty. Staff amazing, nothing too much trouble. Beautiful surroundings, awesome facilities. Would definitely HIGHLY recommend, and more importantly, will definitely return. Can't wait to come back again!!!", " Buffet breakfast, buffet afternoon tea, pre dinner cocktails FREE! Delicious!!\n", "\nBest value 5 star family escape ever. Great service, excellent facilities and great food. Location is also ideal if you want a resort style experience. I would highly recommend this to anyone wanting a great family holiday.", " ", "\n", "\nThis resort ticks all the boxes, fantastic facilities, beautiful surrounds, wonderful staff, great food, what else could you want. We holiday in Bali every year, sometimes twice a year and have done for nearly 20 year's, I can honestly say this was one of our nicest trips. Definitely a 10/10.", " ", "\n", "\nA Truly wonderful Balinese experience. This was our first visit to Bali and wanting a very restful relaxing holiday. Nusa Dua beach Hotel provided all and more. My only negative was that pool beds were taken very early in the morning by people \"reserving\" them well before breakfast. This is not a practice I would allow.\n", "\nFor a hotel established in the 80's this place is certainly keeping up with the times while maintaining the traditional Balinese feel with amazing structures and gardens. Attentive and friendly staff, rooms in very good shape and an abundance of poolside and beachside areas we could not have been happier with our stay. Despite being quite busy, it never really felt crowded. Upgrade to the club area, it's worth it. Quieter and more pleasant breakfast, great way to cool down in the arvo with a drink and canapes, plus pre-dinner happy hour is ideal. Will certainly be back, just not soon enough!\n", "\nWe stayed for one week as a couple with our 9 month old baby boy. It was a lovely relaxing place with extremely helpful and cheerful staff. The hotel is in the older Balinese style, we found it to have a timeless charm with all the bells and whistles required. The buffet breakfast every morning was top quality and has something for everyone. The spa treatment I had was delightful. My husband had a birthday during our stay and we were surprised by a delicious birthday cake. Great location and will definitely recommend to others.\n", "\nHaving stayed here previously at the Palace Club, we found the service of the older staff was to be as expected, but the younger staff were slightly lackadaisical in their attention. The food at Chess is very ordinary and the menu badly needs updating. However, we did as always enjoy our stay and the weather was perfect during the 2 weeks.\n", "\nMy husband and I stayed here when our daughter was just 6 weeks old. Traveling from Jakarta, we were sooo pleased with the outlay of the hotel and its location along the beach promenade. Strolling her to sleep along the ocean was a dream come true! The pools at the hotel are wonderful, with a variety to choose from and there are several dining options as well. We had good food at all the spots, though perhaps a bit pricey. The breakfast was amazing and we really, really appreciated the homemade granola bars! I had a pedicure done and was sad to find out it had to take place in the dated salon, and not the spa (as the spa is beautiful). The pedicure was three times what I would normally pay, but I must say, the quality was really good.\n", "\nThis was my first trip to Bali & I have to admit I was not keen on going, we spent 8 days relaxing here with other family & friends what a magic place staff were always polite & helpful, pools always clean & the walk along the gardens & beach front was amazing.", "The weather was perfect & it was the first time in years that I completely forgot about work & home while on holiday. Still daydreaming about this place can't wait to go back.", "The WiFi is available all round the resort except in the rooms unless you pay I never felt the need to have it in my room as I was on holiday\n", "\nThe gardens and Balinese settings for this hotel are stunning but tranquil. A perfect place for a relaxing holiday. The bustle of Bali is only a taxi ride way. It is a hotel we would like to return to.\n", "\nI have been to this hotel several times and have another trip booked in 6 weeks time. The location is a dream, beautiful beach and the facilities at the hotel are wonderful. It is very quiet so if you like to party hard its probably not for you. The staff are wonderful and very attentive especially Anita in the breakfast area. Best selection of food I have seen in any hotel. Perfect place to unwind and relax.", "\n", "\nThis resort lived up to my expectations. Rooms lovely,position great, great staff, great food and walking distance to all other resorts if you feel like a change. Highly recommended to anyone needing complete stress free holiday. ", "\n", "\nHard getting up in night because have to stumble around in the dark to get to the central switch to turn on lighting, only problem if you do that the whole room lights up like a christmas tree which wakes other sleeping people! This was difficult! I opened fridge door to give some light to the bathroom.", "\n", "\nOnly complaint I had during our stay was inability to obtain WiFi reception in our room. It was very good in other areas. This was disappointing and needs to be improved. Games room needs some attention. for example only 3 darts in total and of of different size and makes. ", "\n", "\nbeautiful resort, always friendly excellent service, Nick had an allergic reation to something (nothing to do with the resort) They had a doctor to him within 15 minutes at 5.30 am and then sent a get well card, flowers and bowl of fruit to our room. great resort for families and couples. away from the rat race of Kuta but still easy and cheap to get into Kuta in about 20 - 30 minutes along new toll road. Great markets in Nusa Dua and a huge modern shopping centre all within walking distance ", "this resort has fantastic packages on Cudo. Amazing value. Would highly recommend and will definatley return. Rooms could do with an upgrade but still very good", "\n", "\nI loved everything about this hotel. The grounds and facilities are spectacular and extensive. The staff were always attentive and eager to please. The buffet breakfast was the best that I have had with a great variety of cuisines. It has it's own section of beach which is decked out with beach chairs, the only draw back is that everyone reserves them with towels so unless you get in early you miss out. The beach walk is impressive with a long strip of 5 star resorts and it has a nice relaxing feel. The beach is good when it is high tide but during low tide there is no chance to swim. You are really limited to what you do outside the resort and surrounding areas as there is not a great deal of street shopping or dining however it is a 10 minute walk along the beach strip to The Bali Collection where there are shops and restaurants, more pricey than Kuta or Legian.", "Overall, a fantastic relaxing holiday but don't expect the real Bali here as you are isolated from reality.", "Highly recommend for honeymooners and familys.\n", "\nThe Hotel", "Wow factor on arrival with beautiful grounds and Balinese architecture. Lovely welcome at reception and delighted with our room (2145) which was above our expectations. Well decorated and designed bedroom with great walk in shower in the bathroom. They had added some lovely touches to our room as we had advised in advance that it was our honeymoon...roses, fresh fruit, towel designs etc. Made us feel very special! Breakfast was wonderful....best choice ever ", "and something for all tastes/ nationalities...yum! The Hotel Manager came to say hello to us at breakfast one morning, lovely guy who clearly takes great pride in his property and guest service. ", "Location", "The hotel is situated on a good stretch of beach which is kept spotlessly clean. We enjoyed relaxing there for the duration on our holiday. We were very lucky to see a turtle laying eggs on the beach one evening and the staff took great care to check she was OK and then ensure her eggs were kept safe prior to hatching. It is a short walk to the Bali Collection - turn to the right at the beach side of the hotel and keep walking. Whilst the hotel runs a shuttle bus, we found this to be a pleasant walk and enjoyed the people/ hotel watching en route! ", "Places To Try ", "There is a nice park at the headland along towards the Bali Collection which is a memorial to those who died in the Bali bombing. Worth an early evening stroll to see the sunset. ", "We had our best meals in Frangipani and Ocean in the Bali Collection - very tasty and reasonable. ", "Overall a great relaxing break in a safe, well kept hotel. Thanks to you all!\n", "\nCame back here for the first time since the early nineties with a little trepidation but need not have worried. Palace club suite the way to go with 2 large rooms, a separate bathroom for the lounge, dual opening on to garden balcony. The gardens here are the best we have seen in Bali and you get a great sense of space Food at the restaurants good. The club serves drinks each evening in an area facing the gardens. Beach is great and lap pool fantastic. A good gym and the spa was great.", "The place exudes Bali design and culture and staff are super attentive and friendly.", "Wonderful place to chill out.\n", "\nDuring my stay for the weekend in July with family, we had a great lunch at Chess Restaurant, we enjoyed the food, friendly staff, nice garden, beautiful beach. Plenty of space for relax to stay under the shadow of the tree and umbrella to avoid the heat from the sun. We are falling in love with this hotel and will always be our place to stay in Nusa Dua. Thank you Nusa Dua Beach Hotel & Spa for keeping the great lunch and services.\n", "\nNice Hotel, good Spa and very good food.", "The service at the Balinese restaurant its wonderful! Thank you Miss ADE :-)", "Not enough beds on the beach !!! Some had to lay on the ground! :-(", "The breakfast its very busy, this could be improved... people will have a relaxed start in the day and not that trouble...\n", "\nYour dinners were fantastic, mainly seafood bbQ but I believe there should have been aliitle bit more meats etc..., to cater for the people who do not eat seafood other wise everything from breakfast, room service etc.., was really great. Thank you and all your staff for making our stay a great one, see you again. Maria and Stefan Hrehoresin", "\n", "\nRecently visited Bali and stayed at a few places but ended this trip at Nusa Dua Beach hotel - was not disappointed. Upgraded to a Premium view room with a view of the ocean which was ideal. The hotel itself was beautiful, welcoming and very important very clean! The breakfast was wonderful and the restaurants, especially the Asian one (forgot the name) was lovely. Was sad to leave this place but had too...would love to go back one day.\n", "\nStayed 7 nights for part of our honeymoon. We were made very welcome and they pampered us all the time. The breakfast needs special mention as the variety and quality is excellent in a lovely setting. This hotel is perfectly positioned with excellent beach. They clean it every day and the hawkers are polite & closely monitored. Evening walks along the sea front are lovely with a stop at the many bars and restaurants even before you arrive are Bali Collection. Don't take the shuttle bus as it is a nice 15-20 minute walk. Most restaurants will offer you a taxi ride back if needed, but the walk is safe (police are stationed at regular intervals) and helps the lovely food go down.", "We have no hesitation in recommending this lovely hotel, made better by the attentive and courteous staff. You will not be sorry if you choose to stay here.\n", "\nJust returned from a stay at Nusa Dua Beach hotel, the hotel surroundings are fantastic and facilities great. Ideal location for relaxing on the beach or by the pool and a good variety of food/drink offered. Short walk from Bali Collection, although it took us a few attempts to find the shortest route there! All the staff were very helpful and friendly but get to the breakfast buffet early for the best selections - an amazing variety of choice! Didn't have time to try the spa but on a return trip would definitely try it.\n", "\nwe requested a double room and got two single beds..very annoying..that was also a premier room (so extra charge)..beds were not comfortable..breakfast food was not great, very average..overall the resort is very old and need to renovate rooms and pools area..the restaurants are very priced..staff are all old and very slow..service standard wasn't awesome..location is great and has great beach..lot of chairs on beach as well..\n", "\nBeautiful hotel / surrounding and great spa facilities. Staff are very courteous. Good food although limited options for vegetarians. Evening entertainment is a plus. Expect high prices. Overall great place!!", "\n", "\nAs a family of four who have traveled with our kids all around the Asia/ Pacific region, we have never experienced such kind, genuine and attentive staff in any hotel-I can't speak anymore highly about the entire team at this hotel. The value for many of all the add-ons was remarkable. The spa treatments were out of this world! All three theme dinners were unbelievable. Simply the best breakfast in all of Bali! Great facilities especially the gym and pools. Great location with a short journey to some amazing restaurants in Tangung Benoa. Also a short walk to Bali Continental shopping centre and a $3 taxi journey to the local shopping market. The gardens are spectacular. Only 2 improvement points are that the FOH staff need to explain all the great facilities available to guests-like the jacuzzi, free shuttle etc on arrival and the theme dance/dinners need a synopsis at the start. Outstanding!\n", "\nJust back from Nusa Dua Beach Hotel & Spa where we spent a wonderful 8 nights. Service and food great and the inclusions in the package were fantastic value. Bar prices a bit too expensive, All else A1.\n", "\nWe stayed here for a week in September and had such a relaxing time, preferring this time to stay in a quieter area. The resort has everything you need and its size makes it feel pleasantly uncrowded. The facilities were great and we enjoyed tennis, squash and the water activities. I was a little apprehensive that 2 teenagers might find Nusa Dua a little boring, but not so. It turned out to be a great break for them. The staff were incredibly friendly and helpful with everything we needed. A cautionary note about arriving in Bali; we have always used the Visa Express service, however this is not available at the moment and our 1 hr 45 min journey through customs, with upwards of 2,000 other travellers was not a pleasant experience. The hotel staff were waiting for us when we cleared customs, so from that point on everything was wonderful.\n", "\nWe are currently staying at this hotel for 12 nights and can honestly say that up to this point our hotel experience has been fantastic. The staff are friendly and go out of their way to make your stay one to remember. The hotel and grounds are impeccable. The hotel is not modern but rather luxurious and tradional. It offers everything that you could ask for. The rooms are fantastic. Service gets a true ten out ten. ", "I travel to nusa Dua every six months and can honestly say that out of my past stays in various hotels, I shall be returning to the Nusa Dua Beach Hotel from now on. It ticks all the boxes. ", "To all the staff, thanks for making this resort so special.", "Selwyn", "Perth Australia\n", "\nAble to relax and unwind by the pool bar. Staff were friendly and attentive. Pool was way too warm but water activities were awesome. Buffets were cool and breakfast was always filling! Spa was amazing\n", "\nGreat location with good swimming beach at the doorstep and good service with drinks and food delivered under the trees.", " Great atmosphere and all staff very friendly and helpful. ", " Will definitely be back next year.\n", "\nOverall our stay was great. Staff are lovely and very helpful. Food was good with plenty of choice. The hotel grounds are beautiful. Spa was well worth the visit. Our only problems were our airport transfer did not arrive and we had to make our own way to the hotel and the pools are lovely but because people put their towels out on the chairs really early in the morning and reserve them for the day, its impossible to get a chair after about 8.0 in the morning. This needs to be addresssed by the hotel as there would be enough to go around if they were controlled more effectively. The pool could be empty and you still can't get a chair as people leave their things there and then just come and go thru the day as they please. A lot of frustrated guests around the pool area.\n", "\nFor a hotel established in the 80's this place is certainly keeping up with the times while maintaining the traditional Balinese feel with amazing structures and gardens. Attentive and friendly staff, rooms in very good shape and an abundance of poolside and beachside areas we could not have been happier with our stay. Despite being quite busy, it never really felt crowded. Upgrade to the club area, it's worth it. Quieter and more pleasant breakfast, great way to cool down in the arvo with a drink and canapes, plus pre-dinner happy hour is ideal. Will certainly be back, just not soon enough!\n", "\n", " ", "service was exelent dinning i was very disappointed with I tried 3 of your ", "resterants but the food was not up to my spectations but I would definitey", "return again pool bar the food was excellent breckfasts wher also excellent\n", "\nWe found all staff to be happy, friendly and most attentive, always very obliging with any requests.", "We enjoyed the activities available to guests as well as the excellent spa services. The extensive range of food provided for breakfast and especially the three theme nights was outstanding. All up, a very peaceful and relaxing resort which ticked all the right boxes for us. Would love to come again.\n", "\nBeautiful location right by the sea. Good range of restaurants including a variety of specialty dinners with Balinese dances, good spa, lovely grounds and swimming pools. Lovely place for a lazy relaxing holiday.", "\n", "\nA great family holiday from the beginning to end! The pools are fantastic, the staff are beautiful and friendly, the beach is clean and the whole 'strip' of Nusa Dua is beautiful and accessible. My only 'need' was some more affordable laundry options as travelling with 3 children (4, 6 & 8 yo). Also, whilst the kids club is great (and free!!), the facilities were small with limited options for the 6 & 8 year old. These are minor downfalls as we will definitely be back; loved it!\n", "\nThe resort exceeded our expectations, we celebrated our 40th wedding anniversary during our stay and were pleasantly surprised by being given a room upgrade including a welcomming glass of bubbly and flowers to kick our holiday off. A spacious room, huge ensuite with rooms being serviced a number of times during the day. Food and beverage prices at the high end cmpared to restaurants outside the resort, however, still more affordable than anything back home in similar hotels. Staff were exceptional, friendly and helpful with nothing being too much trouble. Will definitely be returning soon.\n", "\nI highly recommend this property to stay in South Bali, once you are done in Kuta. Very well maintained, amiable hotel staff, beauty of the nature, private beach, serenity and what not.. It's a perfect place to stay for honeymoon couples\n", "\nThe resort was wonderful, the staff were very friendly and always willing to help. The restaurants were lovely with plenty of food options available on site. The location is great - thank you for a relaxing holiday.\n", "\nFriendly, attentive staff, always smiling. No request too hard. This was my second time in this hotel. Would definitely return. Good size rooms. Excellent spa facilities. Only minor grumble would be the price of drinks. I think they lose a lot on custom due to this. However they have no problem in people drinking their own alcohol.\n", "\nStaff was so helpful and attentive. Everyone so approachable. Hotel so characterful, so 'balinese', beautiful gardens, peaceful, meals on the beach, lap pool - 10 pts. Waiters etc felt like family, so warm and caring. people in charge, managers etc were keen to check that everything was going well for us. Can't wait to get back.", "\n", "\nYou know this feeling when you see fotos of your hotel and after arriving you recognize that these were made nice to cover the disaster of the hotel?", "Well this is not going to happen n Nusa Dua Beach Hotel!", "I have to be honest, I just love this hotel. Surely it is one of the best in Nusa Dua. ", "First of all the staff is very kind, polite and really helpful. I have never had this kind of service- perfect!", "The Beach is clean and really nice. The food is very good and the choice during breakfast is great.", "The rooms are very comfortable and clean.", "The Hotel Spa has the best prices in the area (these are simply fair)", "We have spent 3 weeks in this hotel and we are surelly coming back!\n", "\nGeneral:", "Hotel makes a very good first impression.", "Room:", "Is well equipt and every thing is available. The temperatur of air condition is not adjustable.", "Bathroom:", "The mirror for the basin is installed on a sliding door which is not realy working. After taking a shower most of the Bathroom floor is completly wet.", "Breakfast:", "The buffet has everything what you expact, from western style to asian style. At the \"rush hour\" to many guest are at the same time at the buffet. If you are looking for a relaxing breakfast, that is the wrong place. Caused be the amount of people, after first use of the table, the table is not cleanded in the way you will expect it for a hotel like this.", "Restaurants:", "All of the Hotel restaurants have a very good menu and the qualtiy is although very good.\n", "\nOverall a comfortable and authentic place to stay. Easy to relax. Helpful staff. Food and beverage prices at the high end compared to general restaurant meals in Bali -prices were more like dining out in Australia.\n", "\nThe feeling of being someone special, started when we were picked up the airport. The staff in the Palace Club always treated as if we were the most important people in the Club. The ambience of the place met our expectations for our deluxe escape. Squirrels playing in the trees, the Asian ducks running around the lake and coming up for their breakfast and the majestic white crane stalking fish in the lake, took the senses to that place we came for. Just a beautiful place\n", "\nWe thoroughly enjoyed our holiday at this hotel and hardly ever left the poolside which was just great. Our kids had a ball and we were actually able to relax in beautiful surroundings. The only negative was that food and drinks were expensive but then again it is a 5 star hotel.\n", "\nHaving had our honeymoon in Bali 30 years ago we decided to return and so glad we chose the Nusa Dua Beach Hotel. Absolutely beautiful resort, great room and wonderful staff. Highly recommended will return again next year.", "\n", "\nWe travelled as a family and stayed for 4 nights at Nusa Dua Beach Hotel. The location itself is good, as is the staff who are friendly and helpful. The hotel amenities itself (pool, garden, spa) is also great. However, the rooms themselves are old and in need of a major renovation. The floor in the room are parquetry and badly scratched. The bathroom itself is small and I was quite surprised that we had no bath tub in the room.The chairs outside on the balcony are also dirty with mould growing on the cushion seat covers. As we strolled down the long stretch of beach (Westin and Laguna by Westin were next door), I couldn't help but look on in envy of their resort facilities and rooms where our friends were staying. We also managed to visit Ayana and if Ayana in Jimbaran Bay is a five star resort, then Nusa Dua Beach hotel is a 3 star at best!\n", "\nWe stayed at the hotel for a week in August with my husband and two young kids and the hotel exceeded our expectations.", "The hotel was beautifully appointed, rooms and common areas were very clean and had an authentic Bali atmosphere. The staff was very attentive and polite. We also thought the prices of food & drink were extremely good value for money. One of the highlights of the hotel is the spa and we enjoyed very much our couples' massage in a cabin that is way better than anything I have seen in European spas. A suggestion for improvement would be to have a system allocating pool beds to everyone as it is a little annoying when people leave their towels to reserve pool beds from early morning until sunset.\n", "\nAlmost perfect, we had difficulty with wi fi and were a little disappointed it was not free. No other complaints we had a wonderful relaxing stay. The staff were courteous and friendly. Our complementary breakfasts were delicious. The atmosphere was very relaxing. We just wished we were able to bring the family, children and grandchildren. Excellent place for the kids. ", " ", " ", "\n", "\nRoom, staff, pool & gardens are great. There was a problem with the bedding in our room when we arrived but it was sorted promptly without any fuss. The only real negative is the price of food & drinks. My husband payed $4.80 for a 330ml can of coke from the lobby bar. I ordered a cocktail, & 2 juices for the kids from the swim up bar & it cost $23! It was $9.60 for a johnny walker & coke needless to say we didnt order one!! We had dinner at the chess restaraunt one night & the service was terrible & our order was incorrect & just for mains & a drink each it set us back over $120. So I would recommend staying at the Hotel but just be warned that food & drinks are more expensive than what they are in Australia. Better off going to Bali Collections for a meal at one of the many restaurants there.\n", "\nOur stay at Nusa Dua Beach Hotel was a wonderful experience, we have stayed at several 5 star resorts in Nusa Dua area and this one is equal to all we have ever been to. The only down side is no wifi in your room, wonderful staff everyone as helpful as possible.\n", "\nA peaceful retreat in busy Bali...well away from the hustle and bustle, but still plenty to occupy the mind and body. The voucher passport is a hit with everyone and the ambience of the Palace area made for a really restful and relaxing holiday\n", "\nThe Hotel possesses a wonderfully relaxing ambience. Particularly suitable for parents with children. Top quality food, drinks and service. The Spa was also a wonderful place to relax the mind and body.", " ", "\n", "\nWe stayed in palace club room on the ground floor at first I wanted a higher level but it was perfect with children as the garden area that our room opened on to was a very safe haven for them! The staff in palace club are amazing nothing was to much trouble ! The hotel itself I just love it's beautiful it's location is fantastic I absolutely can't wait to come and stay again !!\n", "\nStill the best resort we have found in all Asia. Stunning gardens, timeless Balinese architecture, instant staff attention, and class leading banquets. Thorough professionalism and attention to detail.\n", "\nPicturesque location. Large number of children in palace club spoilt the ambience as parents thought little of other guests.Staff overwhelmingly friendly,helpful. Need for more staff in busy times.", "Great for walks along the foot way at the beach. Good convenient shuttle to Bali Connection, small shopping mall.", "Relaxing place which attracts you like a magnet wanting to come back. ", "Loved the squirrels and ducks and care of the beautiful gardens.", "A great introduction to the other side of Bali", "\n", "\nA great hotel and location for a relaxing holiday for your extended family and friends. A truly beautiful tropical setting and aspect, excellent food, friendly and hospitable service and an excellent Spa! Huge amounts of space for the kids to run amok. Look nowhere else!", " ", "\n", "\nExceeded our expectations, food and cocktails lovely. We had a Palace club suite and enjoyed the extras that came with that but must say the canapés that were part of the deal were a bit low brow. Complementry massages were very good, thank you Prisma! Great family friendly hotel, very clean and felt safe.\n", "\nFrom the collection at the airport to the last handshake on departure every thing about Nusa Dua Beach Hotel is professional, friendly and enjoyable.", "The rooms although not the most modern are clean and well maintained and serviced.", "The dining rooms offered a very good selection of options to suit all tastes.", "The pools and other recreational facilities were all first class.", "The staff could not have been more helpful and friendly.", "All in all the holiday at Nusa Dua Beach Hotel was most enjoyable and I would have no hesitation in recommending it.", "Peter and Christine Butler", "09/09/2014\n", "\nHad a great time at this hotel for our first time on this side of the island, normally at Legion. Staff were excellent, helpful and attentive. Food was top class. The only complaint was with the bed. It was quite hard and i think the mattress needed an update to a higher quality one. That said, my wife and i enjoyed our stay here\n", "\nNusa Dua has all these hotels by the beach and be rest assured you will not be required to step outside your hotel other than to jump into the water. Nusa Dua Beach Hotel has a lovely feel to it. The rooms are lovely the pool is the centre of attraction with activity (read bar) next to it. The breakfast spread is lavish and the restraints are all great. Make sure you do some adventure activity while in Nusa Dua. Ensure that you stroll along the beach, get a massage and if you want indulge a million activities they arrange. If you want to, they have a recreational room with a lot of options. Only advice to travelers is to exchange money before going to Nusa Dua. There aren't too many money exchangers other than the hotel. All in all a lovely experience\n", "\nAccommodation spacious, location central to shops and relaxation, beach and centre of Bali. Lots of activities to keep you entertained. Staff friendly and willing to help at all times. Very relaxing, massage and spa facilities excellent; food and service excellent. ", " ", "\n", "\nWonderful. Peaceful, relaxing and tropically luxurious.", "Our only suggestions are to improve the air conditioning in the room we were in. Also please improve the tedious time consuming system of paying after the cultural dinner.", " ", "\n", "\nWhat an amazing experience and well above our expectations. Thank you to all the staff for their amazing service and beautiful nature. The voucher passport was fantastic and I would highly recommend this hotel to anyone wanting to escape the hustle and bustle of Kuta. A beautiful, relaxing holiday and I can't wait to return. Terima kasih!!\n", "\nThe hotel and rooms were immaculate, the spa was very clean and staff were excellent. The meal on the friday night the seafood and satay BBQ was average the food was not cooked and we had long lines waiting for our dinner. The dessert was excellent. All staff in the hotel was friendly and very helpful.", "\n", "\nWe have stayed in Bali 7 times now at differents locations and hotels each time. We found the Nusa Dua Bch Hotel very nice, beautiful gardens, rooms were cleaned beautifully each day and service was excellent. But the restaurants were too expensive. And the Buffet Style of serving was not a pleasant one as the food was luke warm most of the time. Because of our experiences at Buffets (breaksfast at Nusa Dua or themed dinners at other venues) we did not attend any of the Themed dinners at this Hotel. We heard feed back from other Nusa Dua guests that they were not good. nd the location was too far out from the action of the local Bali. No shops just outside the Resort as there are at other locations on the Island. ", "\n", "\nRating this hotel with \"excellent\", because Bali is beautiful might be not a perfect rating for the hotel. The hotel is just average and overpriced. The beach is not as nice as others. The rooms are good. The water pressure in the shower as well. They have some funny squirrels jumping on your balcony. Worth to wait for them. Please insist on BlueBird taxis, when ordering a taxi. They ordered my wife one of those expensive taxis (ok, she was not experienced in that), but I complained and got the money partially back. The lagoon pool can be used until (I guess it was 10), the other, bigger one only until 7pm. The breakfast was very good.", "Nusa Dua is about 30min taxi drive to Kuta and Seminyak.", "For holidays I would not recommend the hotel.\n", "\nHad a great lunch with friends in beautiful surroundings. Good food and we also had great service from Erika, a charming and friendly young lady. Although very busy she managed to find time make us feel valued and make it a special experience.\n", "\nAbsolutely wonderful hotel with fantasic staff. They all spoke English very well. The resort is so peaceful, relaxing and so quiet. We would recommend this hotel to all of our family and friends. Nothing was too much trouble for any of your wonderful staff....\n", "\nBy M and M Beachy-Head. 8 th Sept.", "We have just returned from our stay with you, we enjoyed every minute, it was excellent, the staff were wonderful, always so very happy ,giving you that wonderful magical Bail holiday feeling. The VIP service to the airport just completed a perfect holiday in Bali. Thank you to the wonderful Staff and Management.", "The entertainment we would rate number one in the Nusa Dua Resorts. We will ", "Be back early next year.", "M and M.\n", "\nThe most beautiful resort,amazing layout,wonderful activities.", "Fantastic breakfasts in a beautiful setting.All staff very helpful.", "Would happily stay here again.Stayed 7 nights.The most amazing outdoor pool which is difficult to tear yourself away from!Free bus to local shopping centre.Takes approx 30 minutes with driver to go to Kuta etc.", "Just paradise if wanting rest, relaxation and pampering.\n", "\n18th Aug - 2d Sep 2014", "We have had a great 2 weeks at the Nusa Dua Beach Hotel in the Palace Club. Thanks for the excellent service from the staff that we had come in contact with from the hotel. A special thanks to the assistant Palace Club manager Nyoman Sadnyana very helpful and friendly, great butler service from Ayu and all the others in this area they seem to be hand picked for your own requirements. Thanks to the manager of staff in the main breakfast area & to Anita so friendly.", "Urs Klee General Manager very polite & friendly also the Food & Beveridge manager Sinead.", "We have stayed at this hotel two times before, what a great change has been performed by the present manager.", "Wonderful a Beautiful Hotel", "Thanks K & G\n", "\nMy wife, daughter and I stayed here for five nights in August 2014 and had a tremendously enjoyable stay.", "The setting of the hotel is simply fabulous - beautiful and immaculately manicured grounds.", "The staff are friendly and accommodating, and the restaurants and bars (particularly the swim up bar) is excellent.", "Also highly recommended is the spa/pool area - a sanctuary within a sanctuary!", "The prices are of course higher than outside the resorts, but not in my view unreasonably so.", "Very highly recommended.\n", "\nI enjoyed my stay at Nusa dua beach hotel. The service was excellent, very helpful and friendly. I just have one suggestion for the breakfast menu. The menu was always same everyday, a variety might best for guests that stayed for a week like me. Overall, I enjoyed my stay at your hotel and looking forward to having another magical moment in Bali.\n", "\nWe arranged 2 Rooms with the recent Luxury Escapes Package. Initial check in was a little confused as we had liaised with the hotel before our arrival and we didn't get the rooms we requested. Once that was resolved there was not one thing that could be faulted. The staff are so wonderful, friendly and obliging. The premises and facilities were so well suited to what we pictured for our Bali holiday, our children enjoyed the kids club and pools. We even didn't even venture out as often as we had planned because we were so content here. It was my birthday while we were here and we didn't inform anyone but one night we returned to a birthday cake and fruit basket. The Wellness area was amazing and those massages were better than any here at home, our daughter even had 2 with chocolate smelling oil. We would defiantly return and plan too sooner rather than later.\n", "\nThe nightly rate was reasonable for a full service resort on the beach. The grounds and pools were nice. We really enjoyed the pools and spent quite a lot of time in them. They were great for the kids! The beach was fairly nice,but the sand was large and hard on the feet. The restaurants were very expensive and very mediocre. The exception was the breakfast buffet. It was quite good. We got bored with the food by day 2 of our 5 day stay. ", "The staff overall was quite unresponsive and unhelpful. My biggest complaint was that we were located on the opposite side of the resort from our daughter and her family. It was a 10 minute walk to get to their room. They live 1/2 way around the world from us, and we really wanted to be close (we requested this prior to our stay). After 3 attempts to move us (first, to a smoking room where we were told to just open the windows, second to a room that was 1/2 the size of the one we were initially given, and much to small for 3 of us, and finally, after fully packing, they attempted to move my daughter and her family to a room close to us, that was again, too small for them). We gave up!\n", "\nGreat location, great staff, great surroundings but bathrooms/rooms(rate as 3 star due to their age) need renovating to keep up with some serious but expensive 5 star competition. In its prime probably 20 years ago it would have been up with the best hotels in Bali. ", "\n", "\nLoved the hotel. Main reasons were: the traditional Balinese architecture and fit out of the rooms , the beautiful gardens, the relaxed vibe, great pool, helpful and lovely staff (special mention to Rima at the guest relations desk who did all our restaurant bookings and was an absolute delight), great b/fasts. One downside to the resort was the overpriced drinks and food at the resort restaurants. Also, the food was not noteworthy. We tended to catch a taxi to Seminyak to eat at some amazing restaurants there. All in all a great place to go with or without children. Lastly, the traditional Balinese dance shows during dinnertime were amazing. My husband and i absolutely loved them!\n", "\nIdyllic spot and a 'warm feeling' to the whole place that we thoroughly enjoyed. Reviews are all accurate. Breakfast fantastic. Drinks around pool very overpriced though and food there is quite bland and tasteless compared with options at nearby locations. We did move rooms to the palace suites which really 'made' our holiday as deluxe rooms were too small as 2 adults and a 10yo boy. Overall rate the experience as very high.\n", "\nThis place is awesome, best hotel I have ever visited in my life, rooms are clean with a great view, food is delicious and all natural, the pool is always clean, and the personal is so helpful and kind. In the morning you can attend different sports activities such as yoga, outdoors.\n", "\nWe spent a week here in August 2014, the hotel was lovely, great staff, good food, excellent pools and access to the beach, and the hotel's restaurants in the evening were wonderful, particularly the chess bar and restaurant literally on the beach. The variety at the breakfast buffet was amazing, more than enough to keep you going until dinner. Drinks are quite expensive though, particularly the wine.\n", "\nTruly Balinese (in the separated area of Nusa Dua), high standard. Good and clean rooms. Accurate services and very good choice of food. Breakfast service very good. Very kind staff. The SPA and fitness area is also good.\n", "\nWe booked on an indulgence package and found it fantastic value. we had a small problem with our first room which was rectified immediately by change of room/upgrade. We loved the surroundings, friendly atmosphere. Hotel was quiet and kids club was often empty but could be improved to be more welcoming for 5-6 years old (toys more aimed at babies). Games room was so far away in quiet spa area we didn't feel it was the best location. We were lucky enough to assist in baby turtle release on the beach. Amazing highlight. Thank you we will certainly return. The ladies at the spa were wonderful and our spa experience was one of the best I have had.\n", "\nWe really enjoyed our 8-days in the palace club. The staff were fantastic and helpful in every way. The room (1019) was brilliant with it's outlook over the duck pond and manicured gardens. We can't wait to come back again.\n", "\nThis hotel is among three or four other hotels who are within walking distance to Bali International Convention Center(BICC) and Bali Nusa Dua Convention Center (BNDCC). For those who will have meeting in those two convention centers better stay in this hotel. This situation make the hotel become a bit expensive for us who only have roughly 5 hours time to enjoy the hotel room in between the conference time. And I lost my opportunity to enjoy the Spa facility due to hectic conference time, as the Space close at 10pm and can not enjoy it during day because of the conference. By the way the buffee breakfast need to be review.\n", "\nGreat hotel! Fantastic and friendly service. All good restaurants and great location and facilities. Would come here again !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n", "\nWe stayed here for a week in July looking for complete relaxation. It was fine, but it would not rave about it. Breakfast buffet was ample with good quality. But, on the Saturday, we had to wait in line for 30+ minutes just to get a table. The crepe station always had a line and often ran out of toppings. Inadequate loungers around the pools meant that we often had to find somewhere else to hang out. The hotels are all right next to one another along the beach. We needed to do laundry and the prices were sky high, so we took our clothes out to a local laundry service that cost 1/10th of the price. Restaurant prices were very high ($75+ for two adults and two kids sharing burgers and water). Sure, the staff was friendly, but every time I turned around another expense was revealed. So, we went to the shopping center two miles away for most meals. The hotel was fine, not good, and I would definitely not spend my tourism dollars by going back. They gave coupons on arrival that we inevitably forgot to bring when we did eat in. The hotel refused to honor them at the end of our stay. All in all, it just left a bad taste in my mouth at a fairly high cost.\n", "\nIn line with our expectations, we've been there 23y ago on honeymoon and we still found a very reputable and excellent hotel; of course years passed by for everybody, but Nusa Dua Beach Hotel is still in a very good shape. Recommended for a relaxing stay\n", "\nWe go yearly to Nusa Dua. First time at NDBH and it was great. Whilst being a modern 5 star resort....IT still retains traditional Balinese décor and surrounds. Staff were caring always willing to go that bit further. Our family had illness and we were tended to by the hotel clinic as well as receiving flowers and fruit from management which was very thoughtful. We would go again for sure\n", "\nThis was our first trip to Bali and we were recommended to stay at the nusa dua beach hotel by friends and we were not disappointed.", "We stayed in a Palace club room overlooking the beautiful ponds and temple which also meant we were located centrally to everything.", "The room was decorated in a Balinese style which appealed to us at the time of booking as we wanted to stay in a room that reflected bali rather than a more modern type of hotel room that you see anywhere in the world. Saying that it had every modern convenience you could wish for.", "The Palace club itself is a wonderful concept and I highly recommend you splash out and try it for yourself.", "The breakfast are cooked to order and if that's not enough there is a full buffet choice as well. Our favourite was the full English breakfast and the coconut smoothies, the afternoon tea and the daily cocktail evenings made our holiday truly memorable.", "The staff are out of this world and will go to any length to make sure your every need is cared for. I say cared for because you truly feel that they genuinely do want to give you the best Bali experience ever.", "The surroundings are tranquil, the gardens are beautiful and as nature lovers you have the Nusa Dua family of ducks that are a great source of entertainment to watch as well as the cheeky squirrels that every morning greet you and pretty much frolic around the palm trees occasionally landing on your patio where they are quite happy to gently take a grape or two from you.", "The beach is spotless..they even have beach cleaners.", "The pool areas are well maintained.", "The Spa and treatments are out of this world and i highly recommend a traditional Balinese massage...I had 3!", "If you want a relaxing holiday then I would say you can not ask for more than the Nusa Dua Beach Hotel.", "We will definitely return.\n", "\nI recently stayed at Nusa Dua Beach Hotel & Spa with my husband and children. The hotel and its gardens were beautiful and the staffs were amazing. We thoroughly enjoyed our stay and will absolutely return for another holiday soon.\n", "\nI had a company business trip in Bali last June and was thrilled by this hotel. ", "Rooms are comfy and large. Swimming pools are great with easy access to beach, breakfast restaurant is fantastic. ", "Service is very good...", "Highly recommended for businesss travellers, families or justget away weekends\n", "\nOur family stayed in April so my daughter and I decided to have a week by ourselves. The grounds and pool area are fantastic, buffet breakfast amazing & staff wonderful. Bathrooms need renovating but no big issue. Definitely go back :)\n", "\nMe and my husband are staying in Nusa Dua Beach Hotel for our Honeymoon. We arrived on 23rd and the receptionist told us that our room was cancelled (although we paid in advance and told them that we are there for our honeymoon) and said we had to pay it again in our own expense. We insisted that we paid before and wouldn't be paying again. Well, long story short, they gave us a room, but we were not treated as \"honeymooners\" just as regular customers. Not pleased with it AT ALL. ", "But the hotel is pretty and exotic.\n", "\nThank you for your service, we had a great time. The staff was welcoming, and helpful.", "The reservation was for connected room, rooms we were given were not, so the manager had to work on the reservation and worked out", "\n", "\nLoved our second stay, all staff and management very helpful and a special mention for ANITA in the dining room, we found her to be a hard working helpful young lady. Also a big thankyou to the Manager URS KLEE.", "\n", "\nWe had stayed in this hotel in February with a luxury escapes deal and it was very cost effective and the hotel was amazing, so decided to stay for my birthday in August and again had a wonderful time.\n", "\nthe palace club service was very disappointing. our requests are granted by one service crew just to be later on denied by the other. so much time was wasted which caused us to miss the sunset at uluwatu. so our supposed pleasant stay ended with dismay. ", "make sure to confirm the benefit that comes with your room otherwise you'll end up paying for or denied your benefits. ", "\n", "\nNicely maintained garden and beach.A lot of happenings and quite near to BNDCC for my congress.I did early booking so I missed the promised discounts by congress organiser.However since the resort is rather old,the plumbing system needs upgrading including replacing some tiles in the bathroom.Became vegetarian during breakfast as not halal.There are many pura and idols on-site (can't be helped I guess since it's Bali after all)\n", "\nGood family location, but somewhat isolated for active travelllers. For convention participant the lack of free WiFi in the rooms is a clear minus. Room quality average. Breakfast and dinners good. Expensive in Bali standards.\n", "\nThe hotel located in such a beautiful surrounding, but unfortunately we were having few problems regarding the service. We stayed for a week in there for our honeymoon, and was really looking forward to the experience in the beginning. We chose Nusa Dua Beach Hotel because we saw a lot of good comments about it and we thought we would love to try. It was a bit disappointing in the end, we had to wait for a while for check-in, the food wasn't that great, the service at the restaurants was poor (not enough staff to serve all the guests), not enough pool chairs and everybody seems to come very early in the morning to book the chairs yet it says that you can not pre-booked pool chair on the sign. There are few other problems that we encounter while staying in there. We are hoping they will try to fix this problem, because its such a shame, the hotel is beautiful, people are very friendly, but they need to upgrade their service to the clients.\n", "\nStayed here for 2 weeks from Aug 7th 2014, travelled as a couple.", "Location: The hotel is situated in Nusa Dua about 20 minute (35 minutes in traffic) taxi ride away from the main Denpasar airport. The hotel is situated away from the more busy areas of Bali (Kuta), to the South of the Island in a more quite section. Being a small island there is no train / tram / metro service...all public transport is by bus, but as taxi's are reasonably cheap tourist just use them. The whole Nusa Dua area is closed off to give a nice sense of security and seclusion. The beaches are wonderful, golden sand and clear water. There is a shopping centre about 10 mins walk from the hotel which has plenty of shops and eateries. Look out for the offers on massages...you can get a 1 hour foot massage for the equivalent of £7! The price of food in the shopping centre restaurants is slightly cheaper than the hotel...but in terms of choice, you don't have the variety IMHO. There is a shuttle bus to a shopping centre, however its only a short walk and the way the bus picks up and drops off at every hotel, by walking you can nearly beat it to the shopping centre on some occasions. There are also a few local shops around which are great for souvenirs such as wood carvings. I found these to be cheaper than the ones in more touristy areas of Ubud.", "Food: We paid for the breakfast for our stay. The breakfast is very good. Some Danish pastries, pan au chocolat, muffins etc. The hot breakfast was average...Scrambled eggs, sausages, mushrooms, hash-browns, bacon, toast, beans. But not fried mushrooms....& not many veggie options such as veggie sausages. The cereal choice was poor though...only 3 choices rather than packets of the Kelloggs variety packs you normally get in good hotels. There were also lots of fresh juices, meats, fruit and yoghurt. We did have dinner a few times in the various restaurants in the hotel, the food is quite good, but a little pricey, in that is costs the same for as it would in the UK. I think the hotel realises this and supplies money off vouchers for every £10 you spend, however this only get you £2.50 off. The hotel restaurants do have good variety and sometimes entertainments such as singers and bands. Plus as you can walk down the beach path to other hotels, you are only a short walk away from lots of other restaurants, some better / cheaper than this hotels, some not. ", "Room: The room was an average size, clean and tidy with a small balcony, small bathroom, shower but no bath. The bed was large. The TV was flat screen however if it doesn't have any USB ports...which would have been nice as we bought a USB key along to watch some films. For English speakers, your limited to news channels and a few movie channels. There is a kettle for tea/coffee & you receive 2 bottles of water per day which is a nice touch. The room has a standard safe and mini-bar, iron and ironing-board & is air conditioned.", "Spa & beach area: There's a Spa adjacent to the hotel, we never used this so can't comment on it. The hotel has 2 large pools and a few smaller ones. The is a bit of a rush of sunbeds between 11am - 2pm so sometimes you can end up on the beach without one. Easy to walk up the beach to other (and cheaper) restaurants.", "Staff: Front desk staff are very good and were helpful, i.e. transport, attractions to see etc. They told us about the WIFI throughout the hotel which costs to use in your room or is free in the lobby where you can also use the hotels desktop computers. (maybe this could be included in the room rate as many other hotels offer Wifi for free???). There are about 4 people that are on the front desk and i can only say good things about them, Many as expected are multi-lingual, speaking English ...so no issues with asking for anything. I was very grateful to them when they helped out with questions about transport and local amenities.", "Misc: Be warned that when you get off the flight and before collecting your luggage you have to pay $35 each for a enrty VISA and then queue for about hour through customs....a long time after a long flight. :( There is a taxi counter after baggage collection...a FAIR price for a taxi to the hotel is around 150,000 rupiah. Nearly EVERYWHERE in Bali you can haggle for the cost...so go ahead and try it....i think the sellers half expect it so always quote you a price double what they expect, knowing you will haggle some money off. Everywhere in Bali, you will get locals trying to sell you things. A quite \"No Thanks\" usually suffices and you are left alone. Never ever fall for some of the cons though where you get into a conversation and eventually asked \"What is you program for tomorrow?\". Basically the seller will offer a deal to take you to X, Y, Z....best to not do this even if it sounds cheap...make all bookings through your hotel. Another con we found in the shopping centre is being approached by sellers telling you about a new hotel (the best in Bali apparently ;) ) that they are advertising. You are handed 2 vouchers and after more advertising chatter are told to open the vouchers up and low-&-behold, you have won a FREE trip to the hotel for a 3 night stay and sometimes even a cash reward of $X. Nothing is free, its all a con..just walk away....they won't bother you again.", "For the amount we paid and the facilities on offer at the hotel, i would recommend this hotel....", "Mr and Mrs Patel, Room 2207.\n", "\nEveryone from manager down are so friendly and helpful, nothing is to much after spending a hectic time traveling in Europe it was so nice to relax by the pool and be waited on, also the breakfast were great and the staff superb.The rooms are top rate.\n", "\nI'm going to start with the greats about this trip as there are many. We booked a deal and upgraded our package to the Club which was excellent value. We had our two boys in our room in rollaway beds but we had a seperate living area for after hours which worked so well. The Club package opened up the ability for afternoon tea refreshments which allowed us to have a few snacks with the kids before bed. The evening cocktails were great, especially given our central location. The team were very tolerant in us having some of the cocktails closer to our room after they had gone to bed. Breakfast was amazing for Bali standard. The pool and facilities are great as is the spa, which included some treatments in our package. Being a runner the beach trail was also very handy", "We met the whole management team as well who were very friendly.", "Some small negatives. The kids club was not very entertaining for the kids. They only only went a couple of times and really didn't want to go back. If any deal offers fast track through the airport (immigation) then forget it. Our supposed package and fast track deal got us no favours other than a man meeting us as we got off the plane and showing us to the line. Apparently the fast track stopped weeks ago. I was not impressed with two young children andt the whole process taking around 90min.", "I'll be back\n", "\nWe took a Deal (from Deals.com) to stay at this resort with my two daughters and their families. We had 3 children from 4 months to 7 years, stayed for 8 days and loved it. Helped by the beautiful weather as well. Friendly and helpful staff, comfortable room cleaned every day, a pillow menu! Activities if you are interested. On the beach, extensive pools, enough sun lounges, food on call everywhere, magnificent breakfasts. Easy to walk up the beach to other (and cheaper) restaurants. Our deal included some meals to match their special entertainment nights which were buffets. There is a shuttle bus to a shopping centre which is like a mall, but if you wanted a more Balinese shopping experience you can walk out the front of the resort and pick up a cheap taxi ride. The spa is wonderful and the staff there are very attentive. I can truly say our whole family had no complaints.\n", "\nthe hotel is elegant and tranquil for couple of nights we spent there at the end of our holiday... the rooms are beautifully designed and the staff were very friendly and helpful. i particulary enoyed the large pool to thoug access to the very beautiful beach is just as conveniet. we ate at their restaurant on the 1st night and the food was so delicious and service attentive. all i can say.. that was wonderful stay.. thank you Nusa Dua Beach Hotel and Spa!\n", "\nGreat hotel, very helpful and friendly staff. Had a trio band playing covers at the restaurants every night, they were very entertaining. Perfect location, easy walk to the collection (main shopping centre) and the smaller village shops which are cheaper and have really good food and massages. Resort spa was the best and hanging out at the spa pool was quiet and relaxing.", "I would recommend booking a palace club room as it looked amazing and we were quite jealous.", "\n", "\nThis was the 3rd time my Wife have stayed and quite frankly it was an outstanding experience once again and we will certainly return.The Palace Suite was extremely comfortable and the staff in all the areas were excellent.We look forward returning next year", "The food outlets are good particularly the Maguro Asian bistro.", "The leisure facilities are outstanding\n", "\nWe enjoyed our stay at Nusa Dua Beac Hotel. It has great Balinese feel. Kecak dance dinner was great. Cocktails are amazing. Pool was always clean but wish there was more lunge chairs. The only thing that I would suggest to upgrade is kids club its a bit dated and there wasnt much for my kids to do there. Otherwise excellent location, great price and great staff.\n", "\nWhen looking for a hotel that could combine a honeymoon with relaxation, cuisine and location, there could not have been a better hotel than Nusa Dua. Impressive entrance to the hotel, airy and exotic lobby, really felt as if we had moved to paradise ! Stayed for 5 nights, felt as if we had stayed for 2 weeks! We stayed in the Palace Club side of the hotel, allowing us to savor the hotel's grounds in relative peace. I recommend the spa for the ecstatic feeling of liquid butter after any of their spa programs :)", "Pros:", "- Palace Club rooms have \"private\" grounds in which to relax away from the hustle and bustle of the rest of the hotel, same with breakfast", "- The restaurants are top-notch, we ate almost every night at Raja's, with enough variation on the menu to have a different meal each night.", "- All the staff are friendly and cater to your every need", "Cons:", "- As it was a family resort, there were a few issues with pool space, i.e. you need to get up around the start of breakfast or when the pool management team come out, to \"reserve\" a spot at the main pool, or else fear the wrath of little kids in the other pools. It became a drag after a while as other guests would leave towels and then re-appear at midday, or never..", "- Once you head to the beach, be prepared for a lot of locals selling things and beach massages. If you can handle that, the beach is amazing!\n", "\nJust spent 10 nights @ NDBH and thoroughly enjoyed it. Travelled with my Wife & 2.5 year old. Originally booked standard room but upgraded to Palace Club. Rooms a bit aged but resort is beautiful. A tad pricey but with beach @ doorstep it was worth it. Negatives were price, standard rooms are a bit ordinary.\n", "\nHotel was ok - nothing special. Pool was nice. The room was small for the price paid. The drinks were over $10 for a large Bintang compared to around $3 outside the hotel - some mark up is expected but this was just too much. The massages were also very expensive relative to the quality.\n", "\n- add N/A as answer option to the questions", "- more than one answer possible but not clickable", "The perfect holiday on a paradise island with fantastic people and optimum service, highly recommended to everyone!! We travel to Bali every year and always stay at this hotel because it offers genuine Bali traditions and is not just another luxury hotel which you can find all around the world. ", "The service offered at the Palace Club is really amazing and it is a joy to return every year to a place where everyone remembers you, welcomes you as one of the family. It is always a relaxing stay and it always feels sad to leave!", "We can only recommend this hotel to everyone else who wants to experience an amazing holiday ", "\n", "\nWe wanted a relaxing holiday and that is what we got, a very enjoyable holiday with friends. One thing we booked at the same time and I thought our rooms would be close but we could not have been further apart ", " ", " ", "\n", "\nWe had a wonderful eight night holiday in this lovely resort. The beach and gardens were gorgeous. Resort facilities were elegant yet relaxed. We very much enjoyed the spa, theme dinners and performances. ", "Looking forward to returning.", " ", " ", " ", "\n", "\nThere were some good things and bad, in my honest opinion the good parts were the beach on the doorstep, a good deep pool and an overall well presented grounds. The bad was the service, the staff didn't really speak English, you had to pay for the internet in your room (and was flakey in the public areas), the stock in the room was at a minimum (running out of toilet paper constantly) and the walk ways around the pool were very slippery and dangerous. There was a total lack of seating areas to the point that hotel guests were fighting for their space by placing towels and belongings down at 6am. BE CAREFUL of the \"+ +\" when looking at the internet price, we paid the quoted internet price \"+ +\" 21% for so called taxes!!\n", "\nJust spent a week at nusa dua beach resort and spa. Location was great with one of the best kept beaches along the strip of hotels. We tried all but one restaurant Maguro including room service and everything was great value for a 5 star resort and of good quality, although the pizza was quite soggy and too cheesy. One of the best things about the hotel is the staff who were all lovely. Only tip would be if you want a bed at the pool you have to get in early, seems like most people grabbed towels and reserved beds before going to breakfast, so get in early.\n", "\nRecommend this hotel to as anyone enjoyed our 8 night stay in the palace suite alot staff all very helpful and go out of there way for you. Will definitely be back! They even let us stay an extra 4 nights at a reduced rate after our accommodation at another hotel was double booked!\n", "\nGreat hotel in terms of facilities, rooms, pool and restaurants. A good choice if you want to stay away from the hassle of crowded parts of Bali. The staff is attentive and helpful in general. We had issues in communicating with the hotel staff before our check-in. They are not responsive to e-mails, but fortunately the experience was much better in the hotel. One disappointment was the sea. In most reviews, Nusa Dua is told to have the best sea in Bali, but the sea was much better in Seminyak.\n", "\n- Excellent breakfast and housekeeping", "- Lovely beach", "- Good restaurants", "- Competent staff", "- Free shuttle bus to Bali Collection", "- A bit high prices in the restaurants, if you compare with outside ones", " ", " ", "\n", "\nAt the end of our 4 week holiday in Bali, we stayed in the Nusa Dua Beach Hotel for 4 nights. After having stayed in small boutique hotels and private villas, this hotel was too big and un-personal for us. The rooms are kept very clean and the gardens are spotless, the service is perfect and the food very good, but very pricey, compared with the rest of Bali. But that's what Nusa Dua is about: Pricey and Big. If a big resort is what you are after then it's a good choice. ", "The family rooms that fitted 2 adults, 2 kids and 1 baby were average in size, but the bathroom was very very small.", "The Bali Collection is a nice 20 min walk a long the beach promenade, which gives you enough choices for cheaper restaurants. ", "One big thing for improvement: Almost all pool beds are being \"reserved\" in the morning by egoistic people that put a towel on it and go back to bed. The management is aware of the problem, but is not showing any action to overcome this problem. I understand that it's a difficult thing, but I have thought about a couple of solutions to fix it.\n", "\nVery nice hotel with 3 nice swimming-pools (1 with trees and sand) and beautiful gardens (squirrels included!)", "Nice restaurants (I recommend the Raja for Balinese food and the Italian for very tasty pizzas) - you can eat in front of the beach", "You can either lay on the private white sand beach or by the the swimming-pools while drinking cocktails.", "Staff are very friendly and you will be able to go and visit Bali by taxi or tour. Great for kids with mini-pool and kids club and activities.", "Great for sports (running, biking, tennis and water sports) ", "The massages are also great (try the four hands massage)\n", "\nThe hotel was fie and we had a nice time. It caters for the low end however eg. only local wine... needs more range and high end options. Staff were friendly enough but very rigid in what they understood the rules to be. English wasn't consistently good.", " ", " ", "\n", "\n2nd visit to Bali. We spent two weeks here last January. Very nice hotel in a lovely location. We travel extensively on business so were desperate to relax and that's exactly what we did here. Well at least until I did the whitewater rafting! We had a great room and views and a comfy bed - very good housekeeping. Everywhere was clean. Nice public rooms and grounds. Restaurant was nice with a nice selection of food. No complaints. Lovely pools. Fab beach. A really nice relaxing holiday. Recommended as excellent value for money mid-range hotel.\n", "\nWe celebrated our daughters wedding in Nuas Dua. We could not have stayed in a better hotel. The staff were very friendly and accommodating. We felt very safe to have our 3 year old granddaughter Lilly with us. The staff knew her well and she loved to see them each day.\n", "\nWe've just spent 7 glorious days at this resort in fabulous Bali weather. Just about everything was perfect: comfortable and elegant surroundings (including the best beach-front location in the area), terrific food and numerous on-site entertainment options. It's not an ideal location for seeing the rest of Bali, but if you're content to spend your time enjoying the resort itself you'll be very happy. Very highly recommended.\n", "\nWe stayed here as part of an internet package deal which was very good value. The massages were great, the three dinner shows were good fun, the room was lovely and the beach was great. Service was good and the omelettes and crepes for breakfast were delicious. ", "\n", "\nTry this place for a vacation to keep.safe location and value of money.art collections are amazing.however,it could have a better dining at the beach front if the squirrels are off limit to the place.", " ", "\n", "\nThis was our 2nd stay at NDBH following our amazing wedding there 5yrs ago. ", "This time we Stayed 8 nights in July on a luxury escape package- premier room with vip airport service. We misinterpreted what this meant as we thought it was a fast track/express through customs bypassing the long ques, however, it was meerly a staff member purchasing our VOA which we were capabale of doing ourselves. We still had to line up and gained no time as we had so hoped for travelling with small kids! Check in was very fast and smooth, however upon entering our room (family room/suite) we discovered no power, no cot as requested for our 2yr, and we (husband and wife) has 2 single beds! This was far from ideal given the late time of night after traveling all day with 2 tired children, however it was resolved fairly quickly, and our bed fixed the following morning. It is obvious that some TA reviewers would deem this situation as terrible but we weren’t bothered-it takes more than a few wrong beds to ruin our holiday! ", "Our room (2219 i think??!!) was fabulous, a separate nook for the kids (a curtain dividing their section off from ours would have been wonderful!), a massive balcony, and because we were above 2 restaurants, we could link up to the hotels free wifi in our room, BONUS!! Only complaint about room was the bathroom, it was so, so small. It was actually a little ridiculous given it was a family room and sometimes more than one person needs to stand the bathroom at once. It was also a long, long walk from the lobby, possibly the furthest room, but that also meant it was also closest to pool and beach- so depends what you prefer….kids and close proximity to pool won us over! The man who serviced our room daily was a champion, as were all the staff. Happy and friendly. ", "All meals at hotel were excellent, the themed nights were great, especially the seafood bbq one. Spa is amazing. Didn’t use the gym or anything else, but my husband did try and book some bikes but they couldn't fix the bike chain or peddles for a week- bit strange! ", "My only gripe about this hotel (and its not just this hotel either-they all seem the same in Nusa Dua) is they lack atmosphere during the day and night. For example the pool bar wasn’t used much, the chess bar near the pool/ beach was pretty much empty, no music, hardly anyone to socialise or mingle with etc. We wondered if it was because they charge so much for drinks (cocktails are pretty much aust prices). I know we were conscious of the prices thus couldn’t sit and drink all day! But if they were just a fraction cheaper, perhaps it would encourage one to spend more? Who knows! Also there was only a limited selection of cocktails you could order in the pool bar, I don’t remember this being the case 5yrs ago!", "Our son had to visit the doctor at the clinic whilst there, and he received a lovely bouquet of flowers and a follow up phone call- it was a really nice touch. ", "The kids club seemed great, however, there was hardly ever any kids in there which made our son a little apprehensive about going in there- so we never pushed it!", "Over all a fabulous holiday, this hotel is perfect for families. Nusa Dua its quiet area ideal for relaxing and walking around their beautiful gardens and beach.\n", "\nGreat place to stay. The staff are good. The only problem I had is the same buffet breakfast provide everyday. Although they have variety food but still i can remembered all menu for 5 day stay.. hahaha :)", " ", " ", " ", " ", "\n", "\nWhat a wonderful experience to stay at your Hotel and in Bali ! I am so happy to have the chance to be in such a hotel and on your island ! I am in love with the Light of the Bali and I make the wish to come back again...", "\n", "\n", "Nusa Dua Beach Hotel is amazingly beautiful. You have a superb stretch of beach. Several pools. 4 or 5 restaurants. Our room was gorgeous. Huge comfy bed. Lovely bathroom. The prices were extremely high though. The cost of food and drink was the highest I have ever seen in Asia. Bottled water was at time astronomical (almost £5 a bottle at some restaurants) and the cheapest bottle about £2.50 (water in the room) I wouldn't recommend the pizza restaurant but chess restaurant was really good. Biggest disappointment was the charge for wifi I think this is disgusting considering it cost over £100 per night to stay there. I was not asked to pay for wifi anywhere else in Indonesia so why would a large and expensive hotel have to charge?\n", "\nAbsolutely love this resort and everything about it.", "Great food (although a little over priced)", "Great staff", "Great location", "Great rooms", "Great garden", "Great experience", "We loved it so much husband and I decided to get married at nusa dua beach hotel and spa. ", "We'd never stay anywhere else.\n", "\nall good except house keeping especialy amenity goods.", "every day we have deficiency and excess of amenity goods.", "the house keeper dosen't relate a message od guest's require to the next day's keeper, i think.", "\n", "\nWe manage a 5 star hotel and had to find somewhere nice for a break - this did the trick. We were looked after very well here - really enjoyed the amazing choice for breakfast every morning , the massages were awesome and the pool bar was a treat.\n", "\nWe went there as a group recently including two guests in wheelchairs and booked the accessible rooms (they have a twin share and a king as well as an interconnecting room if you are taking personal support with you.) The hotel, food and staff were excellent. Every little extra had been thought of in the access rooms with wide doorways, lower furniture, great walk in shower and fold out cushioned shower chair. The entire resort area is accessible, including the beach side bar which is at sit down height meaning wheelies can easily enjoy a cocktail at the bar also. Definitely would recommend this hotel to anyone.\n", "\nThis is a resort set on a huge area with gardens and monuments dotting the landscape. It has two outdoor swimming pools and plenty of exclusive areas for group entertainment. It is an old resort but has been maintained very well. The rooms are large and the ground floor rooms leads out to the garden from the back door. A lovely area to have you morning tea! The food is good and so is the service. An excellent place to stay for those who are looking for a typical resort. The attached beach at the back of the resort, just past the swimming pool, is almost private and one can stroll along it for miles.\n", "\nAfter my seventh stay in a Club Palace room I still love this hotel. Great location for ambience, views of the sea and walking. The staff are friendly and helpful. The spa is very good. The food and wine keep getting better and cheaper.\n", "\nThe Palace Club was jist like coming home the service by the staff was excellent and they never forget you.The dining area with the outlook onto the beautiful gardens with ducks and squirrels is amazing. using many of the facilities available at the hotel we have no complaints,it was a most relaxing holiday for my wife and I and we will come again. Ted Paulin", "\n", "\nWe had a great time at the hotel. Staff were very good. Restaurants were nice. Pools were great for the kids and the location with the beach was lovely. The beds and pillows were incredibly comfortable.\n", "\nStayed on a 10 night package and thoroughly enjoyed could not fault a thing,beautiful Balinese grounds very relaxing, pleasant room with amazing bed which was a great surprise, great facials and massages.", "\n", "\nWe went there as a family with an 11, 16 and 18 year old and they all had a ball in the pool and beach. The breakfast was a real hit with the buffet as the older two are boys and they eat a lot! We were able to skip lunch most days because of the big breakfasts. As a vegetarian, I was suitably catered for as well as hubby who is a Coeliac. The many resuaturants inside the resort also catered for Coeliacs which is surprising, just triple check with the head chef as their understanding of gluten is limited.", "The resorts main pool is small in comparison to other resorts which have mutliple pools, but nevertheless suitable. The wi-fi is available in the public areas which is okay, to have the wi-fi in your room, you need to pay. The accommodation is clean and rooms are large enough to comfortably house three teens.", "Unfortunately Nusa Dua isnt the place where you can walk to the main road and get something to eat. You are limited to the resorts so prices are a little more. There is a FREE shuttle bus that collects you from your hotel to take you to Bali Collection Shopping (Outdoor) Centre which also has restuarants and a mini supermarket. Again, prices are higher than in Kuta where a Circle K is on every corner! If you are in Kuta, go to Circle K and stock up and save some money. ", "We went to Waterbom and spent the day there to maximise our gazebo, which was a nice relaxing way to do things. Have a rest when you want and go hit the slides again. The entry fee is the same as western prices, but it is a lot of fun.", "Overall we all had a great timeand I particularly enjoyed feeding the fish and turtles in the resort foyer pond. Nothing was too much to ask with the staff. I would recommend staying here if you want to not get hassled and bothered by anyone.\n", "\nthe hotel looks good from outside it has all the art of Balinese taste. When you enter from the gate you will feel that you are in Bali. You can get the best view during the day and night. The hotel comfort is fine.", "\n", "\nThe resort is perfectly fine if you are expecting the usual Bali fare; but definitely NOT a 4 and a half star experience. The balconies and furniture are run down and dirty; you are plonked on top of neighbours; staff come crawling up the side of the building and onto your balcony to water plants... regardless of whether you are dressed or not. NOT 4 1/2 STAR!!!!\n", "\nIt's a beautiful resort with good atmosphere and services. lovely squirrels and ducks. Sports center with many items, even some exercises course. It would be better If the breakfast has more selection. ", "\n", "\nWe first stayed at the Nusa Dua Beach Hotel in February 2014 and enjoyed it so much that we went back in July . Second time round the hotel didn't seem as 'heavenly' but that could have been because it wasn't a novelty any more. However, we asked for and were granted a room change because the bathroom of the first room allocated to us was quite unsatisfactory --- small, no bath tub, shower with only a half door so the water would just splash all over the floor and the unhygienic situation of the toilet being in close proximity to the wash basin and towels. ", "The second room was a bit better but really, only just. It had a bath tub but the shower was in the tub when we were expecting a separate shower; the latter I may say is usually the norm for 5 star hotels, at least in Asia it is. The room was on the 4th floor and was so far away from reception that it was a real bind having to take so long to get there. ", "But the staff were their usual extremely friendly and obliging selves and room service was prompt. ", "The hotel could do with some decent musical entertainment in the evenings. They had a female pianist for a couple of evenings a week whose singing and playing was positively soporific. I'm not surprised that the lounge bar was so poorly attended. When will hotel managers grasp the importance of decent, live music to attract guests to the area, set an appropriate mood and thereby increase bar takings? ", "Would I return to the Nusa Dua Beach Hotel? Not unless it is a last resort as there are so many other neighbouring 5 star resorts which are definitely worth trying.\n", "\nWe had a great time at the hotel. The staff were so friendly and made our stay memorable! The general manager even introduced himself on our first day. Looking forward to returning in the near future. ", "\n", "\nBeautiful gardens and clean rooms. Staff cannot do enough for you. Only concern was the air cond was not set right. We live in Darwin so used to the weather. The rooms felt too humid even with a/c on.\n", "\nIt was verry nice ", "and a very nice admosfear we feld verry welcome ", "every were die empoyens hat time for a litel talking end there were very intresting.the food was very good and i enjoy it to go on the beach in demornig 6.30 am and drink my mango juce and watsch the sun coming up.", " ", "\n", "\nFor a hotel that was the first of its kind in Nusa Dua it is a beautiful resort with wonderful staff & attention to detail. Food just amazing especially the breakfast set-up each morning! Great location & will definitely visit again!", " ", "\n", "\nWe travelled to Bali in June and stated at the Nusa Dua Beach Hotel & Spa for 9 nights.", "We had a Palace club suite. It was a great size and our 3 yr old slept on a rollaway bed in the lounge area and our 18 month slept in a cot next to him. This worked well as at night time we could close the door and still watch TV , have a shower etc in our bedroom area.", "We were on the 4 th floor which was great as we had a very large balcony the kids could play on outside. ", "The Buffett breakfast were fantastic and the staff were very friendly and efficient. We didn't use the palace club facilities ... it is a very quiet and serene area and we didn't think it was fair to the other guests to have our two little boys running around! ", "The gardens are amazing, the beach perfect and so nice and clean. We went to the playground at the resort every day. We also walked up to Bali Collection most days for dinner or lunch - then caught the courtesy shuttle back. The walk in front of the hotel down to Bali Collection is nice and shady and you get to have a look at the other hotels. We spoke to other guests who ate lunch/ dinner at neighbouring hotels. Checkers restaurant is lovely for dinner. We had a table right on the grass so the kids could run around while we finished up or listened to the band.", "We used the hotel taxi to go into Kuta/ Seminyak. We took the three hour option. They drove us there ( soooo quick with the new toll bridge ) and just waited till we wanted to go somewhere else or go back to the hotel. Other guests we spoke to used the taxis outside the hotel gates we probably would to but didn't want to walk all that way ( entrance to hotel is a long road) with the two small children.", "The only issue for our stay were the sun loungers at the pool area. Other guests would put towels on them early in the morning then only come back in the afternoon. Or only use them for an hour or so in the morning then leave their towels and come back in the afternoon for another hour or so. It makes it difficult for those of us with small children trying to find a shady place to sit. Or indeed all guests trying to use the pool facilities. This is an issue management will have to do something about as we witnessed ALOT of frustrated guests trying to find a spot to sit.", "Overall we had an amazing time... and are already looking to book for next year.\n", "\nThis is my 2nd time staying at the Nusa Dua Beach Hotel and Spa because the first time was so impressive. Unfortunately, I booked a room that was not as nice as the first time around. I booked a premium room with a great pool view but these rooms don't seem to be as well kept as the higher priced rooms. The bathroom could have used a good bleach scrub down and the house keeping didn't do the best job with the daily cleanings. Overall it was a decent stay but after being so impressed the first time around, I was a little bit disappointed and I think that the next time I visit Bali, I can venture off and try another hotel (in the same area).\n", "\nStarting from entry of the hotel to the back side which is actually the beach front, the entire facility is a perfect family destination. Beautiful and spread-out property with various options of restaurants, welcoming staff. Kids enjoyed the beach, swimming pool and the squirrels around the garden.\n", "\nThis was by far the best hotel I have ever stayed in. No wishes were left open. The personnel was very friendly. Rooms very clean. The food in all restaurants excellent. Overall service was great. I would recommend this place to anyone. The gardens were a dream. Very well maintained.\n", "\nWriting reviews has to be on the spot and based on your immediate experiences. So in writing this we had a full week here and still one week to go.", "In general the hotel grounds are very beautifully laid out. The pool areas are meticulously maintained and the overall experience is good.", "The good:", "The breakfast is simply awesome. They have good quality of bread and good coffee. The children has really liked this place and are treated really nicely by the staff. The beach bar is a great place to hangout after a long day in the sun.", "The bad:", "Our room was quite worn out. We were quite unlucky with drapes falling down and tiles falling down in the doorway if the toilet.", "I was quite offended in the pizza restaurant when we asked them specifically to not put mushrooms on they (our son is allergic) they just took some if them off, more cheese on and served them again resulting in that we found the hidden ones ourselves. When confronted with this they apologized and discounted it. But I was naturally very offended by this. Bad experience...", "We actually like this place, but I am conflicted taking into consideration the bad side. Therefore only 3 stars\n", "\nCame in at 1230pm, was told that the room will be ready by 2pm.", "Came back at 230pm, the room still not ready.", "Given free massage and T-shirts as consolation.", "The bathroom was clogged, water everywhere. ", "Breakfast area was severely understaffed. Waited 10 minutes for coffee. Plates were not immediately picked-up.\n", "\nWe were there to attend a wedding and spent 3 nights at this hotel. The building structures and gardens are lovely. The only downside was the smell in the bathroom and the little bugs all over the rattan table in our room. We were just too tired to request a different room after 24 hours of travelling . Luckily I had a can of mosquito repellent and was able to kill the bugs. Another irritation was the shower stall do not have a door and subsequently the bathroom floor is always wet after a shower. Overall our stay was pleasant and I am giving it a 4 star due mainly to the wonderful staff who were very friendly and helpful.\n", "\nWe stayed at The Nusa Dua Beach Hotel and Spa for 8 nights in March. We chose it over some of the newer, more contemporary hotels as we wanted to stay somewhere traditionally Balinese in style, and whilst it has been going for over 30 years, it has been refurbished and is generally well maintained. ", "The driveway and entrance are impressive - the Balinese stone gates, lush with greenery, hint at what is to follow, and the spacious reception area with its raised fish ponds, immediately evokes a sense of calm and tranquillity. Check-in was painless, and enhanced by the obligatory cold towels and fresh juice.", "Our 'garden deluxe' room was lovely. Large, well laid out and tastefully designed and furnished with parquet flooring, carved timber screens and a relaxing neutral colour scheme. Being on the ground floor we had doors opening out onto a terrace where we could sit with a drink and watch the squirrels at play. The bed was really comfortable, storage plentiful and the marble bathroom a good size (although I did think it was the one thing that was looking a little tired and dated).", "The grounds of the hotel are beautiful, with tropical plants, ponds, statues and carved stonework all adding to the Balinese ambiance. The main pool, with its swim up bar, got plenty of use, and there is another 'lagoon' pool which is shallow enough for kids of all ages.", "We booked a package through Luxury Escapes which included a whole heap of extras - daily breakfast, cocktails, cultural theme nights with buffet and show, massages etc. which represented good value. ", "The spa was great, and the treatments very relaxing, but they are resort prices. The cultural shows were entertaining if a little (or a lot) touristy, and the accompanying food from the buffet was average - the food we had at the hotels other restaurants was better. The breakfast buffet however was very good, with a huge selection of local and international foods to suit all palates. The hotel also offers guests free daytime activities - we actually really enjoyed carving flowers and leaves out of vegetables, and the trial scuba dive in the pool an interesting experience.", "The staff were generally very attentive and gave good service, and the free Wi-Fi in the public areas had a pretty good signal.", "We had a great stay here. Nusa Dua Beach Hotel and Spa is ideal for a get away from it all, lay by the pool type holiday. The style and ambiance of the hotel is perfect - yes, there are newer, more glamorous and more luxurious resorts around, but if you want to feel like you are in Bali, then this is a great choice.\n", "\nWe have never been to a better appointed hotel", "We are two well travelled 80 year olds but could not find a fault with the hotel's presentation, its gardens and delightful personnel. therefore we have no tips or guidelines", "\n", "\nReferring to my previous report, this hotel just keeps delivering. Authentic Bali great staff. Check my report on this hotel. All and on I would highly recommend this hotel to anybody coming to Bali. My family has been a repeated guest at NDB Hotel fo 16 years !\n", "\nReturned to this hotel after 26 years and was very impressed that the hotel has been very maintained and upgraded over the years. My husband and I stayed in the palace lounge rooms . Our ground floor room led straight to the beautiful gardens and lagoon and was a very peaceful setting.The palace lounge served beautiful breakfasts and drinks in the evening. Restaurants were excellent. We used the gym and spa facilities and they were both very well run. A couple of minor issues with the wifi in our room but all in all Avery relaxing stay.\n", "\nWe stayed for 9 days, but could have stayed longer quite happily.", "Everything from the welcome, room, food, beach, facilities etc... were excellent.", "I recommend everyone try the Balinese cuisine at Raja's Restaurant, delicious.", "We were a couple, but there were many families there as well.", "Would recommend this resort without hesitation.\n", "\nWe booked this hotel for our honeymoon and had a great experience here!", "positive: lovely staff, wonderfull environment, beautifully well maintained park, very nice room with wonderfull beds and pillows (important!), beautifull pools, decent food, lots of choice in food. ", "negative: finshing in the room could be little bit better, bottle of water in room had mold on the plastic, airco always on when you're not in the room. Prices for drinks are pretty high, but in comparison to Belgium, almost the same but compared to other places in Bali, pretty high. No swimming in the sea after 2 PM, low tide\n", "\nOverall better than expected and will probably return for 1 month stay next year.", "Staff were efficient without being intrusive and the dining facilities and food were excellent", "Beach and pool areas were clean and relaxing with all the facilities of a top resort.", "The Palace Club was very useful but would be more suited to couples who want to get away from young children. Children in the Palace Club were a distraction and whilst we love children do not want them chasing around.", " ", "\n", "\nwe stayed about 3 weeks in Bali - and more than 2 weeks in the hotel. At our 2nd check in we waited more than one hour for our room. :-(", "Beside this experience the hotel is really more than average and we enjoyed our stay very much. all people try always to comfort your life.\n", "\nWe travel to Bali every year and always stay in Seminyak. This year we purchased a special and went to Nusa Dua. We were a little doubtful having never done this before but oh my god how wrong could we have been. We had a fabulous holiday at this resort. The hotel itself is 30 years old but we enjoyed the age, rooms a good size and the large lush tropical gardens are beautiful. There are a number of pools which is good especially if there are families. Food in all the restaurants was great and in fact we had the best steak ever here and thats saying something being an aussie. I would highly recommend this hotel to everyone. We are going back next year. If you can do the Palace Club its terrific.\n", "\nOne of the most beautiful and comfortable hotels I've been. Compared to other hotels in Bali surely one of the best in top class! We've spent wonderful 10 days in this Hotel. It was quiet and relaxing, nice Beach, friendly and helpful people, good management. The food in all hotel restaurants is good, the spa as well. They have a nice fitness room, tennis and squash fields and beautiful and clean pool's. ", "\n", "\nWe had our 7th stay this year at the Nusa Dua Resort,at the Palace Club,we bought the package deal ,good value for money.The hotel is 30 years old ,but still has Bali style ,Great gardens and pools,.All the ladies in the Palace remember us each time we enter the club.We would stay again.Brigita and James.\n", "\nWe just stayed Overnight, felt very welcome.", "The room was a bit far from everything but clean and cozy. ", "We had a excellent but pricy dinner at the asian bistro. ", "We are heading on a four day trip and look forward to coming back to nusa dua .", "\n", "\nMy wife and i purchased a deal of luxury escapes for eight nights 1400 dollars. This was great value as we received 6 free massages 3 free dinners and 1 free pizza. They have a happy hour from 5 till 7 pm near the pools. They also give u vouchers to use to discount food and drinks. The resort is five star and has great pools private beach with lay chairs big foyer freindly staff free breakfast great variety and security front and rear. Money can b exchanged at the hotel. Tip go to minimart for your alchohol. Great relaxing time. Top resort\n", "\nThis is our 2nd visit to Nusa Dua Hotel Beach and Spa- the first for my daughter's wedding in 2009, and this last visit for a famiy holiday. The staff and wonderful and the resort facilities are high class. A great place to stay for a relaxing family holiday.\n", "\nAfter having spent 5 previous visits to Bali in Kuta (Tuban) we really enjoyed the relaxed atmosphere that we found here. I enjoyed the more \"international\" clientelle, a welcome change from the Aussies we normally encounter in Kuta. The breakfast buffet was fabulous. Was expecting to have water sports available to use, so was a little disappointed at this aspect. Also, the lack of a DVD player in the family room was a bit of a let down considering this is when my husband and I get \"down time\" from our active kids. They did offer us a rental one for $15/day which we felt was overpriced. Ended up hiring one from Kuta for $4/day. Overall, a wonderful trip.\n", "\nNice estate and gardens, on the beach, great facilities and good food at different restaurants.", "One remark, given the size this resort is more suitable for families and children then couples. Other than that a nice allround resort.\n", "\nI'm really surprised at the glowing positive reviews for this place as we felt it was just OK. We got 2 adjoining ground floor rooms for a great price. BUT...the food was extremely variable, except for breakfast which was reasonable. The service was poor, especially around the pool, where the staff have limited English. Although I talked as clearly and slowly as I could, and they repeated it back, they still stuffed up our order every single time! It was difficult to feed fussy kids because the staff had limited flexibility. Eg the Italian restaurant would not do spaghetti bolognese! The best food we had was room service. The beds were squeaky, hard and uncomfortable. Our room which faced the garden was dark and smelt dank and unpleasant. The aircon thermostat didn't work properly. The best thing about the hotel was kids club where the staff organised great activities like kite-making and flying. The spa was also lovely and the massages on the beach were good too.\n", "\nThe resort is rustic in line with Balinese culture. The service and amenities are great. Kid friendly with appropriate pools. The proximity to other resorts provides choice of food. Beach is coral lined thus limited for swimming unlike Seminyak. Overall recommend and would visit again.\n", "\nFor a comparatively inexpensive Nusa Dua resort this hotel really delivers. The new tollway from the airport really impressed. No more traffic jams and an enjoyable 15 minute taxi fare from the refurbished airport saw us to the hotel. It's an easy stroll to the Bali Collection but the hotel restaurants are well priced ( for food) and great quality. The room was neat but the floors was slippery and the shower blocked up. The room overlooked beautiful gardens and overall I would say I was very happy with my week at this hotel.\n", "\nThis hotel is fantastic. The grounds, pools, restaurants and rooms are wonderful, but most of all the staff are an absolute delight. We gave only been home for a few hours and we already have family planning to book this hotel for a holiday next year. We will also be staying there again next time we visit beautiful Bali!\n", "\nHoneymoon travel. Everything was perfect! Quiet and clean rooms, helpful employees, clean beach, delicious dishes... We choose the club lounge room and we had a separate breakfast with a nice lake. We totally recomend this hotel", "\n", "\nLovely resort with great pools, spa facilities and great location. Amazing buffet breakfast, friendly staff, comfortable and clean room. Bed was two doubles pushed together which was uncomfortable in the middle and on arrival the staff did not provide us with much information about the resort or Nusa Dua area but apart from this we had a wonderful stay. Will stay again.\n", "\nCame back to Nusa Dua after 30 years. Back then it was the only hotel in Nusa Dua. Just as I remembered it. Still a world class hotel. Had a couple of massages at the spa both good. Staff friendly, breakfast was the highlight of my day. Beach lovely. Overall a really relaxing stay.\n", "\nthis is one of the best 5 star hotels in Nusa Dua.. i stay in \"club room\" where you can have your own reception and free snack(will it's more than just a snack) and you took it in a privet garden with a beautiful lake, and its just for the guest who stay in this kind of rooms only.. it's really so nice place to set and relax..i love everything about this hotel ..the service,the swimming pool the beach the staff ..and lets not forgot about the hotel's manager who really taking care of all details ..thank you so much.. it's rally worth every cent you sent for it.. i would highly recommend it for everyone.\n", "\nWe loved staying at this resort, it felt like it was 5 star in every respect. The grounds were massive & the facilities beautiful. Several swimming pools so it wasn't hard to find a vacant deck chair.\n", "\nSpent a week in Nusa Dua Beach Hotel & Spa as part of a package deal. I was initially skeptical (too good to be true?!) but was put at ease almost upon arrival. Staff were attentive and very helpful - stands out were Nour (massage therapist) and Anita (breakfast run) - and most importantly non-intrusive. Great place to visit if you need some R&R - all services and facilities were more than satisafactory.", "Some (small) negatives: towels weren't always available in women's change rooms (near spa); vegetarian food wasn't clearly labelled & the egg cooking station needs a vegetarian only frypan & utensils; suites were overly chilled (great for males!); desserts need working on....", "Otherwise we highly recommend this resort and will visit again.\n", "\nWe have stayed at other resorts on the beach at Nusa Dua and found this to be the best experience. We had stayed 8 days at the NDBH and then left for Seminyak for 7 days. We only lasted 24 hours in Seminyak and decided to leave as the mosquitoes were driving us mad. We could have gone anywhere but decided to return to the NDBH on short notice and could not have been happier with our decision. The kids (5 and 7) loved the place and did not want to go home. Thanks Bruce for making us feel so welcome.\n", "\nWe booked through Luxury Escapes in Australia and it was all wonderful. My daughter just wished the fruit smoothies were available every day at the breakfast buffet!!!The staff were so friendly and helpful.", "\n", "\nexcellent value for money package. Clean facility. friendly staff. Gardens pool and beach area beautiful, well maintained. Spa and health facility great. close enough to enjoy Sanur and Benoa water sports.Thanks ", "\n", "\nWe have enjoyed our stay here so much we would not hesitate coming here again. Service is friendly and outstanding. Very clean and Food great. A special stand out staff member Anita we thank you. A fantastic memorable holiday at Nusa Dua. Our room was sufficient for the little time we spent in it. The beach is kept beautiful and loved the free bus to bali shopping complex. I felt very safe here. My only negative would be not getting liquid milk in our rooms with the service each day for our cuppa. The service stood out in comparison to a lot of other places we have stayed. The squirrels were funny. We didn't do much exploring but will do next time. Thumbs up guys from the happy kiwis. We have one more day to make the most of.\n", "\nWe enjoyed this hotel very much. The facilities are excellent and especially good for children. Our room (Premier Room) was a good size with balcony.", "The restaurants all served better than average food.\n", "\nFabulous location for a family holiday. The staff were extremely attentive, helpful and friendly. We dined at all of the hotels restaurants and every one was delicious. Great service and great value. Our room was clean and nicely appointed, only negative for me was the in-room mini bar fridge was very small and we were travelling with an infant so ok room for bottles but would have been handy to have some additional space for the actual mini bar items themselves (we had to empty it to allow for the milk and baby bottles). We travelled on a very early am flight and our room was ready to go upon our arrival at around 11am. Would definitely recommend Nusa Dua Beach Hotel as an excellent family get away.", "\n", "\nNusa Dua beach hotel is a fantastic and impressive complex. Staff are excellent, rooms were clean and thoughtfully set up and the overall facilities pretty much cater to those who want to stop and just relax. Meals are expensive as are alcoholic drinks (typical of resorts) and our first night eating at the Balinese restaurant onsite was very disappointing. So much so that we determined to eat dinner anywhere else but here. We quickly found several other very good eateries along the beach so this was not a huge problem for us. Breakfast choices were 5 star with freshly cooked eggs, omlettes & pancakes, excellent breads & great coffee along with local and traditional western breakfast ingredients.\n", "\nThoroughly enjoyable 8 days with two small children. Pools were terrific, staff excellent, room comfortable, , facilities great, grounds impeccable. Never felt crowded and the other guests were all very respectful and quiet. Highly recommend to others with young children. ", " ", " ", " ", "\n", "\nThe Balinese styled hotel is an outstanding holiday destination one of its main attributes is the dedication and warmth of their staff many of whom have been with the hotel for many years plus world class facilities and service. I broke my ankle in Ubud and the hotel went the extra mile to ensure I was comfortable and cared for. ", "Geraldine porteous\n", "\nLocation - great. Hotel run down and room VERY small for 2 adults & 2 kids. Kids bed not in room on arrival and waited over an hour to get it. Staff lovely. Wait staff slow to replenish drinks and unsure about gluten in food. Spa was delightful.\n", "\nThis was our first time to Bali and it was fantastic!! We absolutely love Nusa Dua and the resort was excellent! Nothing can be faulted what so ever!! Easy access to everything that Bali has to offer!", " ", "\n", "\nDisappointed when we arrived, and our other couple were not booked in. We could have done without the hassle, however it was rectified pretty quickly.", " Awesome food, service, drinks and hospitality. Definetly be back to stay.", " ", " ", " ", " ", "\n", "\nGRound are great very clean, service in the palace club in the evening was very poor , we waited 40 mins for our drinks order , staff were selective in who they served other visitor got preference at evening time , we felt neglected on all 3 evenings , not like the service when we visited the last time .very disappointing ,\n", "\nBeautiful location and grounds. Great service and nice rooms. Lucky enough to see a turtle laying her eggs on the beach. Would definitely return and recommend to anyone. Great memories for our family!"]