[" ", "\n", "\nWe recently spent 5 nights at the Resort. We loved the location and friendly staff. Nothing was a trouble and we were always greeted with a smile. Our son had their wedding at the Resort which was beautifully organised. The food was lovely and the amenities were great.", "Our grandchildren loved the Kids Club and we felt safe leaving them there. A great place for a family holiday. Wow and were the beds superb.\n", "\nthis was a holiday of a lifetime. myself and my two daughters 11yrs and 14yrs thought we were in PARADISE. the hotel and surroundings were authentic and pristine. food was brilliant. a little more expensive than Kuta but standard of everything soooooo much better. would come back in a heartbeat. pools and sports facilities, table tennis, tennis, gym just great. staff all fantastic. thank you all for a great holiday, will be back as soon as possible!\n", "\nWhat a fabulous experience we all had! The 8 day Indulgence package was absolutely brilliant and we used everything in our voucher and then some! The staff were wonderful and attentive. Luxurious :)))", "\n", "\nWe have just returned from our eight night stay with the luxury escapes deal so many of you are familiar with. We opted for the premium deal but not the Palace Club upgrade and were not disappointed at all. We stayed in a ground floor room in the Agung wing, near the pool (room 1138) and the room was lovely, with easy access to everything. Lovely traditional Balinese timber finishes, a large comfy bed, nice bathroom and small balcony (although not covered if it s raining – none of them are). For us personally, I am glad we didn't take the Palace Club option, whilst it looks beautiful and the tranquil duck pond side of the resort is gorgeous, we prefer a little action and \"people watching\" and found the pool side to be a little livelier whilst not being too busy or noisy at all. You will hear trolleys being pushed across the pathways from about 7 am as others have suggested, but this was no problem for us. Our room was interconnecting with two solid timber doors adjacent to our respective televisions. Our first neighbours liked to watch TV until late and again from about 5 am, which was annoying as it was clearly audible in our room, however, this is no fault of the resort and they checked out after two days before I bothered to comment, so meh. ", "The grounds in the hotel are amazing and the photos do not do them justice, perfectly manicured grass areas, with frangipani and bougainvillea all around as well as the cutest squirrels. The ground staff are exceptional and must work like fairies in the night as they are seldom seen and in no way intrusive, yet manage to ensure not a blade of grass is out of place, a tremendous credit to this 30+ year old resort. Walking the beach front in both directions you'll notice the newer, 'western' 5 star places are cold and sterile by comparison and lack the tradition, warmth and character that abounds at this resort. ", "The staff are wonderful, beautiful friendly people that cannot do enough for you, for the most part, although I must agree that the pool staff could be more attentive and actively participate in daily ‘goings on’ around the vast pool area and surrounds. We were there on some days with 90 % occupancy and it never felt too crowded, with sun beds available in shade at all times of day, however you are left to your own devices to secure them, move them around, etc, and this could certainly be improved with the help of poolside staff, who were often hard to find.", "As for the package, it is impressively facilitated especially given 600 to 800 guests being there on the same deal !! The spa is wonderful, the setting is beautiful and the small lap pool is perfect and never busy. The treatments were heavenly, professional and again this is so well organised that you feel you are a vip guest alone, despite the number of treatments they must manage to provide for so many. A brilliant effort by all involved. ", "We too had three buffet dinners and couldn't fault the facilitation of these, other than drink service being a little slow, but hey, it's a huge undertaking to provide good quality food for so many people over about 3 hours. Theme dinners are Mon, Wed and Fri and we found all to be very good across the board and certainly value for money when compared to other dining options, especially when they're part of a package you’ve already paid for ! We met couples from other resorts that had come for the theme dinners and they were very impressed. I have paid considerably more for buffets in Melbourne, Sydney and Brisbane that were nowhere near the quality on offer here. Sure the odd dishes were hit and miss, but there are so many good ones to select from. The shows accompanying the dinners were also excellent and all in all well worth doing. ", "The Pizza bar or Italian restaurant (Sandos ?) by the pool is excellent, the pizzas were delicious, you get one free in the package and they cost about 10 to 12 dollars AUD and are great value along with some lovely modern and traditional salads ($7 ish). The food at Chef Restaurant by the pool was a little disappointing and I'd give this a miss. Breakfast was excellent, again, impressively managed for so many people, we thought breakfast at the Amari Palm Reef in Koh Samui was the best we had seen in South Asia, until now, this is fantastic, the fresh produce is immaculate. ", "Food is expensive in Nusa Dua generally, (example, hot dog or hamburger only at the resort circa $8 AUD) but there is a great little beach side bar and cafe called the Pirate Bar about a ten to 15 minute walk (turn right) along the beach. Great setting and well cooked fresh food. (example proper Calamari and chips $3.50 AUD). Bali collection is better than many people suggest in our opinion. We ate at the Japanese Garden restaurant there which was very good value (14 pcs tuna and salmon sashimi, Sukiyaki for two and miso soup for $30 AUD – sans booze ). Shuttle bus to Bali Collection on the hour (other than 5 pm) is well worth the trip, all of 5 mins. Prices for clothing were on par with the large centre in Kuta and a lot less hassle. ", "Last tip, if like me you enjoy copious amounts of wine, south east asia is not for you, especially Bali. If you are familiar with Penfolds Rawsons Retreat (about $7 - $10 AUD a bottle in Aus) we went to a restaurant in Ubud where it was on the menu for $90 AUD, yes, that is \"ninety\" (90) dollars !!!!! Line the bottom of your suitcase with 2 LT casks, seriously, it’s worth a try :) Cheapest bottle of something drinkable (and I mean just) in a sav blanc or cab sav at the resort was a minimum $40 AUD. If you buy it at Bali Collection supermarket, you will pay over $20 still..... ouch. But not the resort’s fault, and you can weigh this against other cheap things and you then justify drinking wine daily, at least that worked for me :)", "All in all, the Nusa Beach Hotel is lovely, a traditional building in idyllic surrounds on a beautiful beach with the most wonderfully friendly staff and some great food. Could I justify staying here at list prices given the additional expenses of wining and dining ?... No, but on a package deal such as this it is a delight and an opportunity to experience 4.5 to 5 start luxury in what is sadly a gated community bereft of Balinese culture save for this authentic resort.\n", "\nLocation rather isolated but Taxi's cheap. Staff very friendly and accommodating. Our room wasn't ready until 5pm though. Also, room is very dimly lit which makes it difficult to iron clothes. Italian restaurant spinach cannelloni was rubbery and topped with heavy thick cheese, Very poor. Pizzas slightly burnt and we had to send it back as my daughter asked for no oregano. Pool very relaxing and staff accommodating with towels.", "\n", "\nA perfect location,wonderfull facilities and marvelous staff,but the chef seems to be able to destroy the beautifull ingredient used in the food preparation.", "Fish is cooked dry or coated in charcoal, lamb overcooked,chicken kebabs either raw or charcoal, ", "We attended 3 buffets during our stay as part of the package so sawa good crossection on what was on offer. We stuck with the food not spoiled by the chef.", "I strongly suggest that management secretly try the fare they offer and draw their own conclusion.", "I have been a regular visitor to this great hotel but will have to review my options for the future.", "Also get some activities going, organised by the lazy pool staff.\n", "\nWe took the upgrade to the Palace Club and are so glad we did. From the", "\"meet\" at the airport to the private check in.. the Balinese style buildings ", "inside and out gave us the feeling of really being somewhere different.", "We enjoyed the friendly, smiley service - the Restaurant by the beach was a bit slow but it didn't seem to matter in such stunning surroundings. We ", "commend the Resort in general. Excellent value for money. ", "\n", "\nI would struggle to recommend this hotel. The rooms are nice but $300 per night for the most basic room is fairly outrageous, especially when you're expected to pay extra for wifi in the room. The food from the restaurants is also woefully overpriced for what you get.\n", "\nstaff were extremely freindly,food was fantastic and palace club room had everything you could want. Overall we thoroughly enjoyed our stay and will definitely be returning. the grounds were immaculate and welcoming. thank you for a great holiday", " ", "\n", "\nPosition position position! Nice hotel really Bali style beautiful location very nice staff the pools and hotel gardens are kept very clean. the only thing i would recommend better aircon and a coffee machine I hate creamer. And more seats around the pool. ", " ", " ", "\n", "\nloved the size of the rooms, always cleaned perfectly, visited the dr/nurse few times for the kids, that was excellent, breakfast was a favourite. Location was great. Staff/people very friendly. Thank you.\n", "\nMy stay at your hotel was very nice except for a few things. Limited seating at pool area which had to spend time to locate. Waiting period during breakfast was quite long. If I arrived at the restaurant after a certain time, waiting period was more than 30 minutes. Only way to avoid this was to have breakfast quite early.", "Either than that, all was very good. All staff members was friendly, helpful and attentive.", "\n", "\nWow! The Nusa Dua Beach Hotel and Spa is beautiful. Lovely landscaped grounds and traditional architecture everywhere. Lots of hotels in the area are austere and very grandiose. This hotel has a different vibe. The staff and amenities are very good. Our daughter has a walking disability, and we felt that the grounds and layout of the place was very accessible - lifts to all floors also. It can get very busy by the two big pools at the front of the resort. Another quieter option we discovered was the lap pool by the spa.Lots of spare pool lounges - children under 12 not allowed in this area. We had a Palace Suite, and all the extras that went with that luxury accommodation - afternoon tea, cocktails, free meals and massages - well worth the upgrade.\n", "\nThis was our second stay at the hotel having spent 9 days there a year ago and it remains a very special place. One of the outstanding aspects is the high calibre of the staff, they are very helpful, always welcoming and do it with a smile. This time we spent 10 days at the hotel and again stayed in a Club room with access to the Palace Club lounge. The club staff are exceptional, whether it is making sure you are happy with your food to making restaurant bookings and arranging transport nothing is a problem.", "This was the first big hotel built in Nusa Dua and has spacious beautifully landscaped grounds, setting it aside from many of the more modern establishments. The down side is that it's rooms are a bit old fashioned and could probably do with a refresh, but that said they are a good size, have plenty of storage and the beds are very comfortable. Since our last visit the hotel has rolled out free WiFi which when completed will be available throughout the hotel. I found the speed good and only rarely had to resort to using cellular data.", "Our second stay here certainly didn't disappoint and we plan to return again. If you are looking for a relaxing hotel with a great beach, nice pools, superb staff and a beautiful setting this hotel is certainly worth considering. If you like to have breakfast served to you in a lounge setting looking out over a wide expanse of gardens, drop in for afternoon tea or evening cocktails go for a Palace Club room it's worth the extra.\n", "\nLovely hotel in a great location. Facilities were great and staff were extremely friendly. Service was a little slow at times, but it's not too bad when you are lying around the pool relaxing. Restaurants were a bit expensive and the service was a bit slow, but the atmosphere was great.\n", "\nWe stayed here for a week as part of our Honeymoon. The resort is lovely and food was very good, and the majority of staff were excellent. The service at times was very slow and i feel the food was over priced. A few of the nights we actually headed to the local shopping centre (there is a shuttle bus which goes from the hotel) which had a great variety of restaurants, which were better priced and also got us out of the resort as the resort was very quiet at night. We had come from Singapore and the hotel there had left us a lovely card and bowl of fruit to acknowledge our Honeymoon but there in Nusa Dua which was a wee bit disappointing.\n", "\none small issue with the reservation on seats on the pool. Ok the most people make the reservation early in the morning, sometime nobody come to use this seats. Possible more control or an procedure. Also in the peek time not enough cheers are available.", "Further an absolute perfect location. Your people behaviour is super,", "KR", "Michel Muhlebach", " ", " ", " ", "\n", "\nHaving read many of the reviews about this hotel - I decided that it was good value for money and that the hotel itself was living up to its guests reputation. I was immediately impressed on arrival by the warmth and reception I received on arrival. ", "The deluxe rooms are luxurious with the best space and king sized bed. The bathroom with separate toilet was huge. Great big bath as well. Shower with large elephant rose for that extra long shower. ", "Breakfast was buffet style. It is the best buffet I have ever seen (I have seen many being a flight attendant).", "The swimming areas are large and comfortable. You have to get down poolside early to reserve your deck chair, or you'll miss out. ", "Room service was excellent as was the hotel restaurants. ", "I look forward to coming back to Nusa Dua Beach Hotel and Spa for another visit next time I come to Bali.\n", "\nIt was a great place to stay with our 2 young children. The grounds were beautiful and the staff very friendly and welcoming. The location of the hotel is excellent. If you book into this hotel make sure that the staff is informed if something is not as you requested and it will be quickly sorted out.", "\n", "\nTo say we enjoyed our stay is an understatement. My family & I stayed at this hotel from June 25 to July 3 2014 to celebrate my 40th birthday. I have to pat myself on the back for choosing well.", "The staff were all attentive, helpful & extremely friendly - that goes for the security guards at the front gate as well !!!", "My two girls (aged 4 & 7) got entertained at \"Gecko's Kids Club\" almost every day as they did all sorts of fun activities (puppet making, baking, & bali costume dress up to name but a few). While the kids were distracted, my wife & I indulged ourselves at the spa & massage.", "The Theme nights on Monday,Wednesday & Firday nights are not to be missed as you are entertained with some balinese culture while you dine. My girls enjoyed Friday nights' theme (Fire dance) as they got to have an impromptu sing with the band afterwards.", "Situated in a superb lush garden, I personally found the temperature cooler that in the hustle & bustle of Kuta.", "Now if you want to do some shopping, there is a great shopping complex called \"BALI COLLECTION\" situated nearby, accessable with a free shuttle every hour from the resort from 11am onwards (or a cheap AU$3 taxi fare). Bali Collection has a host of yummy restuatrants to cater to all tastebuds, wherever you came from. Be advised however, some of the prices they quote on the menus are EX-TAX - that is you need to add approximately 21% tax on top. ", "There is also the Nusa Dua Village which is approximately 20 minutes walk out of the resort (or a AU$2.5 taxi fare). Be warned though, you will be .... um.... \"asked\" to look/buy from their stalls, not as forthright as in Kuta but more... polite.", "The room we stayed in was a Premium room. It was HUGE !!! The main bed was a Super King size on steroids & the bathroom was very spacious.", "I cannot speak more highly of this hotel & I must commend Urs (The GM) & his staff for making our stay enjoyable & memorable !!! Thanks Nusa Dua Beach Resort & Spa !!!! ", "To quote General Douglas MacArthur - \"We shall return !!!\"\n", "\nExcellent pools with beach access. Hotel room is aging, wash room a little small, but still acceptable. Gym is totally out dated. If there is an outdoor jacuzzi next to the pool, it would be perfect for adult over seeing their kids at the pools. Foods price are reasonable for a 5 stars & very good taste overall.\n", "\ngreat authentic feel to this resort. Location was perfect and within easy travel times to most sights and restaurants. ", "Lots of choice for food and activities and looking forward to bringing my whole family. Staff were superb. Good value for money. ", "\n", "\nWe spent 9 days in Nusa Dua Beach and Spa hotel. Amazing place, staff were great friendly and helpful, food excellent, great place to relax and regenerate. It's a great place for families or couples, the resort is kept immaculate and there are plenty of restuarants/bars.", " ", "\n", "\n3rd time I've stayed at Nusa Dua Beach over 13 years and although it has had updates over the years, it could do with a refresh. I still love it though and will go back, staff are friendly and helpful. Some of the new staff are struggling and we did wait over an hour for food on 2 occasions at the same resturant, Chess.\n", "\nWe thoroughly enjoyed our stay at Nusa Dua Beach Hotel. All the staff were very friendly and helpful. The services were prompt. For example, I requested a stroller, and that was delivered to my room in 5 minutes. The themed dinners were really special and enjoyable, and my children especially liked the fire dance on friday night. My husband turned 40 during the trip, and the hotel staff even surprised us with a cake and fruit plate!", "\n", "\nThe reception staff discriminates between asian and Whites, former has a luke warm reception the later one gets a welcome drink and garland around his neck. The chess restaurant male staff i the young chap when asked about a particular dish on the taste replied he doesnt know he has never tasted it. Howeever i have a special mention all the female staff were welcoming and all their service was with a smile. Similarly the service and ambience at the SPA is excellent. I must take this opportunity to make a special mention of the property as a whole is very beautiful and is surely very impressive morever all the pools and restaurants are ideally located and accessible also food served in all the restaurants are excellent ", " ", "\n", "\nNusa Dua Beach and Spa hotel must be the best place to stay in the whole of Indonesia. The staff were amazing, very friendly and helpful. It's a great place for a couple or families to go to. Its manicured gardens were amazing!!!\n", "\nGood was very perfect. I had my wedding there few days bac with over 100 pax. Coordination of people and food were excellent. I will definitely go back for a weekend getaway to relax. All staff was helpful and efficient. Even all my guest was do surprised that the wedding food taste excellent and thumbs up!\n", "\nWhat a lovely hotel. Nestled amongst other big brand name hotels, the NDBH stands out for its Balinese architecture and ambience. Balinese touches abound, from around the lobby through to our room with carved wooden architraves and Balinese slippers. We were met at the airport by the hotel and whisked to our room where cool crisp cotton sheets awaited us. (The ONLY thing that marred our arrival was that the rollaway bed for our son wasn't set up, but that was minor.) Breakfasts are HUGE. The staff are friendly, helpful and always smiling. We were sick whilst there and saw the on site nurse. The hotel followed up with a phone call to see whether a doctor was needed, and also sent us a bouquet of flowers! There are free activities around the hotel every morning, kids are well catered for with kids club and movie nights etc, and the beach is safe to swim as there is an outer reef with (at tide turn) spectacular breakers. Three dinner shows are put on each week which are well worth going to. Laundry, Room Service, Gym and Spa are top notch. The hotel can arrange taxis or day drivers, but we found it easy and cheaper to arrange our own (just go down to the taxi carpark and ask. Bargaining is easy, start at about 1/3rd their starting price and work up. 150IDR to Kuta, 4-500IDR for day tours ie a full 8hrs. Mr Keni and Mr Ronda are excellent drivers). The pools are great. The highlight of our hotel? The squirrels, so cute and if you're quiet and gentle, they'll feed from your hand! We are already planning our return.\n", "\nMy wife and I purchased a Luxury Escapes deal and stayed for 8 nights in a Palace Club Suite. The suite was on two levels with a large living room, two bathrooms, kitchette, balconies with a large bedroom and bathroom upstairs. The bed was extremely comfortable and huge. The Palace Club deal gave us lots of extras, such as evening cocktails, table service at breakfast etc. The staff were wonderful would do anything to assist you. We were in a suite away from the pool which we loved as it was peaceful. Some people prefer being close to the pool but it depends on your preference.", "The food at all the restaurants were delicious and the special nights had such variety of food you couldn't try them all.", "I have read a couple of bad reviews for this hotel and cannot understand how people could write such things. This is a wonderful place to relax in and chill out. The beach is great for a swim as well as the pool. To get a pool side seat under an umbrella you need to be there early though.", "A great hotel that we would love to come back to. Thankyou to all the staff\n", "\nAfter spending 8 days in Legian it was a pleasure to come to NDBH and wind down. The surroundings are very relaxing and the layout is very user friendly. My wife and two young daughters enjoyed many of the resort facilities and had a great time doing so.\n", "\nFriendly staff, beautiful location, great facilities. Nusa Dua was a fantastic place for a relaxing escape. The staff were lovely and the facilities were beautiful. Every aspect of the resort was fantastic.", "\n", "\nBought a luxury escapes deal and spent 8 nights in a premier room (upgrade from the deluxe room) with 2 young kids aged 4.5 and 8 months. Honestly cannot fault this resort. Every one of our requests was met with a \"yes\" and a smile. The package had loads of inclusions starting with the fast track at the airport, return airport transfers (the resort actually allowed us to use the return part of the transfer to be driven to our second hotel in Sanur as we were not leaving Bali), daily buffet breakfast which was fantastic (amazing fruits, vegetables, freshly baked breads and pastries, Indonesian breakfast foods, eggs, bacon, etc), 3 themed dinners (we missed the first one and the resort gave us a 3 course dinner voucher to use in our choice of on-site restaurant), welcome cocktail, one off unlimited laundry, USD45 room service voucher, 6 x 1 hour long spa treatments etc. The premier room is usually equipped with a king bed and a separate living space which opens out onto a private balcony/terrace. We asked for an additional single bed which was placed in the living area which effectively turned it into a second bedroom for us. Once we arrived we also requested a cot which was provided free of charge. The cot was clean, good quality and the hotel went even further by providing a few nappies, wipes and baby lotions. ", "The resort grounds are beautifully landscaped and contain several gorgeous pools, 3 of which are child friendly. The resort is located on a private beach with very few sellers so we were not hassled the few times we actually used the beach. ", "Other points - the rooms are serviced daily, there are minimal mozzies around (which was a huge concern for us), decent wifi, lovely staff (Ratih in guest relations is just wonderful) and a kids club that our 4.5 year old really enjoyed. ", "The only negative - there was a bad smell in the bathroom when we arrived but they attended to this issue as well. ", "Overall, if we ever return to Bali, this would be the resort we'd come back to without hesitation.\n", "\nWe had an amazing holiday, thank you so much. Everything was excellent, we would love to come again! I would recommend your resort to friends and family. It was a great family holiday. So much for all ages to do.", " ", "\n", "\nA fantastic resort for families and couples, not for singles. We stayed in the Palace Suites which provided additional free afternoon snacks and then free cocktails for an hour and a half every night. Other than that the rooms were not dis-similar that others and unfortunately were away from the beach and sea breezes. Breakfast was held in the Palace lounge but didn't quite offer the same as the general breakfast dining room. The 3 pm checkout was very beneficial when we were leaving at 9pm. Idid have some trouble with service on one day but believe it or not it was not a local but a foreigner who could not get the service correct. The spa was great and very accommodating on booking times etc. If I had one real complaint is that the air-conditioning does not go below 23deg C.\n", "\nGood location, nice beach (although when it was low tide it was difficult to swim...), nice and always smiling staff. Price is acceptable and the Hotel has lovely gardens. ", "What we didn't like was having a room with communication to the next room, something than can be solved easily.", "\n", "\nThe resort is 31 years old and is well maintained and the has the Balinese architectural design and charm that the newer hotels lack. Everything works well and the showers are excellent. The massages are also excellent. The buffet breakfast was delightful and plenty of selections. We are planning another trip next year with family. ", "My suggestion to management is that they seriously consider having a place for the guests to dance with some good music. People enjoy dancing and the atmosphere at the resort is a great environment for people to dance the night away.\n", "\nWe really enjoyed our stay at NDBH. The food was fabulous and reasonably priced for resort facilities. The bathroom could have been cleaner and we had to request our towels almost daily. The hotel charged us for in room wifi which we did not use at time of check out. Which we paid, but this made it disappointing.\n", "\nStayed in a family room at the Nusa Dua Beach Hotel & Spa a week or so back. The room had a double bed and a pair of bunks - pretty close quarters for a family of four, but still better than two rooms when you have young kids.", "The NDBHS was pretty standard for a Nusa Dua resort, very extensive grounds with lots of facilities, a little bit worn, belying the age of the place. The selection of four different restaurants/cuisines to eat at was good - meaning we weren't choosing from the same menu each and every lunch and dinner we ate at the hotel. The breakfast was probably the most extensive I have come across in my time and that is really saying something. And, it's Bali so the staff were extremely friendly and helpful. ", "The kids club was more like a crèche really, but by picking and choosing the odd activity, we were able to satisfy both our kids, and give ourselves some time off. It would be great if they could offer some more age-targeted activities, say something for the 7+ age group.", "On the downside, the pool area is showing its age - which is about 40 years iirc. It could well do with a renovation to give it a bit more shine; and compared to its neighbours, the water area is quite small (though the main pool is nice and deep). We also tried to book into their spa, and found that you really needed to make a reservation 2-3 days in advance to get a suitable time, keep that in mind.", "Being an Aussie, I get really irritated by prices being listed before tax and service fees. Just give me a final price I have to pay please, especially when that's the drinks list, the menu, the charge to take out a bike or have a spa treatment. That's probably not specific to this Hotel, but it gets my goat.", "Overall, we were after an easy resort experience, and this place satisfied expectations. Granted those expectations weren't very high.\n", "\nEverything we would expect from a resort of this standard and could not find any faults with any aspect. Food and service by friendly staff was something to look forward to and enjoy. Very sorry to have to leave.", " ", " ", " ", "\n", "\nWe were really able to unwind and enjoy ourselves in Nusa Dua. A beautiful blend of traditional Bali and luxury, away from the madding crowd! This resort is well-designed and we enjoyed our stay immensely.\n", "\nWe had a family room with King bed and one single bunk bed in attached separate room. Rooms are a little dated but in excellent and clean condition. We did use room service several times and found the kids menu to be very good with well sized portions. Breakfast buffet was excellent but getting a table is a little difficult if you go late for breakfast. Staff members found to be very friendly & nice. Bali Collection is only a 10 minute walk away for alternative restraunts and supermarket supplies. Kids enjoyed the kids massage at the on site spa. Overall we had a very pleasant & enjoyable stay at the Nusa Dua Beach hotel & Spa.\n", "\nWe loved every minute of our stay - very happy with all of the facilities - the Spa was magic and the best part of the trip. The Resorts position was ideal. Excellent service from the friendly staff. Can't wait to stay there again.", "Value for money was excellent. The household staff were a joy and made up our room daily with care - nothing was too much to ask- Our memories are great.\n", "\nFor a very grand hotel it boasts the atmosphere of a small boutique with all the luxuries that a larger hotel offers. An incredibly warm welcome, excellent service throughout and all staff are incredibly helpful and attentive. Food is excellent as are the rooms and facilities Nusa Dua offers, we would love to come back! A special mention to Mariani in the tourism office, without her help and amazing personality the remainder of our trip in Bali would have been slightly chaotic - she's so great.\n", "\nIncredible atmosphere and very relaxing ambience. The staff are exceptional and dining is a fantastic experience. Value for money with different package inclusions is amazing. The Spa is high end and a luxurious treat.", "\n", "\nGreat beach location, friendly staff, helpful management {offered late checkout-6 pm} Can't really fault them. Would happily stay there again. Meals can be a little expensive, good wine[Australian] VERY expensive, even from local supermarkets, house wine ordinary at best.", " ", "\n", "\nWhat a fantastic location. Comfortable rooms with a wonderful view.", "Peaceful and tranquil grounds, inviting pools and top class amenities.", "All on site restaurants and bars were of the highest quality, and the friendly staff tended to your every need with a smile.", "You can do as much or as little as you desire in this 5+ star resort, and its sensational surroundings.", "A place we would certainly re visit in the near future.\n", "\nWe went to Bali to celebrate our wedding anniversary. I am happy to report we had wonderful cooperation from all hotel staff and our stay was a very pleasant experience. I wish to say 'Thank you' to all staff.\n", "\nHusband and I - second visit to this resort. 8 Amazing nights stay- just to relax, and enjoy Bali as usual.", "Buffet breakfast - to die for!!", "Staff friendly and helpful. ", "Hairsalon at hotel - prizes can be looked at- to get customers of hotel", " ", " ", " ", " ", " ", "\n", "\nNice and quiet. Beautiful surrounds. Hotel staff friendly and helpful. Good food and service. Our whole family love staying here. Have been here quite a few times already and look forward to coming again.\n", "\nNothing but praise for this Resort… Had 10 days, and everything was so Good !", "Our 3rd stay in Bali, and the Best by far…. Without exception the staff were charming, friendly,", "& so helpful, & loved the massages ! The Breakfast's were Great, and nothing was too much trouble for the excellent staff.\n", "\nWe had eight nights at this resort and was made to feel welcomed from the moment we stepped out of the transfer car into the lobby. We had issues re Passport in Australia and had to move original dates which the staff were very understanding and accommodating. The resort has a great feel to it. Staff were always extremely helpful when asked. The resort is well laid out and suits familys or couples. The pool near the Gym,Tennis Courts etc... was just great. Not too many knew it was there as most would gather around the main pools at the other end of the resort which includes the childrens pool. The resort was well maintaned and cleaned on a daily bases. Breakfast was alway enjoyable not only because of the variety of food but the magnificent surroundings. Staff were always on hand to refill your cup with tea or coffee or just remove any used dishes. The resort's massages were fantastic even though they were free as part of out package deal. Have no hesitation returning again or recommending the Nus Dua Beach and Spa Resort to family and friends.\n", "\nOn a Luxury Escapes holiday and really enjoyed our stay. The hotel is one of the older ones on the Nusa Dua strip but really loved the balinese atmosphere of the hotel rooms and the beautiful gardens. ", "Food in the restaurants was ok but the service was very slow particularly in the Chess Bar restaurant - bring your patience with you!", "The buffets at the 3 theme nights was enjoyable and plentiful.", "Get in early to secure your sun lounges around the pool - people \"reserve\" their lounges early by placing their towels on them and then coming back to them hours later!", "Very friendly staff.\n", "\nstayed at nusa dua beach hotel &spa from 15/06/14 25/06/14 traveled with another couple our room was great there room next door was not it it was not clean and smell very bad [broken septic pipe was found in the end] were to be give 2 other rooms people in rooms stay more time so we had to wait 3 days to be moved TIP CHECK YOU ROOM 1ST food / service staff very good, transport taxis/tour guide in front of resort, some good some not so good take you to places we not want to go, best tour guide[ i have ever had anywhere] MADE BUDIANA phone 085738101051 email madebudi1987@yahoo.com has so helpfull made great trip suggestions very honest and reliable, change money at resort or bail collection money changes in shops outside resort gates are very shifty and will take you down if they can all in all great place [ quite not like kuta or otherside of island], pools, food,people, service,location all very good would stay again for sure\n", "\nMy wife and I stayed in a Palace Suite. The room was very spacious and well maintained. The food in all areas was top class. ", "Only cause for comment was the Cocktail hour for Palace Club guests, perhaps the hotel should consider making the hour an Adults only time as quiet cocktails turned into a visit to the local pre-school.\n", "\nThis Resort is best in Balinese style in Nusa Dua Area. I stayed At this property during my Business visit to Bali only for One Day and my experience is overall very good and best thing is the SPA of the property\n", "\nWe have just got back from a 7 night stay at Nusa Dua Beach Hotel & Spa, which we thoroughly enjoyed! The resort was fantastic, the staff were awesome, nothing was too much trouble.", "We have just got back from a 7 night stay at Nusa Dua Beach Hotel & Spa, which we thoroughly enjoyed! The resort was fantastic, the staff were awesome, nothing was too much trouble.", "We have just got back from a 7 night stay at Nusa Dua Beach Hotel & Spa, which we thoroughly enjoyed! The resort was fantastic, the staff were awesome, nothing was too much trouble.We have just got back from a 7 night stay at Nusa Dua Beach Hotel & Spa, which we thoroughly enjoyed! The resort was fantastic, the staff were awesome, nothing was too much trouble.\n", "\nWe returned home this morning from our 11 night stay at the resort. We loved it and will be back. ", "The staff were always smiling and willing to help. Will miss them.", "The food was expensive to eat within the hotel which pushed us to go outside the walls.", "The family room. Was lovely but had a bit of a odour and slightly run down around the bathroom (2219). We had a lovely view in the mornings. The bunk could be pushed down the other end of the room to give the parents some privacy as I felt I had eyes on me all night.", "The bar staff (esp the bar pool man) and the pool side staff were very friendly as were many others.", "Our room service took over an hour to come then was cold and then changed us with a room delivery service fee even though it was a voucher.", "We loved the games room and a great place to chill out in the heat.", "Gardens were amazing and so well kept.", "Kids loved and enjoyed feeding the fish every day in the foyer.", "We felt very safe and secure at the hotel with the beach security and the gates at the entrance were greatly appreciated. The lovely man carried my daughter to the hotel after falling and cutting her knee open. Such a kind young man.", "We have quite a few food dishes on different occasions were the food was cold. The same food on different days varied and some days stale. I would suggest maybe having a menu A & B for people staying longer and some variety from one week to the next, esp on the kids menu.", "Aprilla in the kids room was lovely and so caring we just found that for our kids 7 & 10 it was too young.", "Fire dance night was disappointing. The food was average, terrible table seated as far as we could go asked for a finger bowl twice and also asked for crackers to open the crab and that never came so could not enjoy my crab. Wasn't impressed as advertised as a seafood night and these basic seafood items (finger bowl and cracker) not supplied on table on arrival.", "Staff need to watch people reserving poolside chairs early and not using throughout the day. Many. Chairs just had towels and no people.", "We thoroughly enjoyed our time at the resort and would recommend it. We thought our Luxury Escape package was great value but advertised as a 2 adults and 2 children deal you need to supply a bed for each person.", "We have fallen in love with Bali and will be back.", "PS. Visit the fantastic Village market just outside the gates (5min walk). Great shopping, restaurants and pampering.\n", "\nWe have just got back from a 7 night stay at Nusa Dua Beach Hotel & Spa, which we thoroughly enjoyed! The resort was fantastic, the staff were awesome, nothing was too much trouble. My husband and son both celebrated birthdays there and were spoiled with cakes, flowers and fruit. Breakfasts were excellent with a great variety to suit all preferences. We ate almost every night at the resort, probably a bit expensive but well worth it for good quality food. We also ate at an Italian just outside of the Resort Gates, this was really lovely too. Special mention to Sinead, one of the staff members who was just gorgeous, so friendly, pleasant and helpful and a real asset to the resort! Thank you for a very memorable family holiday, we will definitely be back!\n", "\nWe spent 9 nights here last year in a Palace Club Suite and loved it, so when it came to booking somewhere special for our 20th Wedding Anniversary - this was our first choice. We have just returned from a 10 night stay this time and it was perfect again......", "We booked a Palace Club Suite again but was upgraded to the Agung Suite - this suite has the best views in the entire hotel with a verandah that wraps around 3 sides. Just beautiful.", "The staff and service in the Palace Club Lounge are excellent - it is well worth the upgrade, a big thankyou from \"Mrs Julie\" for looking after us so well, and the personal delivery of champagne to the room on our anniversary was a lovely touch. ", "During our stay, we ate at all the restaurants and thoroughly enjoyed every one, and I can recommend the Palm Mojito's at the Chess Bar! We also had massages and treatments at the Spa which were very relaxing - the Coconut body Scrub was excellent.", "Keep up the good work \"Mr Dermot\" - it was lovely to chat to you again and hope to see you at the Rugby soon!", "We will definitely be back and highly recommend this beautiful hotel to anyone who wants a very special holiday.\n", "\nWe have just come back from 10 days here (our second time) and had a fabulous break. We were a bit nervous as we had stayed before and loved it so were worried we had set too high return expectations. But we needn't have worried! Our kids love the pools and met some lovely friends. The grounds are so peaceful and well maintained. The staff were amazing - the kids got ear infections and we had flowers and fruit delivered to our room - a lovely personal touch. We are now all in post holiday funk!\n", "\nstayed for 4 nights..the staff were friendly..the room was very comfortable with a large bathroom..the location is far away from crowd..hohoo..there are squirrels play around even in room balcony..so cute :)", "this hotel is lack of wifi..there is no free wifi in room (you have to pay for it)..the free one just in the lobby", "but i did my lovely stay here..\n", "\nThe staff were all extremely friendly and always happy to help, generally with good English.", "Particular mention must go to the \"effervescent\" Anita, who would bend over backwards to help, even to the point of joining us for a game of soccer........GM take note, this lady should be rewarded for her extraordinary enthusiasm and warmness!!", "Hotel facilities were great, although rooms were slightly small. Upon distant inspection of close neighbouring hotels, The NDBC appeared to represent very good value.", "Food generally good, particularly breakfast. Did notice inconsistent levels over different nights at the Chess bar restaurant........first night great, last night, very average!", "On the whole, much cheaper in Seminyak or other towns to eat, but no taxi ride to pay for, or 30 mins in traffic, so a good option at times.", "Would not hesitate to return to this hotel, for a very relaxing holiday.\n", "\nThis hotel is the perfect example of mass tourism. It is huge. It has all the amenities you need if your “thing” is to spend most of your holiday at the hotel. ", "We booked months in advance and requested early check-in, in a room on the ground floor with a view in a quiet area, not too far from reception. What we got was normal check-in at 2pm, a room on the second floor, no view to speak of, with some noise at night from the entertainment in the restaurants and not too close to reception, but not the furthest away either.", " ", "We did not expect to receive all requests, but then we thought we may at least get one, but what was most sub-standard was there was no explanation or apology from the staff.", "As an older couple who spend more time in the room than most people this was bitterly disappointing for us. It contributed to a very unhappy holiday. ", "This place is perfect for families with children. A lovely beach with calm water, a range of pools, kids activities at certain times of the day. Recliners by the pool are available but not many compared to the amount of people swimming. We stayed 10 days and in that time we were not able to score any of the recliners.", "There are a number of restaurants to dine at with mediocre food and service. Theme nights with buffet dinner, get in early and top your plate up because they usually run out of food within the first hour.", "The spa area is worth a go. The girls do fabulous massages but it is essential to book. They are a bit uppity when you ask if someone is available and you don’t have a booking.", "All in all we will not be using this hotel again. There are a lot of beautiful hotels in Nusa Dua, this would be last on my list.\n", "\nThis hotel was great for our family but it was disappointing that out of all the restaurants at the hotel we were only offered a kids menu at one, and room service had a kids menu. ", "Kids club was good but disappointing also as the activities were compulsory so my son could not going in and just 'play'. ", "Family room was great but perhaps having the adults bedroom off the main door would have been more useful. ", "The games room was great but is so much further away from", "the main hotel that we only used this once.\n", "\nHave just come back from an 8 night stay, on a cudo voucher, and could definitely have stayed longer! Travelled with a 3yo and 9 month old. ", "Stayed in a premier room, with additional cot and single bed. Was a little tight, so wouldn't go smaller if you can avoid it. ", "Pool facilities were lovely, and the hotel runs straight onto the beach so many an hour spent building sandcastles in the shade! ", "Food at Chess was great, and felt reasonably priced. ", "hotel about 20 min walk to Bali Collections (shops and restaurants) or shuttle from hotel, or taxi (under $3aud). Spa was great! Package was ideal for us.", "Overall, wonderful holiday, would definitely stay again (in fact already looking for deals!).\n", "\nthis was the most relaxing holiday in a beautiful part of Bali will go back again. The rooms where great and the water for the shower was always hot. The hotel grounds were lovely with ocean views and a lovely breeze. The pools were clean with plenty of sun-beds. The staff were lovely and very helpful. Did not want to leave as we were totally relaxed and enjoyed our spa treatments with Prisma and Mariati these girls were great. We will be back in the near future cannot wait.\n", "\nWe had our wedding party stay here (50 Guests) and it was great. The hotel is big enough that you can see people when you want to. And hide away when you need some down time. Location is great and easy to get to Bali collections. And with the new road makes going into Seminyak really easy. Staff were really helpful and made our stay great. We requested breakfast to be bought up to the room on the day of the wedding and it was all chosen from the breakfast buffet and was no extra charge. Would highly recommend them if you are planning to stay in a big group. ", "Only down side - is that there is no WIFI in all the rooms yet... Only lobby and the rooms that are near the lobby can get it.\n", "\nSpur of moment decision to surprise our daughter and family who we're staying here.", "Lovely room with large bathroom with bath and comfortable tasteful furniture. The hotel grounds were lovely and the grand kids loved feeding the squirrels. The pools were nice also. Went to the Balinese dancing and dinner twice and enjoyed the lovely food and dancing. Staff sang happy birthday to me and gave me a cake. The only slight hitch was the average food at the bar near the beach. No complaints otherwise and would highly recommend a stay here. Thankyou for a lovely stay.\n", "\nHaving stayed 3 times previously, all of which where enjoyed greatly , our recent stay the whole experience was an improvement on the previous . It is obvious the Hotel and staff have been working hard behind the scenes to lift the bar even higher .", "After an initial stumble with our previously promised room not being available , the Hotel quickly arranged for a suitable replacement room that was above expectations . ", "From that point the service throughout was faultless , with the staff going out of their way to ensure that anything and everything that could be done was done in a cheery no fuss style ", "The casual Balinese theme of this Hotel makes for a relaxing and stress free stay .", "We are already planning our return .\n", "\nIf you want a holiday where all you do is relax by the pool or get massages at the spa , go for a lovely stroll along the beach or some light shopping this is the best place to go. The hotel is absolutely wonderful and welcoming, rooms excellent. Will be going back again for sure\n", "\nPleasant and easy check-in, our time spent at the Nusa Dua Beach Hotel was very enjoyable. Room #1151 on the ground floor close to front reception and lounge bar areas was very comfortable, clean and the aircon worked well. The beds are very comfortable with great pillows and linen. The sliding glass doors open onto a shady patio with outlook across the gardens to the breakfast room. ", "WiFi is free in public areas but chargeable in room. I think this should be included as with most hotels these days. (Our room being close to reception was able to pickup free WiFi...a bonus)", "The breakfast area is busy at times but lovely, next to ponds with koi fish. Breakfast options are wide and varied.", "The gardens are large, open and colourful. There are two nice pools and the beach in front with lounges and plenty of shade trees is a great place to wind down and relax with a book.", "Ps. Unfortunately family staying with us had problems with a/c not working at all!! +30°.Very unpleasant for them and not dealt with effectively to any satisfaction or compensation by management. This was disappointing and not acceptable for a hotel of 5 Star rating.\n", "\nI was lucky to stay at this great resort in March and it is probably my favourite in the Nusa Dua area. The gardens are stunning and the location is perfect, right on the beach which is safe for swimmming. Various room choices all of which have lovely wood features, carved doors and super comfortable beds.Hard to fault this place. great pools, very family friendly, fantastic staff. Especially impressed with security when I forgot to lock my safe when going out for a day trip. Arrived back to find my room double locked .had to get the front office to open the door. If Cleaner finds safe open they report it and the rooms is security locked until your return to protect your valuables . Breakfast was good with lots of choice.A very relaxing place. Highly recommended Sandy Brasier Harvey world Travel Mt Waverley\n", "\nThe hotel is amazing .. right from the staff to the rooms to the beach ... stayed there this June. Simply loved the place. Kid friendly. Has a true Balinese touch. The breakfast is awesome. Would definitely love to visit again for a longer time. Has the best beach strip in Bali. simply loved the place..\n", "\nwe have returned here for 30 years and love the gentle traditional balinese hospitality and facilities at this hotel............nothing is too much trouble and the facilities a delight", "April , Australia\n", "\nA great hotel to kick back and relax. Located in Nusa Dua far from the rustle and hustle of the city. I stayed at the palace room and all the staff was very friendly and will help you with everything you need. The room was nice with the wood carving, creating an Indonesian touch to the room. Although it still needs to be renovated but it's very comfortable. The lounge that serves breakfast offers a good range of food that are cooked to perfection. Don't miss the high tea hour where they serve tea/coffee/juices and a whole platter of sweets and savory for free!(plus you can ask for more!) And at night come down and drink some cocktails in cocktail hour, serving a range of alcohol/non-alcohol drinks and some small bites(everyday the small bites change). Overall this is a great hotel to stay in, for family it is a great place,. anything you need will always be helped by the warm and friendly staff.\n", "\nWe booked the hotel through Luxury Escapes and the price represented excellent value for money as it included three themed dinners, 6 spa treatments etc.", "The hotel is located in a great location on the beach at Nusa Dua which is great if you want to swim in the ocean or walk along the beach. The walk to Bali Collection shopping complex along the beach is about 8-10 minutes or you can use the shuttel bus provided.", "The hotel grounds are beautiful and the hotel buildings although ageing have been well maintained.", "The room we stayed in was reasonably sized with a small bathroom. Facilities were very clean.", "The noise from the service staff trolleys was a little annoying although this was mainly during the day but at times was noticeable during the evening or early hours of the morning.", "Unfortunately the balcony is exposed to the elements.", "The food at the hotel was very good and the seafood meal we had for dinner was excellent. Breakfasts were good with a variety of food and the best breads.", "Staff were very friendly and helpful.", "Would definately stay there again.\n", "\nWe receintly brough a deal online for the Nusa Dua Beach Hotel & Spa, the deal was fantastically priced the hotel could not do enough for us. The rooms wre extremely large and well serviced, all staff were very friendly and helpfull would certainly recommend for families as the hotel is very secure and extremely beautiful.\n", "\nWe went because we needed a break. I trusted the travel agent. The week before Easter was fairly quiet, then Easter Happened. The place was bursting full. Fortunately, we were not on the ground floor. We met a couple who were demented by the noise—not just from guests but the whole panoply of service people. Bang, bang, boom, boom, crash from 6 or 630 in the morning. It’s best if you’re an early riser. We heard it, but were not next to it.", "Do not expect the service desk to be anything like the service desk at a top rated hotel in Jakarta, or Manila, or Hong Kong. Expect to bargain on all prices and expect rudeness.", "Expect to pay astronomical prices for wine, beer, etc. This is OK, and it is standard in tourist traps.", "Meals are wonderful. Expensive but worth it. Never got sick. The guest population clientele at Easter was hugely Asian, a wonderful opportunity to practice our languages.\n", "\nThis hotel was booked for me by a conference organizer that invited me as a speaker. I was picked up by the hotel car at the airport. Hotel room is large and clean. The midle and back garden is beatiful, and the breakfast choices and taste was not bad.\n", "\nWe booked a deal through Luxury Escapes for 10 days and up graded to a palace room at a cost of US$80++ per night. The palace up grade was nice for a couple of days but to be honest for the extra cost you can live without it. We decided to have breakfast in the main restaurant as the coffee was hot and you got a full cup, you also had a much larger choice. After visiting the palace lounge on the first night for canapés and cocktails I received a cocktail that was nothing like the first one that I ordered it almost looked like sloppy left overs, on the second night in the palace lounge my Husband didn't eat his little shot glass of noodles we then watched the water take them back to the counter where the chef then threw them back into the silver serving bowl to then be sent out to another patron. so after day 2 we never had the cocktails or canapés either. The afternoon tea and cakes were very nice although the coffees always tepid and half a cup measures. We found that the service at chess restaurant was only ever half acceptable if the manager was in sight on two occasions we actually left the table after being ignored for an unacceptable length of time. One night we sat at the Chess Bar and watched a waiter bring back a glass of Rose and a glass of Red that had obviously been incorrectly ordered, The Rose was poured back in to the bottle and the Red sat under the counter for around 60 mins and was then taken out to another patron witnessing this just about made my blood boil as it is very costly to purchase food and drinks here and you would hope that they were FRESH!!", "We were also very disappointed that the bathroom was not cleaned very well and the taps and marble were never wiped over, there was also a shortage of Face clothes as only once did we not have to request them. We received 6 spa treatments as part of our deal and they were devine and the ladies were always smiling and the spa areas very clean. On our last Day I had pre booked our complimentary airport transfer and then the Palace lounge staff then re confirmed that this was all booked, however when we went to reception to leave no car had been booked but luckily for us the hotel car was there and a fantastic young chap that had only been with the hotel a couple of months drove us to the airport and out of all of the staff I would say he was one of the friendliest. I have stayed at the Westin over the past two years and the Lauguna and the Melia but I would say that the Nusa Dua didn't quite meet the same qualities as the others however the Deal was a reasonable one so that did help soften the blow. The resort was nice it could just do with cleaner bathrooms.", "e\n", "\nBeautiful Balinese style hotel surrounded by tropical gardens right on Nusa Dua beach. Stayed in Premier Rooms overlooking duck ponds and gardens. Room was clean and spacious with decorative timber detailing. Not keen on rain showerhead - large globules of water dripping everywhere. Flyscreens would enable doors to be left open at night. Staff were attentive and friendly. Breakfast selection was great - especially loved the egg station. Lots of people staying at hotel but never felt crowded. Two lagoon style pools in main area plus tranquil lap pool in spa area. 15 minutes along beachfront walkway to Bali Collections (shopping and restaurants) or 20 to 30 minute drive to Discovery Shopping Centre in Kuta. Local markets at entrance to Nusa Dua. Meals at hotel on the expensive side but three themed dinners were included in our package. Spa treatments enjoyable - special treat of muesli cookies and ginger tea at end. A great hotel - felt safe, secure and happy at all times during our stay.\n", "\nA fabulous relaxing holiday...better than expected.", "Loved the traditional Balinese style of the hotel and surroundings.", "The highlight of our stay was The Palace Club and their wonderful staff...so worth this option!", "Also, the spectacular gardens, pools, spa and recreation/activities helped to make our holiday one of the best yet!\n", "\nWe certainly made the right decision when we booked this holiday. The hotel is surrounded by stunning tropical gardens and the views of the Indian Ocean are incredible. We stayed at a deluxe ocean view room which was stylish, spacious and, like the rest of the hotel, full of traditional Balinese character. ", "As we were there for ten days, we were able to try out all the restaurants and we enjoyed each and every meal. We couldn't pick a favourite amongst them as they all offer excellent cuisine. Breakfast takes into account the tastes and needs of international guests. For some fun try the bistro. It has an open-plan kitchen and we chatted with the chefs as they were preparing mouth-watering regional dishes. They were happy to demonstrate their skills and offer advice regarding the preparation and cooking methods that they employ. The cocktails on the drinks menu are worth a mention too; packed with fresh tropical fruits, they are difficult to ignore!", "I visited the spa on five occasions, as much for the treatments as for the ambiance. The fragrance of oils combined with the natural birdsong and the expertise of the therapists wiled away all the stresses of everyday life.", "The resort was immaculately clean throughout and the always-smiling staff were warm, friendly, polite and very helpful.", "During our stay we also visited the Galleria mall which is a short walk away, or you may use the free hotel transport if you wish. The shops at the Galleria offer a wonderful array of well-made hand crafted souvenirs and gifts. There are also many restaurants aimed at every budget and, once again, the service is flawless.", "We would happily recommend this hotel - but only if you are looking for an indulgent experience in a heavenly setting!\n", "\nI stayed at Nusa Dua Resort from May 27th to June 1st with my family . The resort is an heavenly experience ... It's a beautiful resort for a perfect holiday. The restaurants are very nice and they customise your food if requested, as we were Jains and do not consume even egg which was well appreciated by the staff in the resort.", "The food is yum , the stay was comfortable, the rooms are cozy and overall a wonderful experience with family.\n", "\nThis resort is beautiful. our room is nice and our view amazing. The staff are very friendly and do everything you ask promptly and with a smile. ", " We payed an extra $600 aus to be part of the Palace Club which gave us free afternoon tea and free cocktails in the evening, All handmade and very yummy. We used this for our lunch and dinner as the food and drinks here in the hotel are rather expensive. One large bintang and a vodka & orange being $20 aus (before the ++ tax)", " There is a beautiful lake in the middle of the grounds with ducks, lizards, turtles and a white heron. Very picturesque, but a warning to parents of small children, it is still a body of unfenced water! ", " The only complaint we had about this resort is that it is very singular. There is basically nowhere else to go and eat apart from the free shuttle into the Bali Collection shopping centre which had an awful lot of over priced eateries and very expensive shops, like Prada Billabong Polo, all the yuppy stores.", " There is a supermarket in the complex but it had a limited range.", " If you don't mind paying alot of money for food and drink then this is the resort for you it is truly lovely", "Would i stay here again? hmm thats a hard one. While we really loved the hotel and the grounds. We also like being able to walk outside the hotel and look in markets and watch the footy in a bar. ", " There is nothing around except more expensive hotels.Which is a shame because the hotel is great.\n", "\nMy husband and I recently returned from our fourth enjoyable visit to NDBH. In 2009 (my first visit) I wrote the following on TripAdvisor, which still holds true today…", "‘This hotel is a beautiful oasis located on the Nusa Dua beachfront. It has what the other nearby hotels don't, a traditional Bali feel, evident through the hotel's lovely stone architecture, beautiful rooms with carved doors and furnishings, fragrant, colourful gardens and very friendly staff. I have to add that we found all staff genuinely welcoming, professional, attentive and very helpful. We will definately be going back, due mostly to the wonderful treatment of all their guests.'", "On our most recent visit in April, my sister also came with her family. The adults enjoyed the spa treatments and the kids (older teenagers) particularly enjoyed the water sports. Must commend the spa staff for their friendly professionalism, as well as the quality of services on offer, which we found reasonably priced. We always enjoy the traditional Balinese massages, and love the exotic fragrances of the oils and scrubs.", "One notable aspect of the resort we particularly liked, was that the hotel never felt crowded. You could always find a sun lounge, and you can’t beat sitting by the beach, with the ocean breeze lulling you into total relaxation. We loved how quiet, calm and peaceful the beachfront was. Pure bliss. We found the pools, grounds and beach to be very clean, and the sea water pleasant and crystal clear at this time of the year. ", "The hotel restaurants offered a variety of quality meals including Western, Asian and Balinese specialities, located beachside or poolside. We loved the dining ambience of the resort and felt meals were cheaper than Sydney prices! Of course, there are also local restaurants nearby so you can get the best of both worlds. The breakfast buffet was extensive and appetising, catering for guests from various cultural backgrounds; only criticism would be the lack of tea and coffee staff circulating at breakfast. We also enjoyed sitting in the lobby lounges for a change of scene some evenings. We liked the variety of pleasant music on offer, and were thankful it was not a nightclub scene. ", "Our Premier rooms overlooked the hotel's beautiful gardens. As always, we found them to be very clean and quiet, with very comfortable beds and decorative Balinese features. Air conditioning worked well. ", "As noted by myself and other TA reviewers, hospitality and service is a key ingredient of this hotel. Management were also friendly and approachable, and willingly engaged guests in conversation through various social functions.", "Finally, as mentioned, this hotel has a traditional Bali feel. If you're expecting an ultra modern, western style hotel then you'll be disappointed and will need to choose a chain hotel. If you're seeking a relaxing Balinese ambience, with 5 star facilities, then you'll be very pleased.\n", "\nAfter spending some time at Ubud, and then a few nights with friends at Sanur, we decided to spend our last 2 nights at Nusa Dua. As it was my 50th birthday we thought it would be nice to finish with a little bit of luxury and this certainly fit the bill", "First impressions count, and from the spectacular lobby on arrival and the fantastic service we received from the check in staff who didn't bat an eyelid about us being a couple of hours early and checked us in immediately, everything went smoothly.", "Our room was spacious and clean. The air conditioning worked well and the bed was extremely comfortable. Being on the third floor we had one floor above us, and my only complaint would be that we could hear the people in the room above scraping their chairs on the floor every time they moved them, and boy did they like to move them a lot - it was like a furniture removal convention up there. Luckily we really didn't spend a lot of time in our room, and when it came to sleeping being a seasoned traveller I always carry earplugs so was able to block any noise from above.", "The resort itself is huge and has lots of places to hang out and enjoy a drink or relax. With 5 restaurants there are plenty of food choices, and th4e buffet breakfast was as good as any.", "The beach is lovely, much nicer than Seminyak where we stayed last year, and there are only few local touts who are happy to move along when you say no thanks.", "There's a lovely paved walk along the beachfront which heads off in both directions and is very quiet for an early morning run - I went out at about 7.30 and saw only a few people.", "If you head out to the path and turn right towards the park with the big statue it's a 10 minute walk to the Nusa Dua Shopping and entertainment complex, here you'll find lots of shops, including a chemist, department store and a large number of restaurants if you'd like somewhere a bit cheaper then the hotel to eat. If you do a lot of shopping the going rate for a cab back to the hotel is 30000 rupiah (approx AU$3)", "We deiced to eat in both nights and the food and service was excellent - although not cheap, prices were comparable with what you'd pay back in Australia.", "We also took advantage of a massage and facial at the day spa which was also amazing,but again probably around the same price as Australia.", " If you're looking for an authentic Balinese experience you're probably not going to find it here, but if you want a bit of resort luxury then this is for you.", "Overall this is a lovely place to stay and I would recommend it to anyone looking for a bit of luxury or somewhere special, bear in mind though it's not cheap, but then nothing in Nusa Dua on the beachfront is.\n", "\nA very good stay here, we actually went August 2012 but won't let me backdate it. This was our honeymoon stay, we had stayed three nights in Tabanan and travelled down to Nusa Dua for the remainder of our stay of 10 nights. A lovely, specious and grand hotel. Staff were really friendly and very attentive. The pool bar was great and busy but not where you can't get a bed. The beach was a two minute walk and was white sands and clear waters... Just breathtaking. The breakfast was very good with plenty of variety and fresh eggs, pancakes and waffles.", "The hotel was well located and neighbouring towns were not far in the taxi.. We visited Nusa Dua centre, Kuta and Jimbaran Bay (which you must visit for the sunset in the evening it is amazing)", "Really great hotel and enjoyable stay.\n", "\nWe decided to go to this hotel as we brought a package through luxury escapes and decided to buy the upgrade to the club suite. Best decision I ever made. Ok so the hotel is a lot older than those surrounding it but it had heart unlike the new sparkling sole less hotels. The room was great, everything worked and was really clean, yet lots of reviews comment on the cleanliness we found this was not an issue.", "The staff could not have been more helpful and the breakfast in the club lounge was great. With our package we had lots of options for free meals, we did find that if you were more adventurous with your choice is was a bit bland but with so many tastes to cater for I suppose they err on the side of caution. We took full advantage of the free spa treatments and they were brilliant.", "Ok so you could get cheaper drinks outside the hotel and people do comment on that well coming from perth where a cocktail can cost up to $25 we found everything reasonable ! ", "You can take a beautiful walk along the beach to the shops which again coming from Perth we found to be very reasonable, not crowded,not hassled, no traffic unlike our trip into Kuta ! ", "The only thing I would say is don't got to the beauty saloon as their attitude sucked needless to say we did not give her any of our business.", "If you are going to stay here which I highly recommend, look for the packages and upgrade to a suite.\n", "\nFirst off, the hotel itself is really stunning. The staff are friendly and usually as helpful as they can be, with all members from concierge to maintenance wishing you well as you pass by. The only downside, is that the staff follow the letter to the law and aren't always flexible but I put that down to cultural differences more than anything.", "The hotel Spa is a paradise in it self, the pool is visually striking and with massages, steam, sauna and Jacuzzi facilities complimenting the many activities Bali has to offer.", "The Hotel is right on the beach with a plethora of bars and restaurants to pick from and a short walk into Nusa Dua town, with small markets other places to keep busy.", "Within the hotel there are boutique shop, a gym, a fun pool, night entertainments, lots of bars. Its really easy to pass time without ever leaving the resort and that's not a bad thing.", "I would go again, but I helps that I've become a massive fan of Bali. Oh! The breakfasts are AMAZING\n", "\nThis was our 1st stay at Nusa Dua Beach Hotel. Whilst there are many great things about this hotel there are also aspects that aren't so good. We arrived mid to late in the evening and on first impressions thought \"WOW\". We were shown to our room which was quite nicely appointed but the cleanliness was no where close to what a 5 star hotel should be. We asked for a room with a king size bed. Our room had 2 king singles. We rang the front desk and after 20 mins of waiting the housekeeping service remade the bed to a kingsize. As it was fairly late we then just climbed into bed to enjoy our 1st night of sound sleep. The room stank. It was soooo musty. i wanted to open the doors to let some air in but the air conditioning automatically turns off so that wasn't an option. Being late in the evening the last thing I wanted to do was to get dressed and go to the front desk. We had just come from a 3 star hotel in Candidasa that was by far superior in cleanliness. Even the vacant rooms there were aired daily and fresh touches of frangipanis etc were placed around the rooms.", "Ok. So that was night 1. When we looked more closely around the room the following morning we noticed that the furniture was so marked and dirty that I would hesitate to sit on it. Also the verandah was disgusting. There was no way that you would sit outside on your balcony and enjoy the views of the lovely gardens. Such a shame and once again, no where near the 5 star quality that we indeed paid for. We then went to the front desk to ask if these things could be addressed. The desk staff asked if we could go and have breakfast and come back afterwards. We did this and about 8.45am returned to the front desk. After explaining our situation yet again we were then apparently given a room upgrade and by around 10am the room transfer had taken place. Such a shame that our luxury escape holiday started so badly and really had lost a nights sleep and then half a day in all the toing and froing.", "We move on. This hotel has beautiful facilities.We loved the location, buildings, gardens, beach and pool. Indeed all the staff were friendly and pleasant. ", "The room we were then given (1114), which apparently was a palace club room, was once again not up to a 5 star standard. Although this room was not musty, there were a lot of little things that needed fixing. The taps around the basin were not cleaned properly, mould in-between the tiles in the shower and bathroom, the taps of the both would fall off in your hand rendering the bath useless. I decided to wipe down the outside furniture on the balcony with one of the white bath towels. Ummmm... it was then black. so the balcony furniture and surrounds needed at the very least a good clean with a high pressure hose. Things like our shower gel, shampoo, conditioner etc were not replaced daily even though they were empty or nearly so. It really is such a shame that the excellent facilities are not showcased to their maximum potential. After staying in what cost us $70 per night with clean immaculate facilities to paying $175 per night here at Nusa Dua and areas of the room that couldn't be used is not satisfactory. ", "Would I stay here again?? Um, probably yes but only if I was guaranteed a room that was cleaned and maintained to the standard it should be.\n", "\nThis hotel has so much to offer nothing is a problem , staff are so wonderful facility are outstanding level of service is second to none we can't wait to return for our 20th stay love nusa dua beach hotel and spa\n", "\nWhen we drove up to the hotel, it was very impressive! We were given an upgrade to a club room and it was fabulous! Great view of the garden, the best bathroom I have seen in a long time, with a separate toilet with a tub that opened to the bedroom! Only criticism, no where to hang your towels! The lap pool is brilliant as are the free activities offered by the gym; we did the bike ride around Nusa Dua. And the breakfast buffet has everything you could wish for! Very highly recommended!\n", "\nThe location and ambience is excellent. Rooms are very comfortable. Facilities exceed expectations. The staff employed at the hotel go out of their way to meet your every need. The gym and Spa are great and the massage team is very professional. Day trips are organised on the guests behalf. The pools and grounds are immaculate. Excellent resort.\n", "\nhuge resort located in Nusa Dua is one of the finest resort in Bali, which offers ample of opportunities to leisure. several pools with great amenities, lots of greenery everywhere with blooming flowers is a great experience.", "The area of the resort is very huge, which takes days to see each corners.\n", "\nBali was the first place I had travelled abroad to and I was worried about it being dirty and a shock to the system in comparison to Australia - which it was - except for Nusa Dua, one of the prettiest places on the planet. Nusa Dua Resort & Spa is truly beautiful and unforgettable. The resort grounds as you drive in are huge and the foyer is quite fancy, not to mention the stunning view that awaits you. Employees there are lovely and after a few days I remembered the names of a few who I would pass, stop and chat to (Ery, Merta Yasa & Mushadi I am giving you my praise!). I absolutely loved its close proximity to the water, the beach was truly beautiful to wander past via the walkway between all of the hotels, and I enjoyed the short walk to the waves at the end of the resorts where I could have a dip too. We were situated on the top level of the apartments in a standard room which was just gorgeous. It did not contain views but it was still gorgeous thanks to its intricate wood work and open plan bedroom/bathroom which I wanted to go home and recreate. While I did not have dinner at the resort because it was pricey, I did take full advantage of the pool and it's swim up bar where I ordered too many Piña Coladas to recall. They were absolutely amazing as we're the complimentary chips Mushadi would also offer. I would recommend stepping outside of the resort and taking a short walk in to town for dinner because the food at Mai Mai is the best and I are here about 3 times. Being conscious of security I do remember walking out of the hotel at night and seeing a huge crowd of staff in the dark waiting for a ride home and this did feel a little eery. I would absolutely recommend Nusa Dua Resort & Spa but would like to note that it is pricey considering you are in Bali... And if you want to see the real Bali, I would suggest you visit Kuta, Denpasar or the rice fields.\n", "\nLived up to expectations ,only one small complaint toilet exhaust fan not working, poolside service good ,we found the food very good. ", "Very good facilities for wheelchair bound people as plenty of ramps the only problem we could sewas access to the pool as the steps are rather deep.\n", "\nIn keeping with the \"no building higher than the tallest palm tree\", the Nusa Dua Beach Hotel is a series of cottage type rooms joined together and spread throughout the property. The landscaping is fabulous with paths leading to the main hotel and to the beautiful beach. This hotel was just the relaxing oasis I needed after my energy filled adventure through south east Asia. The hotels advertising...\"Where Kings and Presidents stay\" truly indicates the high quality of this resort.\n", "\nWe stayed at the hotel as a large group and the overall comments from our group is that they had a great experience, with just some minor issues here and there. ", "Resort:", "- The resort is very big which requires a lot of walking between rooms and the various facilities. So it may not be the best for those who cannot walk. However, our group loved the large resort as there are many pools, deck chairs and activities to indulge in - even table tennis. ", "- With the new highway, the hotel is only 20 mins from the airport, very convenient indeed. It is still 30-45mins to Kuta/Seminyak so for those who want to be in the centre of town, this may not be suitable. But if you are looking for relaxation then the hotel is great.", "Rooms:", "Our group stayed in a number of different room types. The Deluxe rooms have been refurbished, so whilst it is smaller than the Premier rooms, it is newer. ", "Service:", "The overall service level is good. However, some of our friends had issues with the front desk during check-in and check-out, where the room cost was already paid but was it was not reflected in the system. Communication sometimes can be challenging. ", "Service during breakfast was also a bit slow, where there were a lot of tables not cleared and thus we found it challenging to find seats.\n", "\nWe have stayed at this hotel twice before and this time took advantage of a luxury escapes package to upgrade to the palace club, and loved every moment of it. Our room was very spacious clean and very well equipped even down to our own coffee maker. The palace club was a fantastic oasis, you must try the scones with jam and cream served as part of afternoon tea. Many thanks to Sadnyana and all the team who greeted us each day with smiles and a genuine willingness to do whatever they could to make each day perfect. We will be returning as soon as possible.\n", "\nI have just returned from a 8 night stay, at this fabulous Nus Dua beach hotel. This was my 5th stay here and it just gets better every time I stay here. Firstly security in and out of the property ha been increased, which makes you feel secure straight away. Every staff member is helpful happy and informative. The swimming pools cater for everyone, and are large with lovely little nooks and crannies. The food and beverages have increased in price a little too much for my liking so you wander just outside and head towards Benowa where you will find loads of restauants selling Indonesian food at much cheaper fare and its yummy, I have been to Bali 15 times and always eat from little restaurants and I have never been sick. Kuta and Legion are the same, a rat race. Poppies Lane 1 & 2 are great but be prepared to negotiate. I have a great tailor who made me a gorgeous long leather skirt and biker jacket. Stay at the hotel and enjoy all the facilities and discover the spa which features wonderful treatments, it has a lap pool, female and male heated jacuzzis, gym which is a little oasis tucked away from the main hotel area or just enjoy the main pool and pool bar for happy hour each day.\n", "\nVisited to once again celebrate my birthday. Previous visit was 30 years ago! Hotel has been beautifully maintained in intervening years, when staff realised it was my birthday they provided a cake and fruit to our room. Hope I can return for another significant birthday in 10 years time!\n", "\nThere are 2 things I would say:-", "1. The hotel has 23 acres of space around it but still lacks atmosphere. The cost of meals, drinks etc was very high. Can't help the 21% vat, but would love to know about the +20% service fee on all the bills. Everything here was PRICE + +. The room and hotel was quite serviceable to our needs - the A/C was exceptional after coming inside from other places in hotel. ", "2. The staff were, generally, not quite up to standard. Many tried hard (the worker bees) but most were lost in translation. Some areas had a couldn't care less attitude - reception, information counter, tourist desk and some of the male service people who seemed to be the \"controllers\" but did a very ordinary job.\n", "\nAm currently staying in Nusa Dua Spa in Bali which looked fantastic in the photos on-line. On arrival it was clear to see that the place was stuck in the eighties when it was built. The place is dusty, dirty and needs a total re-vamp. On arriving in our room we were disgusted to find a filthy floor, used sanitary items on the bathroom floor and a room covered in dust and finger marks. After moaning (which isn't what you want to do after an 18 hr flight) we were moved to a slightly less dirty room. Everything including bedding and towels smells damp. The pool furniture is covered in mould as is most of the hotel (nothing that a good clean wouldn't sort). The food is average as is the service. No way is this a five star hotel and if I wasn't here on business I would be checking out. looking forwarded to returning to Bali but never again to this place.\n", "\nWe took advantage of a Luxury Escapes package at this resort and it was just the relax and recharge we needed. The hotel is beautiful, lush gardens, friendly, attentive staff and breakfast to die for! The spa pool is the perfect place to cool off and unwind - but it's great to socialise at the swim-up bar in the main pool area too.", "Yes, the shower in the bathroom has a useless rain head and we do recommend exploring eating establishments outside for the true Balinese cuisine but we would certainly stay here again.\n", "\nIt was our 1st stay at this hotel, we loved it!! The traditional Balinese style and ambiance of this hotel is very appealing and iconic, as its over 30 years old. Lovely Balinese style rooms , with lots timber carving ,comfortable bed and well maintained bathroom. The balcony overlooked superb gardens. We enjoyed many happy hours in the bars by the beautiful pools.", "Four Restaurants give you plenty of dinning choices and the buffet breakfasts are the best !", "A beautiful quiet private beach location, safe for swimming , there are plenty of beach lounges, under shady trees. If you like to experience, traditional Balinese Dances, they have 3 great theme nights a week, serving the most sumptuous buffet dinners. We had massages and spa's in the most gorgeous setting with lovely staff pampering us!! The staff were very polite and friendly, we will definitely come back here.\n", "\nAfter 14 years we returned to stay at the Nusa Nua Beach Palace Club and absolutely loved every moment of it, again. The ambiance of the resort architecture is just so very Bali, not global corporate style of the now many neighbouring properties that you may find in any location. The quality of the rooms and daily presentation of rooms is world class.", "This being the first resort in the Nusa Dua area it has the best stretch of beach and extensive grounds where you can find tranquility in many uncrowded areas. Palace Club is truly a resort within a resort. The inclusions are superb quality and great value. The Palace Club staff (I could mention many staff by name) are truly amazing. It was genuinely touching to be remembered afer 14 years by several of the Palace Club staff. ", "To be personally met at lobby in the morning by every staff member who arranged us a day tour to ensure a pick up in a quality vehicle with quality drivers was total profressionalism on a personal level. Only change we saw 14 years of staying at the Palace Club was a cocktail hour extravagent buffet to a cocktail hour of portion control. As a business man can understand the change. Was a somewhat disappointing our evening dining bills increased accordinly.", "We loved the many nights sitting near the waves with our toes in the sand having meals with close freinds at Chess bristro. As for alternative dining options (we stayed 10 nights) Bali Collection shopping resort is accessible by courtesy bus a few minutes away with a huge rannge of international dining options.", "As for take home in room drinks, get to Coco Supermarket at Bali Collection for wines at third of the price of room service. Very much standard practice in hotels and should not detract from hotel rating. Room service quality was excelent at any time we ordered it.", "See you next year Palace Club, sorry to haven taken so long to have come back to our second home. PS: only saw one Bintang singlet within the resort, so refreshing for Bali.\n", "\nHad a wonderful room with a big balcony on the 4th floor overlooking a beautiful garden. Comfortable and very quiet. The hotel has beautiful gardens, two swimming pools and a nice beach with enough shadowy places everywhere. What made my stay so special was the staff and management. Everybody so helpful and attentive and making me feel welcome and well taken care of. The food at all the restaurants was delicious at all times. So nice to be able to sit in the open and enjoy the lovely surroundings while dining. Various evening entertainments are offered, such as typical Bali dances or barbecues by the beach. Allover a real treat. Would go back any time.\n", "\nHotel is big, beautiful, and excellent. it has it own beach, you can see many Small Squirrels in garden, staff is good, a sumptuous breakfast. only in lobby has free wifi, if you need to use wifi in your room, you need to pay. have free bus to Bali Collection shopping mall.\n", "\nA marvelous experience at the Nusa Dua Resort, this was my third stay at the Palace Club. Very friendly and efficient staff, who would not enjoy the wonderful facilities and food in such a relaxing environment. Great pools and beach area, such a contrast to Kuta. Looking forward to my next visit. A special thanks to Supadmi, she is a very friendly and efficient lady.\n", "\nI travelled with my husband. We had a very attractive deal to stay in a Palace Club Suite. What can I say? The suite, comprising a bedroom with walk in robe, full bathroom en suite and a balcony, a lounge/dining, second w/c with vanity, a (non cooking facility) kitchen and balcony on the top (4th) floor, overlooking gardens. We stayed for a wonderful 12 nights and loved every minute of our holiday. This is our third visit to Bali and we have stayed at a number of resorts and destinations. This was by far the best. Our room was clean and welcoming - maintained to the highest of standards. Membership of the Palace Club is well worth the extra fees, providing visitors with an a la carte breakfast, combined with a buffet, afternoon tea for 1.5 hours in the afternoon, followed shortly afterwards, by cocktails and hors d'oeuvres. The staff at the Palace Club and throughout the resort are simply wonderful. They are polite and absolutely loveable. I commend to the Hotel Management, Kadek Rasni - such a beautiful, kind soul for whom nothing was too much trouble, Walyi (a lovely lady, whose name I can't spell), again, she went out of her way - very gracious, Anik - she possessed excellent PR skills and with a wonderful sense of humor and Fedelia - great problem solving skills, although, absolutely ALL of the female staff were excellent. There were three males who were very good - their names escaped me over and over - a large/tall man who smiled all of the time and was always happy to please. A man in his 40s - not overweight, with glasses, always informative with his service and pleasant with it, and a younger man around 30 who was also informative and very professional. Activities abound in the evenings for those who enjoy entertainment: The dinners that accompany Kecak dance show, the Legong Dance Show and the Fire Dance Show are plentiful and comprehensive. The Spa services are wonderful. Ayou will provide you with pain free therapeutic massages that leave you feeling like a million dollars - don't miss a day. Chess serves a fantastic fillet steak - labelled as tenderloin - yum! perfect presentation. The pools are vast, warm and inviting. There are several pools that cater for varying tastes, ranging from toddlers to those who like volley ball and then just to swim and enjoy a cocktail at the swim up bar. We spent the most of our time at the spa lap pool, where it is serene and restful. No diving, no noise, no children under 12 and no alcohol is served there. Wonderful! I would return to this hotel in a heartbeat - provided I could do the same all over again. Both my husband and I returned with the sense that we had enjoyed a real holiday - the first in many years.\n", "\nIf you want to relax and be treated like kings and queens then you must try this hotel. What makes it special are the staff and management that bend over backwards to help you. With 4 great restaurants and a good room service menu you cant go wrong. Imagine sitting by one of 4 pools or the beach or even on your balcony feeding the very tame squirrels. The breakfast was superb with lots and lots to choose from, and if it is not there you only have to ask and they try to please you. We stayed for 14 nights and never once was disappointed.I would recommend this hotel to everyone who wants value for money and the chance to be pampered.\n", "\nluxurious hotel. beautiful and big pool. Comfortable room.", "Very good legong dinner. You can not miss it.", "Nice staff. we told the receptionist that we want a room with good view. She really make it. Feel so good.", "Delicious breakfast. Surely will come back again.\n", "\nIt's my second visits in this property and a traditional Balinese resort. Never feels bored and always full of excitement. Begins with a memorable sunrise not to be missed every morning just right at the beach or outside the SeaView rooms. Varieties of foods are served in the restaurant range from local, Japanese, Chinese, Westerns...with great services.", "Choices of biking route experiences to nearest attractions e.g. morning market, water blow, tanjung bernoa or shops.", "Or choices of activities from the sport club..morning yoga, garden tour, volleyball by the pool with friendly staff.", "Housekeeping staff are friendly, clean room with personal service. I've spent my 2 weeks awesome experience, just Eat.Play.Drink.Fun. ", "Love to be back here again.\n", "\nWe have just returned from an eight day holiday at the Nusa Dua Beach Hotel, 1st - 9th May. This was the first hotel built at Nusa Dua and is truly the most authentic hotel in the area. We purchased a package through Luxury Escapes and stayed in the Palace Club suites and were lucky enough too enjoy the excellent club facilities, including a la carte breakfast, afternoon tea and afternoon cocktails. It was worth every cent. The staff made our holiday special, nothing was too much trouble and the friendliness and professionalism was outstanding. Special thanks to all the staff, particularly Gin, Nona, Sugi, Rasni, Anik, Wardana, who made our stay a memorable one.The included Airport transfer was efficient and comfortable. All the facilities in the hotel were first class, wonderful pools, one with 24 hour access. Wonderful spa facilities. Beautiful shaded grounds, plenty of sun lounges and great restaurants and bars. The private beach front area is possibly the best on this side of the island. The GM's cocktail party was a special highlight, we met the GM who is to be congratulated on his management of this hotel. It was interesting to learn he also managed another hotel we have stayed in at Tuban and it is clear he bought his skills to this hotel as nothing could be faulted. This was our first stay in Nusa Dua and we found the location perfect for us. Many thanks for a wonderful holiday and we hope to return soon.", "Geoff & Jo\n", "\nTo be honest, my expectation for this hotel was not that high, because I have read that this hotel is the oldest hotel in the area, but because they offer great rate, I decided to try", "And I was not disappointed. For a hotel that has been around for more than 30 years, the condition was very good. The big stone gate in the front really shows this hotel's balinese touch. I stayed in the room premier class. The wooden decoration inside the room was beautiful, I am sure it cost a lot of money to have such marvelous decor.", "I have to give my greatest appreciation for the staff. They are very attentive, polite and always smiling. It made me feel really welcomed.", "I truly recommend this hidden beauty to everyone who plan to stay in Nusa Dua, and cannot wait to be back again on the next trip.\n", "\nWe had the best holiday ever. This hotel is perfect and service is great! Can not imagine that there is a better holiday in this area..", "Even when we had a medical problem, the support from the internal doctor and hotel management team was great.", "Beach and swimming pools are close together which is great if you travel with children.", "In the garden around the hotel you can spend a lot of time and amaze about the diverse plants, trees, flowers and animals.\n", "\nWe were 2 couples staying at the hotel in May 2014 for ten nights. It was a coupon deal which included 3 banquets, spas, transport to and from airport and a few other little goodies.", "We loved the place. Before we bought the coupons I had researched the hotel and found out it was one of the first in the area. The décor was a little older than some of the other resorts in the area but at least it had a Balinese feel about it. ", "One drawback was that we had asked for adjoining rooms when we booked which was several months previously. Unfortunately our rooms could not have been further apart. We had a room overlooking the pool area and our friends had a garden view room at the front. A bit of walking backwards and forwards entailed. ", "The rooms are a good size with a lovely bathroom. Yes it is a bit older than probably lots of others but hey it was comfortable and had everything we needed. One drawback was the fridge. Took ages to get anything cold. We stocked up on local beers and water at a nearby market as I dislike paying through the nose for simple things at resorts.", "We loved the pool area and the ability to chill out under a lovely old tree under the beach. The pools are right next to the beach as well. Lots of little restaurants within the complex and by the beach to order some drinks and food.", "Had the three themed meals on the Monday, Wednesday and Friday nights. Lovely food each time so was puzzled why so many people complained on trip advisor about it. Drinks are expensive as per usual but hey pre dinner drinks back in the rooms followed by after dinner drinks on the beach using our own drinks makes it a pleasant affair. ", "We all took advantage of our free massages. Always felt wonderful afterwards. The spa area is great. Lovely lap pool with lounges and seating around, Jacuzzis and cold baths plus showers and lockers available. We had a late flight out of Bali so used the spa facilities until it was time for our car to the airport.", "There is a lovely restaurant called Kendi Kuning 10 to 15 mins walk up the path to Benoa. Great meals and lots cheaper than the resort. Ate there twice was not disappointed. ", "Went to Bali Collection which is about a ten minute walk south. Pretty sterile area. Didn't bother shopping or eating there.", "The gate to the Nusa Dua area is only a ten minute walk away. Just outside are about 3-4 restaurants and lots of little stalls plus supermarkets and currency exchange. Good rates at the exchange next to the mini mart just over the lights.", "Jl Pantai Mengiat is a bit further on from Bali Collection and has a few more restaurants and shopping for you to try out. It is only 20,000-30,000 rupiah to get there. We just about always used Blue bird taxis when travelling. It costs about 80,000 to get to Kuta Square area and about 100,000 if you are coming back from Legian area. Only takes half an hour. Especially if you use the tollway. But you have to pay an extra 10,000 rupiah for the toll. The only other time we took a taxi other than the Bluebird the guy demanded an extra 10,000 rupiah for his return journey to pay the toll but they go back via the normal roads any way.", "All in all a lovely relaxing holiday. I would definitely go back to the Nusa Dua Beach Hotel and Spa again. Staff were friendly and the place was clean. Bit of mould in the bathroom but we are in a very humid climate so it is everywhere anyway. ", "Buffet breakfast had everything you needed. Had to cut down towards the end. Beautiful setting down in the gardens.\n", "\nNo way is this a five star hotel. It's in dire need of renovation, after which it may be a candidate.", "Varnish on wood in room is chipped and worn. Needs re-doing", "How can a 5 star hotel not have free wi-fi in the rooms?", "Transport is a problem. There is a \"Taxi\" counter which is really a hotel car counter at two to four times the price of a taxi. Hotel staff are patently unhelpful when you ask about getting a regular taxi. What we did was get friendly with a local taxi driver and get his phone number.", "On the plus side, staff were friendly - as they seem always to be in Bali. The restaurants were ok, if not exciting and the business centre is very good in offering free internet and printing. Breakfast is awesome, with western, eastern and local fare laid out in a sumptuous buffet.", "Everything is as advertised, except that it all looks very tired and need refreshing. Bathroom is nicely laid out and appointed, but water pressure was so low that whowering was painful. Currently, it is sufficient, not 5 star\n", "\nTotally loved the place!! Amazing location. Just a perfect place to relax..Great Facilities..Very warm staff..Wi-Fi works every where except in d room (almost till d beach!!) which is very good as compared to other hotels. Had a great time at this property. Would definitely love to return to it. Just hope they add a little more to their menu in terms of indian food or vegetarian options. Overall just an AMAZING EXPERIENCE :)\n", "\nvery beautiful hotel and has very polite stuff .i really like garden and breakfast resturant and has a good outdoor pool and lobby was really nice and warmly.", "this hotel is very good for family.", "rooms has a good balcoon but rooms hasnt wifi an wifi just there is in lobby and sppeds really low.\n", "\nIt's a very well maintained property with lots to explore.. it's a heaven for the swimmers with multiple pool options facing the beach.. rooms are pretty spacious with wonderful views of the waters.. there are multiple options to dine-in inside the property.. it is situated in a peaceful area with lush green surroundings.. away from the hustle and bustle of the city!", "You can rent a bike to add adventure to your vacation! The best place to rent a bike is Kutta beach area..\n", "\nI stayed in the hotel for 5 days with my wife and 2 year old daughter. The hotel is large and clean but with a old withered look. Rooms are comfortable but look old. Somebody might have an opinion that it gives a feel of old balinese style. In my opinion there needs to be a mix. Not everything can be left out to this excuse. Service is ok. Staff definitely greet you whenever they see you. However, i felt the overall warmth is missing. It looks more like a compulsion as if they have been told to do so. I did not face any issues during the stay. However, I think a 5 star Hotel need to create a \"WOW\". It shouldn't just meet the expectations but exceed it. While I didn't face any issue, I don't have any extraordinary instance or gesture to talk about as well. Beach is ok, again nothing extraordinary - though that's not hotel's fault. Morning by the beach is beautiful. Breakfast spread is good but again not extraordinary. Overall, a good hotel but nothing extraordinary. May be next time i will try Westin which looked better from outside.\n", "\nWe stayed at this hotel for 7 nights (from 23 March 2014). The reception area is large and open air and so our first impressions of the hotel were good. We stayed in a 'deluxe' room (something of a misnomer) which is the cheapest option and were left a bit disappointed. The room itself was a good size with ample storage, safe, aircon, fridge and flat screen tv but the en-suite bathroom and the terrace furniture left something to be desired. In the bathroom the standard of finish was pretty poor and there were minor problems with the sink (it leaked a bit and it was difficult to get the plug to remain down). The complimentary toiletries were not good quality. The seating furniture on the terrace was marked and stained and needs replacing.", "The hotel has nice grounds which are kept clean and there are a couple of swimming pools. The hotel has a private beach which is also kept clean. The walk to the shoreline is short but fairly steep and the presence of a reef close to shore means that you can paddle in the ocean but a proper swim is not really an option.", "The food was good if a bit pricey and the staff were very pleasant and efficient. If you fancy trying somewhere else to eat, you can take the free bus (called the Bali Collection) from the hotel to the local shopping centre where there are loads of restaurants to choose from.", "In terms of things to do, we really enjoyed the Night at Bali Zoo, which included hand feeding elephants, a tour of nocturnal animals, dinner and a show. Good value and very entertaining. We also did a sunset dinner at Jimbaran Bay (Sea side Cafe) which was excellent and the cost of the taxi to/from the hotel was included in the price of the meal (this was organised through Baliku tours, not the hotel. Note. The cost of a taxi arranged by the hotel is significantly more than if you organise one yourself. You can take the free bus to the shopping centre and then negotiate a deal with one of taxis that are lined up there.)", "We did enjoy our stay at the hotel but were a little disappointed in the standard of the accommodation (i.e. bathroom and terrace) and the inability to swim in the ocean.\n", "\nThis is one of the original and only remaining traditional Balinese style designed resort. It is located brilliantly on nusa dua beach, with a great private stretch of beach just in front of it that it shares with the westin resort. The hotel has tremendous charm and you can soak in the Balinese architecture and culture. The breakfast is just awesome, the beach front nice and many recliners to sit and sunbathe on. even the restaurants quite nice. the pool is amazing and one of the best in bali. On the downside, the housekeeping and room service takes inordinate time and often we found we had to wait more than 30-45 minutes for simple things like a matchbox or an iron board to be delivered to our room. Also the aircon in the room is just too warm and uncomfortably hot.\n", "\nWe are actually on our 4th day here and every day brings more of the truly devine Bali care and attention to detail. In the time it's taken me to write this I've had 3 breakfast staff (palace club) come to attend to me! Now that's service! The resort is huge, with vast green areas. Not like the hot treeless stone covered other high end resorts nearby... We usually stay in Legian 5* but coming into the NDBH we have been in heaven. The spa here is exactly as the brochure describes, now we all know that never happens, you walk or should I say float back to your room. We are in a palace club room, on the ground floor, it's spacious and opens directly on to the temple garden area with pond and is so peaceful, actually we've found pretty much the entire resort peaceful. Last night we enjoyed the managers cocktail party, it was great to meet the team that are the grass roots of the company that are extremely interested in what the guests need and love about it here. We love that the resort is 30yrs old and has the authentic Bali feel, if we wanted the Gold Coast luxury resort we would have just gone to one, but when you come to Bali don't you want to feel like your in Bali.! The beaches at Nusa Dua are so so so much better than over the seminyak side. Almost pristine in fact! ", "It's so magical here I've called my husband and told him to book a flight for next week with the kids 7 & 9 and come over, that way I can get another week here too! My female friend and I are certainly coming back and it would be a still be a relaxing pleasurable holiday with the family here!\n", "\nWe stayed in this wonderful hotel in March 2014 for 9 nights after 4 nights in Singapore. We were greeted by the Manager of the hotel and made to feel very welcome from the moment we stepped out of the taxi. The room was absolutely superb with mindblowing views of the Sea to one side and the pools to the other. The staff were so friendly and attentive throughout the resort, nothing was too much trouble for them and the food was outstanding, each and every night. Loved the nights where entertainment was provided and the spa was tremendous. Cannot fault this hotel, there are renovation works being carried out but they did not interfere with our stay at all, in fact they were so discrete we only found out about them whilst going for a walk one morning. Would highly recommend this magnificent hotel.\n", "\nWhere to start in reviewing this amazing place? We got so much out of our stay at this beautiful hotel, we didnt want to leave and we can't wait to go back. Other travellers, including one who is a syndicated travel writer admitted to this being their favourite hotel in Bali, and we understood why. Many people we met return to the hotel every year, such is its magic. Beauty at every turn, from the magnificent Balinese palace style design to the decor, room interiors, divine gardens, pools, restaurants and beachfront to the smilingly helpful staff who made our stay so beautiful. We bought a package (see their website) that included accommodation, shows, dinners, hour long spa treatments, and it was amazing value. An incredibly generous package. Dinners and shows, breakfasts and spa treatments all fabulous. We both felt amazingly healthy, beautiful and rejuvenated at the end of our stay. The management also do a fabulous job of making guests feel very special. We were invited to some beautiful events, including the hotel's own Nyepi ( Day of Silence and Balinese New Year) ceremony in the hotel's home temple. We felt like we were home here, which says a lot. The hotel itself is stunningly beautiful, it is as close as you could get to living in an ancient Balinese temple-palace. Opulence without arrogance, luxury without self consciousness. All the beauty, warmth, welcome and magic of Bali in Nusa Dua's premier location with none of the negatives associated with nouveau five star hotels, which can be unrelaxing and pretentious. We simply fell in love with this place. The NDBH & S simply is, as it says, the best of Bali. We shall return!\n", "\nWell located with a nice beach. Excellent for families: many opportunities for kids to play. Downside are horrendous prices i.e. for renting kayak, SUP or Windsurf Board (38USD/hr!). Food is average, restaurant service is poor and partly unprofessional except for the Italian Restaurant.\n", "\nAs a 'solo' traveller, I have nothing but praise for my experience staying at the Nusa Dua Beach Hotel. I had a most enchanting, relaxing and blissful six short days! Being a true 'Ballinese' design hotel of some 30 gracious years, the gardens are quite simply magnificent and seemingly wherever one looks, there are beautiful, mature gardens. I spent a little extra and upgraded myself to the 'Palace Club room; these rooms have are very spacious and have a lovely outdoor verandah area which looks out on the extensive water features and gardens. For me, this hotel is one I will quite happily return to. Thank you Palace Club for making my stay so memorable. Chris, April/May 2014\n", "\nMy husband and I first stayed at the Nusa Dua Beach Hotel 15 years ago on our own. We returned this time with our 2 children (14 yo daughter & 17 yo son), and another family couple. ", "The appeal of the Nusa Dua Beach Hotel & Spa is that over the years it has remained true to the Balinese culture which is reflected in the beautiful Balinese carvings (including the rooms), the stunning & well maintained gardens and the overall architecture. Even with the major refurbishment undertaken in the last few years it has maintained its charm stylishly but not opulently. This is sadly so often not the case with a lot of the new properties which crop up which seem sterile, stifling and lifeless.", "Rooms in our wing were culturally elegant and quiet enough. We we found them to be as clean as other (unnamed ) 5 star hotels in Bali. The beds are fresh and incredibly comfortable. We stayed in a Premier room close to the beachfront and pool which was lovely.", "Nusa Dua is an established tourist area with many elegant hotels and the clientele reflect that (no Bintang singlets here!) however, you would be hard pressed to find a hotel with as much get away garden space (shaded if you so choose) and beach frontage in Nusa Dua, as the Nusa Dua Beach Hotel & Spa. These are things to consider in the heat and humidity that comes with a Balinese holiday.", "With the hotel running at full capacity over the Easter break, you would not know it other than at the breakfast bar. During the day everyone seems to disappear as there is an abundance of seating on the beach to match the expanse which is shaded and provides ample respite from the heat. You never feel on top of other guests.", " We felt the Spa was of very high quality and even better than some we have attended at other (unnamed) 5 star resorts.", "Staying at Nusa Dua with a 17 year old son and 14 year old daughter was perfect as the beach water is clean and swimable, more often than not.", "Unlike many other beaches in Bali plus there is an abundance of water sports at reasonable rates for them to engage in. They too thoroughly enjoyed their time and were never bored - even partaking in the hotel's cooking course at Raja (Indonesian quisine) - highly recommended and fabulous food as is Maguro's (Asian quisine).", "This hotel is definitely best value for money in the Nusa Dua area. We would rate it 4.5 stars. ", "Constructive criticism: Being picky now but..... some front office staff could improve their knowledge base and willingness to assist and breakfast staff could be either more attentive or more abundant. Quite a few of the pool towels need replacing and the pool lounges could be a bit cleaner and balcony furniture could also do with some regular cleaning. We found the rooms to be quiet enough - perhaps signs on room doors, requesting that guests be a bit more considerate of other guests and not bang their doors entering and exiting- would be beneficial. Sad to have to go to that extent but unfortunately some people are not as considerate as others and this is not a hotel fault but a human one.", "MUST stress though, that these are not details that would deter one from returning to this relaxing and charming hotel. It would be our first choice in Nusa Dua.\n", "\nMy partner and I stayed here after we scored a deal via Luxury Escapes. We selected a Palace Club room for 8 nights. We arrived late and were checked in swiftly in the Palace Club area and retired after a long day of boozing and flying :) ", "Our suite had two main rooms: the living room area with separate second toilet, extra tv, and yummy tea making facilities and the large bedroom area with a super comfy king size bed, satellite tv, DVD player, minibar, fridge, massive en suite bathroom with separate bath, and closet/suitcase area. Lovely toiletries. Small hair dryer. Awesome. ", "With our deal we could have breakfast at either the Club (a la carte, table service) or the massive, well stocked Buffett on the ground floor. We did both and we not disappointed in either. They have 'real' coffee in both Areas - at the Buffett you have to make it yourself at the excellent espresso dispenser but oh to have a good latte in Bali was a god-send! ", "The grounds are beautiful, big and exquisitely maintained. The staff are super-friendly but not cloying and will go out of their way to assist you. So far so good ", "With our deal we also got theme nights included and attended the Legong night and the beach BBQ. I can't imagine how difficult it would be to get a massive Buffett for a hundred or so people right, and though the food was not perfect it was enjoyable. The seafood BBQ food was better. ", "Look out for three roving musicians we affectionately dubbed 'The Three Amigos' - they will sing you your favourite song in three part harmony and are really friendly, talented guys. ", "We had pizza by the gorgeous pool a couple of times and it was really good. Thin crisp crust, not too much topping and quality ingredients. Their salmon gravlax was impressive too. ", "The Asian bistro was our fav place to eat though. The staff are gorgeous and the food really tasty. I had the curry, but asked for chicken instead of barramundi and OH MY LORD DELICIOUS. You can tell they make their own bases, my sauce had a stick of lemongrass in it, kafir lime leaf floating about and toasted coconut. Delish. I had it twice. Also tried the salmon teriyaki which was yummy too. ", "Note: the dinners were included as part of our deal but would be a bit pricey for Bali standards. ", "On the evenings because we were staying in the club section we were entitled to cocktails and canapés- WIN. Sitting there watching the sun disappear behind the palm trees while squirrels played and ducks paddled past on their way to the nearby pond while sipping an apple martini or mojito or daiquiri was divine. Oh the canapés were exceptional too. ", "On Anzac Day we got a knock at the door and the hotel presented us with Anzac biscuits. I was really touched by this - so so thoughtful. Just a small example of the attention to detail this hotel provides. ", "Unfortunately I picked up a virus half way through our stay. We called for a doctor - there is a clinic nearby - and within 15 minutes a doctor, nurse and a suitcase full of Medication arrived. I was treated for a fee which was reasonable and which I can claim in travel insurance (don't leave home without it). I spent the day watching movies in bed but the next day I was up and about and ready for fun. Good outcome. ", "Negatives: not many. One is the massage ladies who are to the left of the beach. Don't bother. Seriously, fork out for one in the spa (30% off in the morning - but ours were included - I know, great deal). Or get a taxi elsewhere it will be cheaper. It was really expensive and possibly the worst massage I've ever had. Anywhere. It was so disinterested. The lady didn't like it that I didn't want to buy a sarong from her, I suppose. Avoid. ", "Also, once you get to Nusa Dua there's not much to do except be in the resort. Which is what we wanted but we have since moved on to Sanur where you can go for a walk and see... You know... Stuff. Or eat somewhere new. Or sit at a cafe and watch the wold go by. ", "There is a shuttle bus but not run by the hotel. It is run by Bali Collection, a yucky shopping tourist compound nearby that has a supermarket but we spent 20 minutes there and left. Just.... no.", "So if you live in Australia and want to chill by a pool drinking cocktails out of a giant coconut, look out for the Luxury Escape deal. Great value. If you want more Bali life, hang here for a few days and maybe check out Ubud. ", "Travel safe.\n", "\nStayed for 9 nights and loved the place. It's older than others in the area but with this comes some great Bali feel and design. The gardens are manicured to an inch and the trees and plantings are all mature giving the place an nice shady feel.", "We had a Premier room overlooking the side gardens which was a great view. The beds are huge and very comfortable. The bathroom although a little tired was more than adequate and suited us fine. There is plenty of drawers and hanging space unlike a lot of other places.", "Room service was good.", "The restaurants are handy and a good mix of food albeit on the high price side as are the drinks but we were happy to stay around there are drink and eat but you make your choice. ", "Staff were very friendly and acceptable for this hotel (probably 4 star now) and made you feel welcomed. ", "Vouchers in your welcome pack were handy to reduce your bills at the restaurants and bars.", "As noted by another reviewer the pools were very warm and not refreshing but the ocean was handy and cooler and clean.", "Because this place is set on 23 acres it didn't seem busy even thought it was fully booked most nights. We spent time walking around the many garden areas and taking time to sit in the many shaded areas and read our books.", "We found this hotel to be great for relaxing and lounging around the pool or beach with ample towels supplied and plenty of sun lounges. Fun was had feeding the squirrels when they came to our balcony.", "A very nice touch was on our arrival we had a fruit basket and 12 red roses in a vase as we told them we were having a wedding anniversary during our stay. The roses had a very nice message attached. A nice touch.", "Staying at many hotels we were very impressed with the breakfast bar here. The variety was very good especially the fruit selection. Everything was continually topped up so you were never short of any foods. Probably one of the overall best breakfast bars for quality and variety you would find.", "All in all we loved the place and would definitely return again.", "If you want a quieter place set in manicured gardens and traditional Bali architecture then this place will do the job nicely. Forget the age and the slightly date decor. The rooms are huge, clean, comfortable, the food from reasonable to very good and the service is friendly. It fits the bill nicely.\n", "\nWas tough to decide between Nusa Dua and Sanur which are both quite different so we chose both with 4 nights here and 2 nights in Sanur (not worth mentioning which hotel) and wished we had longer at the Nusa Dua Beach Hotel. ", "This was the perfect place to unwind. Not much to think about each day except what to eat from the extensive breakfast buffet, to which pool to lounge at. The rooms were clean, well maintained, and the grounds were lovely.\n", "\nWe stayed in the Nusa Dua Beach Hotel and Spa for 10 days. The hotel is very nice, good areas, the outside area always clean, but we didn´t have the most amazing holidays in the hotel.", "When we arrived to the hotel the staff was very friendly and helpful at the reception. We were able to check-in before the normal time which was great after a night trip to Bali. The area of the hotel is very nice, very green and very “Balinese” style. ", "As soon as we arrive to the room, the disappointment arrived….", "The room was small, the bathroom smells and the outside balcony was looking like it was not clean for a few months…. Above everything the room was one of the “interconnected rooms”. As soon as we get inside of the room, we could listen to all the conversations in the other room, and they were just talking normally. We complained at the reception but there wasn´t any other available rooms. The next morning we were awaked by the alarm clock of the opposite room, this time it wasn´t an interconnect room, but you could listen the tv and the alarm clock. ", "The cleaning of the room was terrible. The towels were not substituted unless you put them on the floor…. I mean, we are talking about a very humid country where the towels don´t dry! They should always be substituted for clean ones, so if you forget to put them on the floor, you will have wet towels for the shower! Plus there were no extra towels in the bathroom!! The water most of the times was brown… strange when you are showering! Plus the smell (dump smell)…. Same applies for the bed sheets; they were substituted only if you ask for it! You can even see the spider nets in some parts of the room. The room cleaning is definitely a area to improve! Such a nice hotel, with such poor service… it´s just sad.", "This is quite disappointed since we book this hotel because it seems to be very relaxing and resort like. The holidays were exactly to relax and appreciate the nature. At the end we could not relax in the room, making sure that the TV was not loud, trying not to make too much noise, amongst others. This is not the purpose of relaxed holidays!", "Then we have the hotel facilities. There are a few restaurants and bars that we tried, but it should be improved compared with the price that they were charging. I.e. the prices were OK, the problem is the add taxes that brings the final price 40% more expensive of what is written. There are very nice places outside of the hotel where we could have a better meal, and with a much better price and quality. We could rate the restaurants and bars as average. Nothing special.", "The SPA area is the highlight of the hotel in our opinion, in there we could relax with the wonderful swimming pool where you can actually swim, not very crowd. The only note that we would like to add, is that maybe it will be a good idea to restrict kids into this area, since this is supposed to be a relaxing area, and not a playground!", "The sports facilities are good, but we thought ridiculous the fact that we had to pay for everything! It is ok to pay a fee to rent a squash or tennis material, but paying for classes such as aerobics, yoga?! That should be complementary to the hotel guests! ", "In the beach, our opinion is that the area should be improved. The chairs are a little bit “old fashion”, the towels should be renewed, but was average. The main problem is the beach cleaning. There was rubbish all over the water, there were some “beach cleaners” on a daily base, but they were gathering the rubbish and burry it in the beach, so next day it was out again by the seas. Going for a swim in the see was just not good, you were swimming next to you will see plastic bags, plastic bottles, etc. Not good at all. ", "Bali in general doesn´t seems to be very clean, but it´s such a nice country that it´s just a waste of not improving it. Same applies for the hotel. It is a very nice hotel, but the main thing needs to be improved… a lot! This is the main reasons why if we come back to Bali we will not stay at the same hotel.\n", "\nWow, this place is visually VERY pleasing and authentic. We had such a nice time just walking around the gardens and taking in the beautiful stone features and trees (with squirrels.. Sooo cute!)", "The attention to detail and the amount of maintenance that is involved in keeping this place tidy is outstanding. Constant landscapers on duty -people raking the sand/ picking up leaves to keep the yards and beach tidy which you can imagine leaves the place immaculate! ", "The rooms are rather dated, I was somewhat unhappy when we arrived (11:30pm), but my opinion of the place changed when the sun came up. We had a garden view (room 3016) and the view was simply breathtaking! Flowers everywhere, amazing greenery, ponds, water features, ducks, squirrels, birds. I will miss seeing this view every morning!", "Restaurants- we ate at Maguro Asian restaurant 3 nights out of our 5 night stay.. It was outstanding! (And I had my fussy partner with me). Simple flavours but they got it spot on. Definitely try the sweet n sour chicken, teriyaki beef, boneless beef ribs dish or the sate chicken appetiser.", "Staff are incredibly nice and helpful!", "Breakfast buffet was very very good! Anything you could imagine having for breakfast was there.", "nusa dua is somewhat isolated so eating options are limited hence why we ate at hotel a lot. This can be quite pricey (pretty much the same as AUS prices).", "Hopefully you will enjoy this place as much as we did! :)\n", "\nWe booked this hotel through a Luxury Escapes voucher which had loads of great inclusions. Room was lovely overlooking the gardens, and we even got a daily visit on our balcony from the local squirrels. ", "Rooms were clean and spacious and well equipped. Lots of food and beverage options within the facility. Local restaurants were within walking distance (about 10 minutes away) if you preferred to eat out. Lots of restaurants in Nusa Dua offer free transport back to the hotel which was great.", "Free computer access was great for those of us who don't travel with mobile phones or laptops. The beachwalk was great and gave you the opportunity to check out other hotels within the area. ", "Loved the swim up pool bar - always a bonus. The Spa facilities were amazing, we had massages every second day and felt like royalty throughout the experience. ", "Would recommend for families, couples and those wanting to stay within the hotel for relaxation.\n", "\nAs you are driven up the entrance of this Hotel, beautiful gardens and statues will automatically set the scene for an amazing holiday. Could not speak more highly of the staff and facilities offered. The resort is spotless and you have a feeling of safety and a calming atmosphere. All the stresses you carry with your luggage will be replaced with peace, harmony and complete wellbeing. Loved the Spa area, except for the disruption of children under 12yo., not supervised by the parents ending a very peaceful experience after a massage. It is noted that in the Spa area NO CHILDREN under 12yo, allowed. The theme nights and Balinese dancing was fantastic, lovely breakfast every morning enjoyed by the exquisite water gardens were mind blowing. Every morning of our 8 night stay I would watch the iguana swim in the pond with the enormous sized fish, very tranquil indeed. the guest rooms are just stunning, we stayed in an upgraded premier room which was very comfortable and spacious. One drawback for us was a family with children were accommodated in the floor above us which resulted in us being moved due to the excessive noise. That is something to be mindful of when booking, if you are seeking peace and quiet and a restful night/day sleep enquire if children are above,around or next door, noise, crying, screaming travels, request a quite area. This is what we should have done to alleviate the inconvenience and stress it created. The free shuttle hourly ran from the Hotel is another great time filler to the Bali Connection, similar to a western shopping mall is open aired, Soho store is air-conditioned with a Star Bucks if craving a real coffee. Look for a Hardy's store when sight seeing, one in very suburb. Great value for purchasing food supplies, nibbles etc, clothes, souvenirs. All in all a lovely holiday just disappointed with issues regarding the noise factor and the inconvenience it created. You are isolated here, a number of hotels within walking distance. Everything is basically a car trip to reach unless you have general fitness and don't mind the extreme heat. Drivers can be arranged but remember to barter. Safety is excellent, security car checks going and leaving the hotels and boom gates that are manned. Enjoying a drink on the beach or near the daybeds was just luxury plus plus\n", "\nNusa Dua Beach Hotel & Spa is old world charm. Being one of the oldest it maintains that exuberence in service and standards. We were really looked after and also upgraded 2 levels due to some slight inconvience caused to us. The Asst. Manager was very accomodating and made sure our holiday is improved and not wasted. We loved the food and cocktails. The service is very good. For the price this is a great place in Nusa Dua. Close to all local attractions it was a memorable stay for our party.\n", "\nWe have just come back from another lovely time at Nusa Dua Beach Hotel. This is my 4th time to this resort always staying in the Palace club suites.", "There was eight of us this time and we really had a wonderful time. I did only give 4 stars this time where in the past it was always 5. The staff especially in the the Palace club really are amazing . Supardmi, are both exceptional but all the staff in the club are so efficient and professional they always go the extra mile, they truly are an asset to this resort. I did notice this time however other areas were not as good as in the past. The rooms are always cleaned really well, although there was never a turndown in the 8 nights I was there, nor were there any newspapers daily or a list of activities which were always offered in the past. I was last here June last year and this was on offer then. We did speak to other guests which had taken up the luxury escape package which is outstanding value, but we did not get this deal so paid a lot more for our rooms. I will look for this deal next time I stay. The breakfasts are beautiful and nothing is to much trouble. The fresh juices are a standout. Afternoon tea is again a nice touch, but cocktail time could be done better. The staff were run off their feet because there didn't seem to be enough staff to cope with the amount of guests. This would be much easier for all by offering a small buffet, like nice cheese, fruit and maybe one hot dish instead of offering the small plates ", " Overall you won't be disappointed here. Truly lovely resort\n", "\nThe overall resort has its charm of old world Bali, located in one of the most accessible area of Nusa Dua.", "Comparing to the rest of South Kuta, you do feel like you are out of no where, but for family holidays and novice travelers to Bali or South East Asia, it is perfect, the resort has almost everything one needs and it's in a safe and well manicured (but man made) part of Bali. ", "Staff we have experienced with are all friendly, however not the most knowledgeable as one would expect. They are helpful, but seemed to lacked training and coaching for that 5 star touch, especially comparing to our experience visiting Laguna hotel and Sofitel, the service gap is particular apparent in Front Office and F&B. ", "I would have rate the hotel 3.5/5 if it was available, it is most likely a good fit for family, honeymooners and more novice Asian travelers, just not for us. Its service down fall again, is most probably not notable for a relaxed family holiday, and if 5 star experience it not what is in one's mind. ", "But for us, we will surely return to staying in Seminyak/Legian Area.\n", "\nFriendly cheerful. Kids club was loved by my 6 and 7 year old. Food was fantastic. Look up Made Artaean for a great tour guide MadeArtawan on Facebook beach was warm. Weather was perfect. Take you jogging shoes as the beach track is amazing at sunrise. Free juice or coffee on the beach at sunrise", "\n", "\nWe have recently returned from the Nusa Dua Beach Hotel and Spa. What a fantastic place to stay. The grounds are well kept and the staff are just beautiful. We used a promotion from deals.com which included 8 nights in a palace suite and a huge amount of inclusions including themed dinners, spa treatments and normal 2 course dinners as well. There are quite a few restaurants within the hotel which are all well priced, clean and the service is outstanding. The many pools are well looked after and the access to your private beach is at your fingertips. As it is a private beach the hawkers are very controlled and do not bother or annoy you. We had a massage by the beach which costs less than AU$7.50 for 1 hour.", "They have three themed dinners in the week which were okay but not great. If you were to choose just one, I would choose the Friday night beach party which is held down by the beach and includes a range of seafood, meats of all kind, salads and a huge range of desserts. The breakfasts are outstanding with about anything you would like ,you will find and if you don't, just ask and the staff will be happy to assist whatever they possibly can.", "What they call Bali collection is about 1 km away from the hotel. This is like a two stage facility. You walk in the front door and you would think you have walked into David Jones or Myers. Everything is beautiful and quite expensive BUT out the back door is a different story. You will find a pharmacy, restaurants, a general store and other shops. These are not as cheap as the village so I would suggest you buy only the necessities at the Bali collection and then head to the village.", "What is known as \"the village\" is a short stroll out the front gate. Don't be afraid on your first day to acquaint yourself with the people up there as prices are not as high as you would expect in Nusa Dua. Always when travelling in Bali only use a Bluebird cab as they are a metered cab and the drivers do not try to rip you off. It will cost you around 90,000Rp or less than AU$10 in a bluebird to Kuta. ", "For those that are using the deals.com or similar promotions, we did have a problem with all of the inclusion is being accepted by the hotel. Once I produced the original offer, the staff were happy to provide what was stated. We did unfortunately not receive our fast track through customs and immigration as they blamed a third party. This was very disappointing. Those travelling to Bali, this is a great tool to use as it will save you around an hour through customs and immigration.", "This is our fourth trip to Bali and the first time staying at Nusa Dua. We had heard that Nusa Dua is much more expensive and upmarket. This is only half true. It is upmarket but is not as expensive as I thought and we would be happy to stay in Nusa Dua it again without hesitation.\n", "\nWe were two couples visiting Bali and stayed here for a week in their Palace Club rooms. The service was excellent. I was surprised by the really nice and hospitable attitude of not just the management but each and every employee. They would go to all lengths to make the guests happy. The Palace Club also had free breakfast (lots of choices), afternoon tea and evening cocktails. The drinks are awesome and they have a very nice collection of different types of tea. Overall it is a very good value for the money (at a five star+ resort). Their pool is crystal clear and has a nice swim-up bar. We had lots of in with an underwater camera at the pool. They have multiple restaurants on the property. We liked the Rajas Balinese cuisine - the one with authentic Balinese food and the Chess restaurant - it's at the beach and you can have dinner and lunch under the beach umbrellas. Overall, the best thing about the resort are all the people running it. They are so nice and amiable - you have no choice but to instantly like them.\n", "\nThe location is great, the facilities a bit dated but well maintained, grounds beautiful, staff friendly but generally very poorly trained, the food very close to horrible and WAY over priced for what you get. Restaurant staff in particular are generally clue less as to basic etiquette. Very common to have staff talk loudly, among themselves, over your head while eating. Beach set up is great but I found the beach vendors persistent and annoying, always interrupting a nap to try to sell you a sarong or kite. At low tide the depth of the ocean drops to knee deep and very weed filled.\n", "\nThis hotel was very good. Very friendly and helpful staff, great service, always smiling. Beautiful hotel, gorgeous grounds, fantastic pools - thank goodness, given it was over 32 degrees with well over 90% humidity each day we were there! We were only in Bali for five full days, and spent two and a half of them lazing by (and in) the pool. The beach was also beautiful and good for swimming. The rooms were the only air conditioned areas we noticed, but that was fine as we became accustomed to the heat. The rooms were clean and well maintained. Breakfast was a large spread and quite good, with lots of fresh local fruit and various other options to cater for different tastes and cultures. The food in the restaurants was good, but not great, and more expensive than we expected. We also kept forgetting to add the extra 21% tax, so usually ended up with a higher bill than expected. The main negative about our stay was the noise of the other guests opening and closing (banging) their doors at all hours of the night, very annoying. My son had his birthday while we were there and the hotel sent a complimentary cake to his room as a surprise - very nice and unexpected! The area outside the hotel was also beautiful, with wide footpaths and luscious gardens and we felt very safe when we walked down the road to the local shopping centre \"Bali Collection\". There was security everywhere, at the entrance to the hotel and also at the shopping centre. We think this hotel was a good choice for our first visit to Bali.\n", "\nStayed there for 5 days ", "Rooms need renovation so small bathrooms no bath tops ", "Breakfast was good average but the service not really good no choices for vegetarian ", "If you walk by the beach you can compare the resorts and the activities you can see how other resorts are more organized and luxurious\n", "\nWe stayed for 5 days. The room was stunning. Had 4th floor room (top floor) and it had a lovely view of pool and beach. ", "There were many restaurants. A little pricier than most bali restaurants but still very good value. More upmarket food and a little more pretentious but nonetheless mouth-watering food and immaculate service! ", "The staff were friendly, but this hotel is so big it loses character and familiar faces, making it impersonal.", "The facilities were incredible. Lovely spa, excellent sports and gym centre and games area. Although child friendly, not too busy or noisy with kids.", "Set right on the beach, a very relaxing place to stay!\n", "\nThis is a lovely hotel with beautiful grounds and beach. We also ate many of our meals here which were also good. The staff is extremely friendly and helpful. My sister and I had a very relaxing stay here while we toured around Bali with our private guide. We arranged for our guide separately when we were in Singapore. At the last moment while we were there, we wanted to see Uluwatu but couldn't get in touch with our own guide so the hotel arranged another guide to take us there. It was a little pricey but totally worth it.\n", "\nWe stayed in the Royal Palace Suite which was beautiful. The hotel was warm and welcoming. The pools and beach front where superb. You get your beach sellers but they are monitored by the hotel and they are not allowed to interrupt your R & R time unless you call them over. We relaxed so much while here, you would not know that there was another busy bustling side to Bali. We had the most relaxing massages, evening cocktails, breakfast and dinner ( with a show) all included. Staff are warm and friendly. I dragged my husband to Bali 3 years ago to Seminyak and he vowed never to go again. I talked him into this trip with quite a bit of persuasion. He did not know that there was a side to Bali like this, now he has no problem going s a quick getaway. March is a great time to go. Not wet, not too hot, just perfect days. We will be going back.\n", "\nWe stayed at Nusa Dua during Christmas holidays so it was extremely crowded. Room was big on a higher floor. Bathrooms definitely need to be renovated. Breakfast was a large spread. Not many options to eat if you are vegetarian. Pool is really nice. Beach was good but was crowded. Hard to find a beach chair. we also tried the Spa. During the entire massage could hear the workers outside! treatment room had mosquitoes so it was a terrible spa experience in all.", "Hotel staff was nice. Our flight was later in the night so no issues with using the facilities or storing our luggage.\n", "\nWe have been a reular travellers all our lives and always stay in 5 Star hotels. The Palace Club in this hotel is absolutly FANTASTIC. The extra's provided are the best, sperate dining room in the club for breakfast, Afternoon tea then drinks and cocktails every evening all included. They also provide vouchers for Spa treatment and money vouchers to spend in the hotel.", "The staff in the club are exceptional nothing is too much trouble and they always have a smile for you. All the saff are good but we noticed Nula ( Hope I have spelt this right) always seemed genuinly pleased to see us.", "Ted & Jean Davies\n", "\nWe recently stayed at this icon of the Nusa Dua area having first been there in 1984. How the area has changed. The option of an upgrade to The Palace Club was taken where the staff were simply outstanding. An advantage of older refurbished hotels is space. The terrace was 12 metres long. Restaurants and pool terrific. Many thanks to Ginastra, Supardi, Supadmi, Suniati, Werni, Fidelsa, Dian, Aitik, Puira, Rashi, Danls, Wardana, Meni, Sadnyana, Karlina, Dewantara, Sugeng all from The Palace Club, Sugeng the head of security, and Dermot F&B manager. Garden surroundings are beautifully landscaped and the massages sent us to sleep! We wanted a restful holiday and in 8 days only left the hotel twice for an hour. We will be back!!! John and Pat\n", "\nNice hotel with beautiful garden.. But poor hospitality to local (Asian) guests. Me and my friend came to Chess Café to have dinner and got very confused with the staffs who act as if we were not there. I have to call one of them and asked for menu. A riddiculous question with unfriendly expression came out of the waitress: “Do you want to eat?” ( what? i was asking for menu, and she asked whether I wanted to eat? Upss, did i look that humble so it seemed that I couldn’t afford to hv dinner there?)", "Another inconvenient matter happened again in the next day at breakfast. I asked for an omelet and thanked the staff after received one. He didn’t reply at all. But what happened when a Caucasian said thank for her omelet? Voila,, the staff replied with a very polite ‘ur welcome Miss\" and smiled widely.. And that’s enough,,it’s gonna be my last stay in this hotel.. There're many other hotels in Nusa Dua that appreciate their guests in better way, even if they’re locals.\n", "\nYes it's a very old hotel but I dont know it still on my priority hotel list to come when I visit to Nusa Dua area in Bali.", "It offers pure authentic Bali atmosphere and ambiance with a modern touch, they seem perfectly manage n maintain the whole hotel years after years and gives a top-notch stay experience n services.", "The area is large, so many luscious garden surroundings ahh feel so natural along with a duck pond, squirrels, kids area and swimming pools to tranquil yourself.... If you get bored you can perch in at the private beach area with a white sandy beach and crystal clear water....", "The room is quite large for the deluxe room, and can fit 3 people with a terrace fronting the garden or the ocean (opt)... Gladly I stayed at the palace club room I could access to their palace club lounge and get unlimited drinks service at any time... Loved their Mixed Berry juice.... from 3-5 pm I could enjoy the afternoon tea with cake and canape and then a wine experience with canape starting from 6 or 7 pm I forgot...", "How can I not describe about The Spa, ahh felt so relaxing and a Nusa Dua Full Massage treatment gave me another booster to my body and it was excellent. I could not get enough of their Ginger Tea, good things it was there for compliment because I loved it so much haha", "Breakfast is magnificent, you can roll whatever you want there at Wedang Jahe Restaurant. They offer many great quality food to make up your energy, and the omelette was magical, the cheese was so sticky and melting like pizza when you pull it off, kudos!", "Since they have a large property area, you wont get enough strolling around this hotel, so many activities, biking, Balinese dancer, diving lesson, fruit carving etc, you can hop pool to pool to experience swimming quality with your friends n family. You may notice, even the guests can perch up at the lobby to access a fast free wifi in hotel area...", "I once experienced a dine course in Raja's Balinese Cuisine, and they offer so many authentic Balinese cuisine, what I loved most is the cutleries and the plate, they were so big so grandeur, ah felt like a royalty... The menu were all tasty for my traditional appetite.", "But too bad the hotel is too faraway from mini-market/convenient store, you need a shuttle bus or taxi to gain access nearby...", "The staff were always smiling and helping us if we got lost in hotel hahaa, the pool staff, the lobby staff, concierge staff, waiter and waitress they were very friendly.... I think I'm gonna come back to experience more of their hospitality again and again...\n", "\nWow once again we have had an amazing time at the resort. This is our forth trip to the Nusa Dua Hotel and once again they have exceeded expectations. Great facility, friendly staff, and sensational location. highly recommend this for family (we have 3&5 year old). Great kids club and good strong consistent staffing make your family holiday one to remember. We promise to be back soon. Love you guys x\n", "\nEverything about our stay was excellent from reception to beach, the hotel had a lovely laid back feeling The staff where very attentive also the entertainment was super our room was luxurious and well appointed. That's why we keep coming back. See you in August.\n", "\nBought package through luxury escapes, royal suite upgrade, worth the little extra you pay.", "Rooms are large and very comfortable, beds are fantastic and pillows so comfy.", "Beach clean and quite, pool area excellent, Chess restaurant service and food fantastic. ", "Executive club great for breakfast, afternoon tea and drinks of an evening. All included in offer. ", "Theme nights entertainment is great but some of the food not very tasty, lacking that little extra (all buffets), a little overpriced if you had to pay the $28 per head, Disappointed when Fire Dance held on Friday nights, held in restaurant for fear of rain, hardly anyone could see past the poles and BBQ area, when we complained the waiter told us to sit down and watch, even though there were numerous empty tables at the front of the restaurant, my husband approached a supervisor who did move us and told us the drinks would be complimentary (1 wine 1 beer) BUT we still were charged for the meal and drinks at the end of our stay, even though the meal was covered in our package. Numerous guests left the restaurant during the performance. The administration staff cannot sort any problems with accounts at all and checkout was drawn out and exhausting, The wait staff are mostly very obliging - especially the staff in the executive club, you all deserve a big pat on the back!!!! Some management staff (executive chef) need to be a little for considerate of guests when holding loud conversations whilst traditional performances are staged on theme nights, we found this disrespectful to the Balinese culture and rude to paying guests.", "All in all the resort is lovely and most staff great, spa offers great massages and wraps (again included in package) and the local villages are not far to walk, the Bali Collection is close and the resort offers a regular shuttle bus.", "Certainly a resort to visit in Nusa Dua.\n", "\nI cannot speak too highly of the Nusa Dua Beach Hotel. The location is just superb and was a wonderful surprise after the Australian bogan-in-vests-and-tattoos slum of Kuta. The staff are absolutely outstanding and cannot do enough for you. The management is also extremely conscious of its PR manner and likewise are hugely accommodating and helpful. An example of their excellent co-operation was on display when my wife had an accident and had to go to hospital. They gave us the complimentary use of one of the hotel taxis to transport us to the hospital and to the airport. It was a most appreciated gesture. ", "The gardens are lush, verdant and relaxing. Don't hesitate to take a garden-facing room. With the squirrels that come to feed from your balcony it is a wonderful retreat.", "The walk along the beach is thoroughly relaxing. There are no forceful vendors to contend with and most of the walkway is shaded by trees. You can stop along the way for refreshments at the other resorts which like the Nusa Dua Beach Hotel, also have their own beach space. ", "The breakfasts are lavish as are the restaurant meals. ", "I certainly intend to visit again and have no hesitation in recommending this resort-hotel to others.\n", "\nLocated on the most emjoyable place in place in Bali, Nusa Dua beach hotel is the ideal place to spend some quality holidays with the family. The facilities are good and the landscaping is charming. The rooms are clean and spacious and the service is very freindly everywhere.\n", "\nTerrible service as 4.5 star hotel.", "I could not use a Deluxe Room for four persons which I reserved online, because the hotel allowed the previous guests to still occupy it.", "And the hotel made me wait for more than 2 hours (13:00-15:30) without any explanation.", "Finally the hotel made me change my booking room and provided two connecting rooms. But these rooms are farest from the reception and very inconvenient.", "I asked hotel why I had to change my booking room and why the hotel did not explain earlier, but no answer.", "Internet in a room was not free of charge (Rp. 110,000).\n", "\nNine times we have holidayed in Bali, our first time to Nusa Dua Beach Resort and it has been exceptional . We Have enjoyed every minute staying here.", " Very Quiet location, with paved walking path meandering along the beach for kilometres, excellent clean quiet beach directly opposite the resort, lots of shade even on the beach, large well kept lawns and gardens. Rooms clean and well maintained, beds very comfortable, fluffy pillows, room service excellent with food presentation exceptional, all food in the five restaurants well presented and flavoursome, breakfast buffet great variety including all the local fresh tropical fruit....yum, staff friendly and very accommodating . Free wireless internet with reception even on the beach. Good security. ", "Downside no local restaurants but $2 in a taxi to the Nusa Dua strip of restaurants. ", "Will we return...... Yes we have already made the reservation!\n", "\nGreat hotel with many options. Chess Bar and restaurant was our favourite, idyllic location. The live shows were great. The rooms are good quality, well maintained, could be more luxurious, but are traditional as opposed to dated. Bathrooms are a little disappointing. We had no problems with noise that others complained of. ", "Wonderful staff. ", "Nusa Dua is great, away from the hustle bustle but fine for day trips to the attractions. ", "Walks along the beach to the other resorts are lovely with many happy hours to enjoy. ", "The weather was pretty wet in May but it did not spoil the holiday. ", "We would love to go back.\n", "\nThis hotel was beautiful !! The staff are lovely and the attention to detail through out the hotel is beautiful. Breakfast was incredible each morning !! Great location close to the beach. The food and cocktails are fairly pricey but well worth the money. Do not go here if you want to go get wasted in the city as the hotel is fairly far away from most of the pubs and clubs.\n", "\nWe stayed here for 14 nights in March. What a beautiful hotel. Admitted in some places it could do with being refurbished but as when we were there it seemed some of the rooms were being referbished they obviously know this. Staff were realy friendly and nothing was to much trouble for them. Grounds off hotel are great but maybe a little more shade would not go amiss. Squirrels come down from the trees to be fed and are realy quite tame even had a couple outside on the balcony who knew every time we walked back into our room. Rooms are realy good though lighting could have been better. Also hairdryer was not the best. Lobby bar which is open until 2 am is great but again lighting not to good especialy in outside smoking area. In all had a great relaxing holiday here . Would recommend to friends and family.\n", "\nMy partner and I loved our stay here. Although 30 years old, we were made to feel very much at home. Set amongst beautiful gardens with traditional Balinese decor (unlike others), we found it to be very relaxing. We ate all our meals in the hotel restaurants, didn't get sick and enjoyed evenings listening to musicians in the lobby bar or overlooking the beach. I had a particularly stress-free time - I use a manual wheelchair and cannot walk. The disabled room was brilliant, large and superbly equipped with shower bench, rails - toilet and shower, and the hotel itself was fully accessible with disabled toilets and ramps/lifts (which is rare). Although this was our 3rd and 4th trips to Bali, this was our first to Nusa Dua and with the wheelchair. The roads in Bali are not good, so this area was pleasantly surprising and an excellent choice for celebrating my 40th birthday. I was totally spoilt by the hotel staff, and will definitely be returning again! PS The breakfast 'banquet' was just amazing!!! Thankyou! :-)\n", "\nA wonderful resort property located in a very quiet part of Bali. Beautiful beach, 2 very big pools and quite a few restaurants onsite. We stayed in a Palace Suite which was very roomy and had very good facilities. The staff were fantastic and the facilities of the Palace Club were very good indeed. We will stay here again.\n", "\nWe really enjoyed our short stay here. The room size was generous, plenty of dining options, and amazing and efficient staff/service. It was the low season so the hotel wasn't at capacity which I am sure contributed to my good experience. The breakfast is amazing, we had no trouble getting a lounge by the pool (although I expect this would be very hard during holiday periods), and everything was very clean. We had a spa treatment - the lap pool by the spa area is lovely and a nice place if you are looking for something quieter than the main pool area.", "Smoking is prohibited in public areas however this is not enforced at all. Free wifi is available in the public areas of the complex but not in rooms (additional cost for in room internet). Some people may not like this. The beach is kept very clean and security limit the hawkers. Our room was nice although the bed needs to be replaced - had we stayed longer than one night we may have asked to change rooms due to the bed.", "The best aspect of our stay was that we were permitted to continue to use the hotels facilities even after check out. Our flight was not until 10pm but we continued to enjoy the pool, spa and restaurants until we had to go to the airport.\n", "\nWe have stayed in two rooms at 3rd floor (quite far from the beach) We found a solid 5 star resort where all the basic needs are there. The resort is old but maintained well. Beachy pool was cute. Nice and large beach was the highlight of the resort. Interior and exterior design with wooden Bali theme makes you feel that you are in Bali. We recommend this r escort for families, if you don't have kids and fancy for night life, pick a hotel from Kuta. We tried water sports as well, diving, banana boat, jet ski, snorkelling …. nice (although a bit pricey ). One Comp photo per room is a good gesture from the hotel (keep in mind that camera that they use is Canon 500D only) . Breakfast food variety is limited however omelette is cooked to perfection (The chef who was there all the time was impressive) ", "Dinner in Italian restaurant was good (especially wood fired pizza) guitar was a good idea at the other restaurant. ", "They insist putting only 2 bottles of water to the room which is obviously not enough in that whether, so we had to call every time we need water to get refilled 2 bottles again .", "Concierge was really helpful although the driver that they booked for us took us ridiculously expensive shops where they tried to sell a wooden carving to 2,800 USD where we bought the same to 60 USD elsewhere.", "Try the seafood restaurant at the entrance of Bali collection where the resort has shuttle bus every hour. They serve simple food with reasonable price. Fake taxis between the resort and Balli collection costs 300 IDR one way. If you want “real” taxi, you need to say that you need “ meter taxi” ", "In conclusion, it's a very nice resort. Recommended\n", "\nBali was our favorite destination from the 5 Asian cities we visited. We had booked airport transfer and even though we were detained for 1 1/2 hrs at immigration as too many flights came in at once, the staff were passionately waiting for us with a sign. Excellent breakfast especially all the tropical fruits that tasted so delicious. The only downside was that there was no iron and ironing board provided in the room, the bathroom is very old and needs a upgrade as mold around the tiles, half shower door caused flooding after a shower. The main hobby, restaurants, room in good condition except for the bathroom and therefore I would grade this to be a 4 star not a 5 star.\n", "\nFrom the first moment we arrived we were impressed by the sight of our entrance. For a little bit extra we stayed in the palace club rooms, which were clean and tidy and beautiful view of the gardens, they also offer a wonderful breakfast afternoon tea and cocktails every day. We stayed 8 nights in total. Staff were very polite and helpful. The gardens are immaculate, this would be the cleanest resort we have ever stayed at. Will recommend hiring the bikes and going along the path along all the resorts, very beautiful especially at night. If you are looking for somewhere different to eat you can eat at any other resorts along the beach. If looking to do some shopping and don't wont the crazy hassle of Kuta go shopping in the markets at Nusa Dua (they are not so much in your face). There is also a free bus to shopping centre called Bali collection .Pools were amazing and enjoyed quiet swimming in infinity pool in spa area. Overall a wonderful resort would definitely go back.\n", "\nHotel is impressive at the first moment, it's made like a copy of Balinese palace. Huge garden around, calm and nice to walk/run promenade. Rooms a big, beds are very comfortable, separate bath and shower. We asked about calm room and got view to small pond where ducks are at home. No noise. Nice spa with additional pool, saunas, whirlpool, where we mostly were along. ", "Minuses - breakfast is the same every day, a bit boring after few days. But lot of fruits anyhow.", " Nusa Dua area is 5* reservation, so around is no real life, you should go/drive out to see/try Balinese life. For few nights for pure relax its a good place but not for long stay.\n", "\nI was able to try three types of room classes during my stay at the Nusa Dua Beach Hotel and Spa. Generally the rooms have a very good ambiance and a very authentic Balanise feel. The rooms are spacious with touches of Balanise Charm. I have some comments on each of the room classes, and the hotel as a whole. ", "Deluxe Room, the deluxe rooms are actually contemporary designed rooms, quite modern for the hotel. I would assume that these rooms have been refurbished. Pretty rooms, with some minor flaws that can be quickly remedied by good housekeeping. The seats are still designed on the old thematic fashion of clothed seats. The cream colored linen that cover the seats and couches have not been properly cleaned. Stains are visible. Also dust bunnies accumulate on the bedsides. The bathrooms are not very large, but well designed, the lavatory pan is modern, and the large rock tiled floors and rain shower add up to a beautiful and unique feel of paradise. Overall these rooms are worth the money you pay for considering they are better maintained. ", " ", "Premier Room, the premier rooms are beautiful, contrast to the modern design of the deluxe, the premier rooms have a deeper sense of Balanise charm. It is worth the extra buck if you're looking for a very authentic Balanise experience in terms of accommodations. I have visited the other more modern hotels in Nusa Dua and I believe the premier rooms at Nusa Dua Beach Hotel are the most cultural. Clean rooms, but same linen problems as the Deluxe. There is a most peaceful sense when you stay in this room, the birds chirp outside you window and everything is very settled. Some pointers though, the walls are paper thin, as you can hear the birds chirping outside, you will also hear the baby crying in the hallway or your noisy neighbors in the adjoining room. The bathrooms are nice, but there is a problem with the tile work as it was not considered utility wise, aesthetically beautiful but functionally it creates an unpleasant experience. The bathrooms are musty, and the water in the lavatory pan stays on the floor. Not very clean. This can again be remedied by proper housekeeping the floor can be cleaned then vacuumed after. Overall though this is a beautiful room to stay in. Just some minor details to fix. ", "Palace Club Room, beautiful and more spacious premier rooms. These palace rooms open to an enchanted garden on the first floor. The bathrooms are larger and the floor space of the room is quite nice. Same problems in terms of bathroom. You will have access to the Palace Buffet and Lounge which is quite nice. ", "Over all the hotel is a beautiful gem with some need for fixing. The pools are nice, and the buffet is ok, some problems with fruit flies which can again be easily fixed. Food was acceptable but not particularly great. Don't forget to get your picture ahead of time as they do not allow your free professional portrait to be done on the day of your departure. The welcome drink was pretty nice according to my friends and the massage also worth it.", "Management Dika in particular and Staff are wonderful. I would recommend this hotel for people looking for a non commercial experience. I hope that these minor issues would be fixed. If they could do this, this hotel would and should surely be ranked higher. Great experience all in all. ", "Sleep Quality is for the thin walls, albeit if there were no noisy kids or connecting room the grade would be excellent. For cleanliness there is work to be done on the premier and palace rooms.\n", "\nArrived yesterday for a four-night stay and have been impressed with the level of service and friendliness of all the hotel personnel.", "I had booked into a Palace Club room and the spacious room was a perfect blend of Balinese charm and 21st Century. I like having a separate bath and shower, the range of TV channels is second to none and there is a private ground floor balcony.", "However, I opted to upgrade to a Palace suite as for peace of mind I prefer a room on a higher floor when travelling solo.", "This is a stunning suite with separate cloakroom, living room, bedroom and bathroom with a balcony complete with two sun loungers.", "Most impressive so far has been the Palace Club. After just a few hours the staff - I hate that word - all know your name, how you take your coffee and your preferred sunset tipple. I was also impressed by the very speedy and effective repair of the in-room electricity that was cutting out intermittently. The freshly cooked to order breakfast in the club was tasty and the chef prepared specially some vegetarian canapés for me at cocktail hour.", "If I had to nitpick bearing in mind the hotel's 5 star rating there have been a couple of minor points: The club doesn't enforce it's clearly stated no under 12s policy, no water or cold flannels are given out poolside and an apparent lack of red wine glasses for red wine in the lounge.", "The pizza I ordered was tasty although devoid of the promised fresh basil and oregano but the starter of eggplant parmigiana that arrived for 75,000 rupiah defied belief. It comprised a slice of cold aubergine, a slice of cold tomato topped with a little lukewarm cheese. I eat this dish every time it is on a menu so am used to much variation but this offering was not served in tomato sauce or baked. I also overheard another guest remaking on the lack of sauce on her cannelloni.", "That being said, the hotel is amazing. I can't believe I am sitting just feet from a tropical landscaped pond with resident heron and monitor lizards and not a single mosquito. I have stayed at other hotels in Nusa Dua and this is the only one that I want to return to.\n", "\nI stayed with my 2 sisters for 5 nights. ", "Positives:", "- Our room was nice and spacious and had a nice view.", "- Pools were nice and pool temperatures were perfect!", "- Day spa was amazing (worth paying for a massage here rather than a cheap one down the street!) ", "- Beach was lovely and you could swim at the beach!", "- Balinese restaurant was amazing; Both food and service", "- Heaps of planned group activities available ", "- Amazing sports facilities and air conditioned gym", "- Stunning gardens", "- The best banana smoothies!", "Not so positive", "- I'm not sure if all rooms were like this but we felt the floor and shower could have been cleaned a bit better. There was also a musty smell in the bathroom. ", "- Onsite restaurants were a bit hit and miss particularly with service at the Italian and the international restaurant. One night we did have amazing service at the International restaurant though! ", "Overall it was a great resort and we thoroughly enjoyed our stay! ", "\n", "\nWe stayed at this hotel for a quick weekend trip. This is located in an area with other 5 star hotels, so security is pretty tight. However, with a pleasant smile and wonderful manner, they let you in with no hassle.", "The hotel grounds are very impressive. 'Huge' is an understatement.", "Rooms were a little old, you can definitely feel it as well as see it. But we felt that the location of the hotel more than made up for certain issues (like a spider's nest for example)", "If you want a hotel away from the hustle and bustle of the city, this is the place to go. Clean sandy beaches with plenty of chairs to waste the time away, sipping pina coladas. ", "I would strongly suggest not negotiating with the locals who try to get you to ride a jet ski or get a massage. Once you haggle, there is no way out; they let you know it in the local dialect as well as obvious hand gestures if you decide that sailing through a storm might not be the best way to see corals.", "The spa was wonderful, the ladies really know how to knead away stress. Here's a little tip, let them know beforehand if you'd like them to avoid 'certain areas' like tender chest area (you feel me, ladies?)", "However, be firm when scheduling your appointment. The staff will most likely get you to do it according to their convenience (like early in the morning)", "Breakfast had a wide variety of choices. To the other tourists: please don't take a stack of slice bread (9 pieces) and throw them to the fishes. That's just wasteful. Also, please behave yourselves. It's embarrassing to see fellow tourist act like complete rude idiots by cutting lines, hovering over tables and yelling.", "Overall, it was a wonderful stay and I would not hesitate to come back again, if ever I should visit wonderful Bali.\n", "\nWe had heard varying things about Bali. It is amazing. The Hotel is absolutely wonderful. The staff never stop smiling. We had a small glitch with our room when we got here, but this was quickly sorted out, no problem what so ever. Everything about this place is just wonderful. Breakfast overlooking a lake, the squirrels and birds - you never want to move. It is peaceful, beautiful and it makes you feel serene. The traditional dances are great - definitely a must to see. There is so much food available and they definitely don't scrimp on the serving. The hotel provides service while relaxing on the beach, there is just a few people selling things on the beach but they are not intrusive. We will definitely come back to this little piece of paradise. thank your to all at this great hotel.\n", "\nThis is our first trip in Bali, we happened to get the package from Luxury Escapes. We had wonderful stay, everything was perfect, the place is such a luxury to stay. We didn't even bother to get out for dinner, because the restaurants offer the food that we liked.We loved the pool, there is always available staff to take our orders, the beach is fantastic. Its a place we would recommend to our friends! The staff were always polite and with smiles! Thank you so much, we had a perfect holiday!\n", "\nWe stayed as part of a package offered by Luxury escapes. It was a truly wonderful experience.", "We opted for the palace club suite which meant an additional room and the main bedroom. This was very spacious and comfort living.", "As part of the Palace club we were welcomed to delicious breakfast, afternoon teas and cocktails in the evening. This was all table service.", "We cannot fault the staff there, they were all very friendly and always there with a smile.", "It was our first time in Bali and we just want to keep coming back again and again.\n", "\nThis was our third stop in Bali, and it was wonderful. The room was large and airy with spectacular views of the property. The beach is pristine with lots of chairs. The pool is huge with lots of places to sit with a pool bar that had extraordinary service. The lounge in the hotel is also very good although the prices are a bit high and the white wine pour couldn't have been more than 4 ounces. I did have a massage at the spa which also was very good. The pizza restarant at the pool was really great, the pizza delicious and the service perfect. The staff at the desk were really helpful, always trying to accommodate my needs. I would highly recommend this hotel.\n", "\nWe stayed at the Nusa Dua Hotel in January for our Honeymoon and it was the best decision we made. The resort is beautifully manicured, the staff are so friendly and made us feel very welcomed. We want to go back there every year to celebrate our anniversary!", "Staying in a palace club room is worth the extra money. The breakfast is more intimate, the afternoon tea is a nice treat for the middle of the day and the cocktails in the early evening is so generous. You can pick anything off their menu!! ", "Being able to get bottle water all day free of charge as a privilege is such a treat. The staff made you feel like nothing was too much trouble and they just accommodated to our every need. ", "10/10 in my books! :)\n", "\nI had seen a few, let's say average, reviews regarding the resort, so you can say I was somewhat 'open mided' about what my wife and I were in for, what made us book was basically an online deal that seemed to good to pass up. From the moment we walked through the door however, we may as well have been paying a million dollars a night. The way we were treated was out of this world, the most caring, attentive people you could ask for. Realistically, we know it is their job and we all put on a smile for our customers but you could genuinely feel their warmth. My wife and I are not people that like being waited on hand and foot, although you could see with other guests, there was never a request that was too much for them to do.", "Resort itself, beautiful buildings, architecture was fascinating and the surrounds were ideallic. Koi fish in the ponds while you have your breakfast, the bigh kingfisher hungrily watching them and the squirrels scurrying along your balcony, everything just fit together.", "My wife loved her spa treatments, which were part of the deal but otherwise fairly priced. She could not rate Wendy high enough. We both loved the pools and restaurant facilities. There was so much variety of food and drink that we didn't have enough time to try it all....", "Great location so you can travel effortlessly to the different hotspots and back. We visited Kuta, Seminyak and Ubud but Nusa Dua seemed so much more homely. Would definately recommend for other visitors and I will be looking to return myself.\n", "\nWe stayed in a Palace Club Room. It was worth paying the extra, because you get a more personalised experience. The breakfast area overlooks a beautiful garden and the personal chef will cook on demand.", "The reason why I gave it 4 stars is because of the noise level. They were building a new hotel next door and the noise was unbearable at times. I left Singapore trying to escape the noise and was not happy to find a building site next door. It would have been good to receive warning about this so we could have visited when the building work had finished.", "One of the things I liked about the hotel, which would probably be a downer for some was the overconfident wildlife. Much to my amusement, a squirrel ran up my husbands leg while on the beach leaving scratch marks on his legs. It was our fault - we enjoyed feeding these little critters! They were brilliant.", "The birds and squirrels also steal from the breakfast tables. I really enjoyed watching all the different birds visit and the ducks make the pond picturesque. There is a large water monitor lizard that you get to see close up. Frogs are everywhere and we had fun frog hunting. Sometimes the ants are a bit of a problem. At our table, ants marched in lines up the table cloth after remnants of food the birds and squirrels had spilled.", "The room I was in was beautiful and opened onto the garden. It was just such a shame about the noise. However, you could escape and walk along the beach which was always clean and had lots of beds available.", "We used the spa and had a couples package. The mosquitoes were a little bit of a pest, so the shared bath wasn't as enjoyable as it could have been.\n", "\nI read a couple of mediocre reviews and was hesitant about the place. Well, I don't know where they were staying but it certainly wasn't The Nusa Dua Hotel and Spa where we stayed. The price, the food, the STAFF!, the amenities, the atmosphere, the grounds were all top notch. Ten of my family celebrated my brothers 60th birthday there after finding a fantastic offer from Ouffer.com. We were made to feel especially welcome, as I'm sure everyone is made to feel. The age of the Hotel seems to be an issue for people but I found that it gave the place more genuine character and authenticity than the more newly built resorts. Each to their own, I suppose. Anyway, I would recommend this resort to any and all who want a holiday to remember.\n", "\nWe visit Bali often, but this was my first trip to Nusa Dua - and we WILL be back! The resort grounds are beautiful and the rooms comfortable - although a little out dated. The bed is amazingly comfortable and I considered trying to smuggle some of the pillows home in my suitcase! The pools are great, and even though the resort looked to have many rooms there was always a chair free to lay in. The spa treatments were enjoyable with plenty to do.", "We did travel with a 2 year old and there were rarely kids in the kids club. Both the kids club and the playground (which are not close together) need an upgrade, but apart from that we enjoyed our stay.\n", "\nA big luxurious resort complex which offers everything that you expect from a 5 star establishment - no complaint at all! The Deluxe rooms were a bit small and worn-out, although the website claims that they were recently refurbished (a bit hard to believe, if you ask me). The hotel ground was charming with a nice traditional Balinese flair. Two strong points of the hotel are (i) the large lagoon pools and private beach access (i.e Nusa Dua is widely regarded as the nicest beach on the island) (ii) the wide variety of food and beverage outlets, as well as the high quality food and services. Be warned though, the restaurants ain't cheap compared with the prices elsewhere on the island. The resort is a good choice if you are after a luxury escape. However, some may find that, the Nusa Dua area, as a whole,can be a bit touristy and artificial. If so, consider staying at other parts of the island to experience the genuine Balinese hospitality (for example, Seminyak, or on the North/East coast).\n", "\nWe stayed here for 8 nights after purchasing a deal on luxury escapes. As soon as our driver drove into the resort we were in love! It is so beautiful and the staff were so welcoming and friendly. The resort is large, it has so many rooms and yet the pool was never crowded and we certainly were not rubbing shoulders with other guests.", "Our room was lovely, we were supposed to be upgraded to a Premier room with a separate sitting area, but our room did not have this. Our daughter was so in love with the room that we decided not to say anything about it. The bed was soooo comfortable and the pillows were amazing!", "Our package included the 3 theme night dinners. The Beach BBQ, which wasn't held on the beach, was fabulous, the food was great as was the entertainment. The other 2 theme nights were not so good. The food was very ordinary and completely lacking in spice!", "We had massages included also. My first massage felt like someone rubbing oil all over me and was very unsatisfying, however my second one was fabulous.", "We used the drivers from the resort and they were fabulous, very knowledgeable and we felt in safe hands with them. However I would highly recommend booking some tours through the resort. We booked the Bali Safari and Marine Park through the resort and it included everything including transport and lunch.", "The bars and restaurants were excellent. Breakfast was included every day and the choice was incredible. Our daughter celebrated her birthday while we were at the resort. The staff at the Chess Restaurant provided a birthday cake for her and sang Happy Birthday to her which was very special. We kept going back to the Chess Restaurant because we were so in love with the staff - they were always so friendly and attentive.", "I would highly recommend this resort, the staff are genuinely happy and friendly and will do anything they can to help you in any way.\n", "\nWe travelled all the way from London which took us about 15 hours and then to arrive at a five star hotel without even a mention of a drink is unacceptable. We then waited for a room for 45 minutes.", "Finally got the room which looked old and tired with cosmetic patch up in places. Moving swiftly we then decided to have the seafood BBQ which was nice. Their initially advertised in their reception area that wine tasting would be included within the meal. When we asked whether the offer was available I was told a flat no without any explanation. I would also suggest that ice cream should be frozen not half melted when served.", "Room 248 (day 1)\n", "\nOk so it's only been half a day, so I may be critiquing a little early but I couldn't help myself.", "When we first arrived, the place looked amazing, very big and quite majestic. We also quickly noticed the vast arrange of activites and classes to do. But it didn't take long to change our moods. ", "1.) The floor in room is so slippery I've slipped over once already and have had a few other close calls. I am pretty uncoordinated but i'm pretty sure there's something going on here.", "2.) Staff don't have great english, we just came from Amadea Resort in Seminyak and this place has nothing on them. The staff also don't smile very much or talk to you, not very inviting.", "3.) The pool was moldy and pretty gross, it was very hard to find a place to sit in the shade and cocktails were also expensive and crap.", "4.) Bathrooms are so small, you smash your elbows when you try to wipe your bum.", "It wouldn't be that bad if the hotel was rated 3 stars instead of 5. This hotel is definitely not at a 5 star rating.", "We do still have 3 more days here so hopefully things take a turn for the better. My wife is looking forward to the Yoga class in the morning and I'm looking forward to relaxing on the private beach which is in a very beautiful location.", "Fingers Crossed!\n", "\nThis Hotel is over 30 years old and it shows in the beautiful mature grounds and architecture. The staff are widely experienced compared to the new and modern hotels who are still striving to achieve what now comes naturally to the Nusa Dua Beach. We loved our stay in the Palace Club room with great food and service. The Spa is a particularly attractive area especially by the pool. My husband is an enthusiastic squash player and was happy to be partnered with 2 members of staff from the fitness club, even if he was beaten! I enjoyed the aquarobics by the pool in the mornings too. ", "Overall the Nusa Dua beach is a lovely place to stay, with a good location, great selection of restaurants and activities and superb experienced staff. I wouldn't hesitate in recommending it to anyone.\n", "\nAlthough we start off on the wrong foot with the hotel experience, our overall experience with them was great. When we first enter the room we realized that there were insects everywhere, the sheets and the curtain had dirty spots and overall it wasn't a nice room either. So we got back to the reception and they gave us an upgraded room, which was not only clean and beautiful, with great view, but we could enter the room directly from the beach and pool aria. The hotel has many terraces where you can eat and a gorgeous restaurant for breakfast and dinner. The stuff is nice and helpful. The hotel has a free shuttle bus to and from Bali Collection where you can find many shops and restaurants.", "The pool aria is gorgeous by day and by night and all our stay was very pleasant.\n", "\nStayed for a week in January. Great location and fantastic place for our kids (age 10&12). Excellent & friendly service from the staff. Rooms a good size. Spa was enjoyable. Lots for kids to do. Pools suitable for all ages, but the large and deep main pool was a hit with the kids. Breakfast provided a comprehensive choice of foods. The pizza bar is the best! We had lots of those and my kids want to go back just to have more. This hotel is pricier than other places in Bali we have stayed, but we thought it was worth it. Just don't get a taxi through the front desk.$$$ Walk down the road and grab a Blue cab there.", "Only negative is that the room furnishings need to be upgraded. They are all looking a bit shabby for a 4 star hotel.\n", "\nWe stayed at Nusa Dua Beach for 8 days & from the second we landed in Bali airport & saw the transfer driver with our name on his card it was heaven. A quick drive from the airport over the new freeway & we were at our destination & WOW what a place. My partner & I do not travel in style generally, preferring instead an authentic experience (that is mainly due to our limited budgets & means back packers & campervans & bargains).", "Nusa Dua WAS a bargain. We obtained a voucher in Australia for our accommodation that included breakfasts, some dinners with traditional dance shows, spa treatments & an assortment of other thoughtful & genuinely given (no hidden surprises).", "Nusa Dua is a gated community of elite hotels & resorts & you are treated like royalty where ever you go. There is security on the gates but it is only a short walk to the local village market where you can barter your but off for amazing bargains. Nusa Dua does not allow many sales people on their private beach & sellers do pay a premium to have the chance to seel to guests, this means they do not haggle as hard as they pay to be there also. this doesnt mean you wont get a bargain though & an hour massage still only cost me 150,000 rupiah (AU$15). There is a shopping center which houses some very nice shops but not really the balinese experience, this is of course as it is aimed at the top end clientele which is also fine, we had fish pedicures here & used the shopping centre to buy water & beer & snacks for our room & for our day trips. Nusa Dua Beach offers free shuttle buses to & from Bali Collection every day.", "The Hotel itself is one of the first to be build at Nusa Dua but you would not know it was 20 years old, it adds to its charm, it is well established & the landscaped gardens, pool & balcony growth as gorgeous. Our room was upgrade & we had a king size bed & a private balcony the air conditioning was excellent for sleeping & although we didn't spend many daylight hours in our room it would be very comfortable to do so. The house keeping was faultless & we had our bottled water replenished each day complimentarily. The staff were just lovely, polite, well spoken & would do ANYTHING in their power to please. We made special friends with the bar man at the pool bar & each day we were treated like royalty (even though we only drank there in happy hour, which actually runs across a few bars from 4pm - 2 am!). The food & drink costs are higher than other areas of Bali but the privacy & service & peace is more than worth the extra. There are MNAY restaurants to chose from & we did not have a single bad experience in any. The pools are gorgeous & clean & towels are readily available. The beach has chairs & you can get table service for food & drinks where ever you are on the property. We were able to change money at the hotel front reception at a better rate than Australia & we did this daily & it was no problem. The only issue we had was some noise whilst trying to sleep, it is a big hotel so there is always someone around the place. This was not a problem for us though as we were so tired each day (mostly from doing nothing) we slept like babies. the beds were comfy & the linen was amazing, top quality. The staff could not do enough to help regardless of where they worked or what you needed. Many staff have worked here for many years (one of my therapists told me she had been there for 20 years) which is also a testament to their ethos & how they care for their staff.", "The spa is gorgeous. As part of our package we had 6 treatments included. I LOVED each one of them. We had 2 couples traditional Balinese massages with my partner (who took some convincing being a 'tradie bloke' but is now totally converted). I absolutely LOVED the coconut scrub & the Aloe after sun wrap was a deliciously cool blessing! Although our spa treatments were complimentary we did not receive any different treatment, we were welcomed politely, given ginger tea & offered the use of ALL the spa facilities (including Jacuzzi, spa & sauna, gorgeous quiet pool, tennis courts & gym). The treatment rooms are luxurious, private changing areas & beautiful bathrooms to rinse & shower in if necessary, there are couples rooms to enjoy your treatments together also. You do need to book in advance though as there is a good chance they cannot fit you in on the day you choose if you do not. On the one occasion that happened to me I headed down to the beach & had a 30 minute massage on the beach instead :)", "Food: the food was excellent in all restaurants & the breakfast was delicious & beyond belief, almost anything you can imagine is on offer & then some! it was my partners FAVOURITE part of each day. ", "We ventured out many times during our stay & found it very easy to obtain a driver (who we paid directly). We paid a driver 400,000 rupiah ($40AU) for 8 hours to visit tennah lot & ulawatu, he waited for us & helped us navigate the culture (the cheeky monkeys) & our surroundings. We left an iPhone 5 in his car on another short trip which he promptly returned to the hotel for them to give to us, it was in the hotel managers hand before we even knew it was missing!!", "KUTA was a complete disappointment, we intended to spend the day there, shop & eat & drink etc. this DID NOT happen! We were bitterly disappointed in KUTA, the people were rude, pushy & threatening. They hassled & followed us even after we were polite & said 'no thank you' many times. this resulted in my partner getting quite rude with them which proved necessary. The beach was filthly, rubbish all over the place in & out of the water. (coming from South Australia we have some amazing beaches & this was a disappointment) We were so grateful to re-enter Nusa Dua & head straight to the beach & calm down. KUTA is only 10,000 rupiah ($10AU) in a blue taxi from & to Nusa Dua Beach.\n", "\nWe spent two weeks at the NSBH and simply loved it!", "We stayed in the palace club room which was well worth the extra expence. Spaceous room, fruit basket, good bed, good air condition and room was cleaned daily.", "The club room also gives you access to the palace club services which is simply amazing. The staff treated us as family and did everything to make our stay as good as possible. ", "The spa was really nice, but treatments a bit expensive. I felt I got the same quality in cheaper places. ", "The resturaunts all had excellent food, although none of them understood that norwegians likes their coffee served WITH their desserts, not after! ;-)", "We had an amazing stay and loved every second of the experience. Relaxation goal accomplished!\n", "\nWe have just spent 4 glorious days at Nusa Dua Hotel Palace Club. ", "We had a suite and found it to be very comfortable. The fruit basket supplied and replenished daily, superb .The beds and pillows were great and we all slept well.", "3 females on holiday together and we all voted this the most attentive and relaxing resort ever.", "All staff were wonderful and treated us as family..nothing is too much trouble and they can't do enough for you ..Loved the Bali atmosphere ,the pools,beautiful gardens and the beach. All beautifully kept. We felt safe and secure and already planning our next visit, but next time we will stay longer..Definately ", "We look forward to meeting up with the lovely staff also ,congratulions to all of them\n", "\nWent to Bali from 12Jan to 18Jan14.it was my brother wedding. We have the hotel tour counter pick is up from the airport. Love the first impression of the hotel.is balinese style of a resort. Love the lobby surround wt gold fish pool. We can fed the fishers, fish food is available at the bell counter. Beautiful balinese statute and garden. The staff really friendly. Felt the warm fm the staff. Free WiFi around the hotel. The first 48hours room internet is free. Me and my parents on the 2nd floor. The room is typical balinese style. I love it and is clean as each day the housekeeping clean it. As my brother and sister stay on the ground floor. There's lots of bugs coz lots of tropical trees surrounding the lower floors. Buffet breakfast was excellent, service was really good. I hv try all the restaurant at the hotel. The pasta was great but infortunally the local foods like nasi goreng was so so. The hotel bottel water was really expensive is around USD5.00 per bottel. Try to get the water from the mart outside the hotel. There's a free shuttle to the bali collection, u can purchase the water fm there is around 1600 rupia. There's some good restaurant there too. It was quite safe in Bali, much better than Malaysia . The beach was beautiful and the sand is very fine.The water sports such as scuba diving, paddle boarding is so.much cheaper at the hotel. Pls don't try the massage or spa at the hotel is terrible. I try massage at so many hotels and countrys, this is the worse. The massage I pay when i'm at the beach 20,000 Rupiah is million times better. Go to the hotel tour counter to book the massage from ourside is almost 50 percent cheaper and better. If you want to shop at Kuta area bk the transfer from tour desk is cheaper than taksi .the coach cost around 60US for a few hours, the driver will wait for you while you shop, remember to bargain while u shop there. Overall is a great place to stay at the Nusa dua\n", "\nWe had a wonderful week here. We had a ground floor room facing the pool which also had views to the ocean. The room was spacious with plenty of room for 3. Bathroom lovely, although shower was not strong enough. The room was always cleaned when we were out. Breakfast was great, as was the meals at the pizza restaurant. I wouldn't recommended the bali dance theme night, the food was of poor quality, and the dancing was laughable. I had two free massages at the spa, the rooms were lovely but the massage was no better than the $7.50 massage I had a flower in the street.\n", "\nJust back from a long weekend stay from the resort. We experienced excellent services of NDBH starting right from the airport pickup.", "We traveled with one toddler and my parents, so we prefer a relaxed stay in one resort which provides us enough activties and has also some Balinese charm. And NDBH is just what we want!", "As one of the first resort in Nusa Dua, the facilities and rooms could see the age, However it is well taken care of. The resort is huge with beautiful balinese garden and statures.", "The private beach is beautiful and sand is very fine. ", "We were staying in the palace club room, and we feel the services we got well worth the extra we paid for this type of room. As it was still chinese new year period, it was crowed in general. however in the palace club we still enjoyed the quietness and some privacy. We enjoy all the food events in the palace club , my son paticularly liked the afternoon tea as there are delicious cakes and fruits. Again I must mention the service in the palace club, excellent!", "We did not try all the restaurants due to the short stay, but we did try the friday dinner buffet which has entertaining fire dance, and the chess restaurant at the beach frount. We enjoyed them very much.", "It was a lovely stay for all family, very relaxed,peaceful and enjoyable!\n", "\nMy friend and i stayed last week after a 4 weeks journey through Indonesie in the Nusa Dua Hotel. Just to relax and to enjoy the sea and the sun. Best of the house was the kitchen, fantastic gourmet, excellent chef. Many chinese guests because of the New Year. They had with them many children which was a bit annoying now and then. Free internet should be also in the whole area of the hotel. Rooms wifi has to be payed. ", "The hotel staf should maybe speak a little bit better English.", "Overall we enjoyed our stay.", "Sampai Jumpa\n", "\nAirport transfer is a little expensive but it worth while to pay USD25. An English speaking driver came to pick up and we went to the Hotel through newly constructed way. It was much more comfortable than taxi. Pity that the exchange rate was really high and I paid IDR300,000 for USD25. I should pay it by USD instead of IDR.", "Hotel interior is really Balinese. Staffs are all friendly. Restrants are all nice and not so expensive.", "I think beach area of this hotel is the best location and facilities in beach area are the best for example gazebos.\n", "\nWe stayed at the resort in July 2013. We were traveling with kids and chose a Family room which comprises of a bedroom and a separate living area. The living area has a bunk bed..which is great for the kids. The hotel has an old world charm, however needs some refurbishment. Since you are staying at a beach make sure you ask for a room close to the sea..don't assume you will get a sea view. There are lots of activities inside and outside the resort. Breakfast is sumptuous and there are shows inside the hotel premises you can enjoy. The service we found was ok. However its a typical laid back easy going resort where you can enjoy a nice spa, time by the beach and relish some lovely food at their multiple restaurants serving Indo, Japanese, Italian and western cuisines. Do be careful if you plan to visit the temples. We had a bad experience at the Mother Temple in Baisakh where we were harassed by touts. Also its a full day trip form the resort.. probably not worth it.\n", "\nI was pleasantly impressed with this hotel. I'm not normally a fan of exclusive areas developed at the expense of poorer areas in a 3rd world county and normally stay in the Legian area for a more genuine Balinese experience. A mate booked this hotel. The stunning temple at the entrance, large foyer, polished marble floors, water features, beach immediately accessible, and walking paths to nearby areas made it an impressive hotel. Value for money was good when we went in low season. Nearby shops do overcharge vs normal parts of Bali - they cater to \"wealthy\" - so catch a taxi to buy at normal prices. Surfed at nearby point hired a board there as well. Get a room that opens to the lawn and pool. The spa was unbelievably great, once we went there we swam in its secluded pool every afternoon. Ordered healthy shakes. Overall a great place would go again if not staying in Legian.\n", "\nThis is more a review of my experience rather than the hotel itself. I was in Bali with my 2 very young children (husband was following at a later date). Upon arrival at the Nusa Dua Hotel, severe illness struck and I called for a doctor to come to the room. First - The doctors were extremely good with well spoken English. Second - Thank you, to the duty manager \"Dika\" who stayed with me for an hour to look after my children as I was completely unable to. Third - I received follow up phone calls from staff until my husband arrived to check that we were all ok. Fourth - Another thank you to the General Manager for the beautiful get well card etc. ", "On top of this, I had left my camera unattended in the hotel and it wasn't to be found again. So the security manager was extremely helpful in assisting me, getting us to the police station and helping me to fill out the police report for my travel insurance.", "These are the sort of things that can and do go wrong when on holidays and this is the sort of place I want to be when travelling with children. ", "Also a special mention to the ever so friendly Exec. Chef who was always making time for those guests wanting a moment of his time. I unfortunately didn't get to eat much whilst there but what I did have was lovely.", "One other point of interest (which I also didn't get to fully enjoy). The hotel has a beautiful lagoon pool, a kids pool and is situated on one of the nicer stretches of beach in the area. And there is a kids club.", "Thank you again NDBH for your kindness.\n", "\nThe time you enter, you are entertained with wet damp scented towels, gives you so much rejuvenated. The real feel of Bali you can sense, with the aroma around you is so relaxing. the lovely soft music playing in the background. Its is just amazing. I strongly recommend it to all. Loved every moment I was there. With the sea view around.\n", "\nMy partner and I stayed in this resort for 5 nights at the end of January. Upon arrival we took an upgrade package which included a larger, nicer room overlooking the duck pond and beautiful gardens, ala carte breakfast, afternoon tea and evening cocktails, all served in a seperate dining area (from the main dining room) overlooking the duck pond. It was idyllic and well worth the extra AU$70 per night. Our ground floor room was spacious with a large terrace. There are 4 pools, 2 specifically for kids and the lagoon pool with its sand beach is very nice but too many kids for me so we spent all our time in the large main pool. Plenty of deck chairs around all pool areas and on the beach. A couple of Bali huts away from the pools which can be hired for 1/2 or 1 day which we did once and thoroughly enjoyed. There's a pizzeria near the pool (very popular with the young ones) , bar and grill on the beach, Asian restaurant and Raja's Balinese restaurant. Didn't actually try any of these as we like to eat out, but they all looked very nice. In this area of Nusa Dua the beach path is well maintained and its nice walking along checking out the other beach front hotels. Bali Collection is only a 10 minute walk. Staff are very friendly and attentive. All in all we loved this resort and would highly recommend it.\n", "\nWhat a great hotel, I cant recommend it highly enough, the location is great with a lovely beach, the staff were amazing, the local people so helpful. We rented a taxi and guide for a few days, so cheap and helped us explore the real bali. This hotel has several restaurants all good, eating by the beach was lovely. Rooms were large and good quality, the traveller photos are a fair representation.", "I will come back to this hotel some day.\n", "\nMy other half and I stayed fur 3 nights for my birthday. On arrival, we were greeted with a bday cake, roses and champagne, this set the scene for our glorious stay. The staff proved friendly and attentive. The resort displays beauty and was spotless. There are several pools with a great swim up pool bar to enjoy a few cocktails. The chess bar servers delicious food. Prices are expensive compared to outside however reasonable compared to western standards. There is a complimentary shuttle which transports you to Bali collection should you wish to eat outside. ", "The beach was clean and welcoming. Overpriced water sports and massages so be sure to barter. The lack of wireless connection in the rooms was disappointing however readily available in the lobby area and poolside. Also, there us not much to do after 10pm. The hotel should offer evening entertainment. ", "Overall an excellent stay\n", "\nI stayed at this hotel for 4 nights in January with my Mum. ", "This hotel was the 5th hotel I stayed at in 3 weeks (due to am unforseen event extending my stay) so I am comparing this hotel against The W, Kajane, Dyana Villas and the Sheraton. This hotel has the most real charm of all. You really feel a piece of Bali in this hotel with its Ballinese wooden structures and amazing ceilings in the bedrooms. After staying in the other hotels in Seminyak, Ubud and Kuta I was reluctant to go to Nusa Dua as it seems like there are just mega resorts everywhere (which is true) however this was the only place I stayed where I felt a cool breeze come through in the afternoon and through the night which is great at that time of the year.", " We stayed in a Palace Club Suite. There are 2 types of rooms there. Standard rooms or Palace Club rooms (and 1 mansion if you have 10+ people and want your own pool). If you stay in a Palace club room you get access to the Palace Cub which is a wing of the hotel with a library filled with books on Bali and architecture and gardens and some fiction books, lovely furniture settings, a big garden with ponds and special food events which pretty much go all day from the breakfast, then mid afternoon high tea with lovely cakes and drinks then cocktails with canapes early evening. If you eat at each food event you pretty much dont need dinner. You also dont see many other people as most people have standard rooms. In the palace club suite there is TV in both rooms, 2 bathrooms, a large balcony, walk in robe and a kitchenette. The safe was large so you can fit any size laptop or personal items in it.", "For families I imagine this hotel would be great they have so many activities to do from swimming in the 2 pools, pool volleyball, fruit carving lessons, table tennis, darts, gym, squash, lap pool, tennis, beach volleyball, 2 hotel pools, cycling, beach, day trips to the shops, hairdresser, spa and 4 or 5 restaurants. You pretty much dont have to leave the resort. ", "The staff were lovely but not overbearing and delivered the biggest bowl of fresh fruit ive ever seen to my hotel room. ", "Not a new hotel but one with lots of experience taking care of its western and european guests (oh and they have the cutest little animal here and there like squirrels in the trees, ducks in the ponds and other birds which all looked like they are loved and are just part of the resort).\n", "\nWe recently had 8 nights here with the kids (11,13,15) and had a great time. We booked through Luxury Escapes on a fantastic value deal. We took the upgrade and stayed in the Palace suites. The rooms are probably getting a bit old, but are clean and spacious. One 2 room suite for us and a connecting 2 room suite for the kids with a large balconey looking into the centre of the resort. The breakfasts were excellent in the Palace club room and the staff were all friendly and attentive, remembering our orders and tastes. With our package came 12 spa treatments and the spa is lovely the pool down in the spa is quiet and peaceful if you want to get away from the children in the main pool. The beach is clean and well maintained and the hawkers on the beach were not intrusive. The Chess bar and Majuro's are great restaurants - the Theme night buffets weren't so good, but the theme night shows were great (balinese dancers & Kecek dance). Its nice at Nusa Dua for families much quieter and laid back than Seminyak. But the whole Island is just a taxi ride away.\n", "\nLovely quiet hotel on the peninsula of Nusa Dua , ideally positioned right on the beach.", "The hotel is very well run, staff are so efficient and amazingly enough nothing is too much trouble.", "We would never normally partake of hotel restaurant food but here it is different , the Chess Bar and brasserie serves a good choice of excellent quality food, the steaks are especially good as is the range of meats per se.", "Very good gym", "Training pool of 25 metres", "Family/ leisure pool, beach beds, towels etc.", "Rooms of good quality and servicing spot on.", "The hotel management run a tight and very efficient ship.", "\n", "\nThis resort is well known for the people of Bali and tourist who love Bali as one of the best resorts in Nusa Dua and in Bali in general. It was the first resort built in the area and it is still provides the same quality of service and entertainment for guests. The staff members are so friendly. They often do more than expected to make your stay nice and comfortable. It is worth the money you pay for in this place.\n", "\nIt's a Marvellous place, specialy for family, I stayed there for 3 nights with my family and my daughter love the place very much, with the pool area and the playground also the beach... She refuse to go anywhere and stay at the hotel...", "The room, we stayed in deluxe room and it is huge... It's the biggest deluxe room I've ever stayed, it also have the balcony... ", "The Club Lounge also very nice, the staff is really friendly and helpful", "The restaurant is amazing... There are many option for Restaurant with variety of menu.. and the food also great.", "The wi-fi is all over the place, but you need to purchase if you want to use it in the room, unfortunately, the cellular reception inside the room is not good. ", "Overall, it's a reccomended place to stay in Bali. I would consider going back if I go to Bali, perhaps the hotel would do something about the cellular reception in the room... Well maybe for some people, you need to leave your phone home while you go to Bali.. But I preffer to keep my phone with me even when I'm on holiday.... :) ", "\n", "\nMost resorts in Nusa Dua are based on Western architecture, not the Nusa Dua Beach Hotel, which is based on traditional Balinese architecture. In our 7th trip to Bali, we stayed for 10 days in the Palace club, and were treated like royalty in a palace!! The Palace club staff are ever present, soooo helpful with every wish, and a real asset to the hotel. Our suite was spacious, internet was fast and reliable, and the fresh fruit was enjoyed. I would recommend a stay if in the Nusa Dua area, a much quieter experience than the Kuta/Legian areas.", "Positives; the Spa, 25M lap pool, games room, squash and gym. The breakfast, afternoon tea, and cocktails at the palace were exceptional.", "Negatives; despite an email to confirm our airport pick up, no one arrived. A long and frustrating call to the hotel concierge didn't help (their English and my Bahasa are questionable). We finally found someone from the hotel picking up another couple and were transferred eventually.", "Also, with such an excellent outlook over gardens, we were unable to sit on the outside chairs due to mould etc.", "Overall, we will be back!!!\n", "\nIt was truly a great place to stay in Bali (Nusa Dua). The staff were very helpful and friendly which is typical of the Balinese people. A lot more Europeans than the last time I was in Bali but I guess it added to the atmosphere of being away on holidays.", "The food at the hotel was very good but if you stayed for longer than a week you might get a little bored with it. That said there are many nice little restaurants not too far away from the hotel. Try the Tavern in the road leading into Nusa Dua, excellent service and great food and very cold Bintang reasonably priced.......had a 3 course meal for 99,000 rupia which is AUD10.00.", "Our first room wasn't quite what we expected and was located among the renovations that were going on so there was a smell of lacquer and dust. We asked to be moved to another room and they did that without any hesitation.", "I would certainly have no hesitation in recommending the Nusa Dua Beach Hotel & Spa to anyone looking to stay in a 4 star property in Nusa Dua.", "Darren & Lea\n", "\nHotel is nice. It has a good pool area with chairs also in the garden and easy access to the beach. Several good restaurants offering variety of options from Balinese gourmet and diverse Asian choices to pizza & burgers. Nice breakfast buffet. ", "Pretty good soundproofing in rooms, although voices from the corridors can be heard. Room mainly in good condition, although some weak & tear.", "Well working free internet in lobby & pool area. 80+ channels in tv.", "One weakness was the serving staff at the restaurants especially in the pool area. Service was sometimes slow. Apparently during the off-peak season there were more trainees or non-regular staff.", "Nusa Dua area itself is nice with good walking/running possibilities along beack walkway between the hotel gardens & the beach itself, running several kilometers along the beach to both directions. Good co-operation from the hotels ;-) Similarly, on the land side of the hotels, the well maintained streets & walkways enable easy moving around inside Nusa Dua. Lots of shops & restaurants also in the Bali Collection \"mall\" inside the area.\n", "\nThis was our third stay at the Nusa Dua Beach Hotel and Spa and it certainly was a case of third time lucky. As with our previous stays, we decided to select the Palace Club option and did not regret it as the service and exclusive club area is really worth it. We were lucky as our room was upgraded to a top floor palace club suite complete with a large balcony overlooking the beautifully kept hotel grounds. Despite the age of this resort, the facilities are well maintained and cleanly kept with extensive gardens and spaces to relax along with a private beach area. Our room was cleaned to perfection daily with a fruit basket every second day featuring fresh tropical fruits. All the resort restaurants had extensive menus with a wide selection for all tastes and the breakfast selection is wonderful - we certainly did not go hungry. We would like to give a special mention to Ginastra and his team, they were exceptional in their service and level of professionalism and are a true asset to the resort - thank you for making us feel welcome, relaxed and pampered. Despite what some other reviews say, our room was in great condition with all fittings and fixtures functioning well, the a/c was also quiet and easy to operate. We did make use of the onsite spa with several treatments and these were of a good standard for Bali.\n", "\nWe dined in at one the restaurants and it was great (I think it was the Balinese restaurant, couldn't remember the exact name as i was there in November). I enjoyed the private beach very much and due the time we went, there weren't many people at all! it was amazing and relaxing!", " ", "You MUST try the spa there!! it was so nice and relaxing!! I wish I chose the longer session instead of the one or 1.5 hour one. i didn't want it to end by the time we finished.. ", "The only thing bothered us was the moldy smell due to the rainy season? i don't think there was anything they could do about it as a 5- star hotel? Besides that, everything else was terrific!! good service and all.\n", "\nWonderful service, food was amazing and spa very relaxing! Wonderful place relax for our honeymoon! They upgraded us and we enjoyed everything about our stay! And wifi was quick and free! Spa lagoon pool was beautiful and really relaxing and the koi fish in the lobby were awesome! Big grounds to wonder around!\n", "\nThis is our second trip to Bali. We were there last year and stayed at The Grand Mirage. The only reason why we decided to stay somewhere different this year was because the Pool at The Mirage was a little too deep for our 6 year old. Having stayed at Nusa Dua Beach Hotel and Spa this time was great. The breakfast was overwhelming and staff were very friendly. The rooms were clean and immaculate. The body scrub and massages were the best. The pools were great with plenty of deck chairs. My only complaint would be when sitting by the pool, there were no staff around to take any food and drink orders. Also give the Chess Restaurant on the beach front a miss. You will be waiting a long time to be served food and drinks. The waiters are too busy attending to other matters and run around like headless chooks. I would hate to see them under pressure. That night there were only 3 tables with customers and they could not get anything right. Also I must mention they were quite arrogant and rude. I must say they were not Balinese! Apart from this group of arrogant chiefs who are only contracted on and might not be there for long, this place was fantastic. Theme nights were entertaining especially our Christmas Dinner. Food was to die for and entertainment was a highlight with many of us Aussies dancing the night away on the dance floor. There is a shuttle bus that will take you to Bali collections every hour. If you feel like walking, it will only take you 15 minutes. Highlight was hiring the bikes for a morning ride along the coast. A must do. Also if you want a taxi, do not get one from the hotel. They charge you double as the hotel gets their cut. Walk down towards the gates and you will find many drivers waiting to be called by the hotel. They will approach you and ask if you would like a driver. Your fare will be half the price.\n", "\nWe stayed at Nusa Dua recently and found the service shocking for the amount we paid. The wooden shutters in the bathroom were broken and the water in the basin took ages to drain, the bed smelt of damp and the service during breakfast and the buffet dinner was bad. People were walking around and looking for their own tables instead of being lead to their tables, I am unsure if they are short staffed. If they are then they shouldn't be holding buffets. We will not be returning for the amount we paid for such service\n", "\nOur second stay over 6/7 years, property has not changed much and our rooms were just starting to show signs of ageing. This time with two children, 14 and 10, deluxe room for 4 (two adjoining rooms) meant two bathrooms and worked well. Setting and ambience remains superb, staff are excellent and friendly. New toll road ($1!) makes access to airport and Kuta much quicker now. Given the proximity and ease of access to offsite restaurants, spas and drivers the mark ups on resort are a little high but overall a very relaxing stay.\n", "\nWe ( 2 adults, 2 toddlers) stayed in the Palace Club Suite over Christmas, I dont have a single bad word to say about this hotel. The manicured lawns, the fruit trees, the immaculate beach, the great pools, the room service, the room size, the service in general, all excellent.", "If you do decide to book this hotel, then do yourself a favour and spend the little extra on the Palace Club options, the service at breakfast is superb, there's no lining up at egg stations, everything is made fresh and brough to your table. The view from the breakfast area is beautiful, ponds, fountains, fish, geese, squirells all doing their thing while you sit back and plan the day ahead. You mustn't forget the free afternoon snacks in the Palace Club Room, the kids will love the cakes and the adults the cocktails.", "One thing I will pull the hotel up on....think about putting a little bit of shelter over the patio area, if it rains (like it did for 2 days) there's no where to sit without getting soaked, you cant even have the sliding doors open without having to mop up the floor.\n", "\nRooms were nice. ", "The many pools were excellent - loved the swim-up bar!", "The walk along the path (beachfront) which passed various other luxury hotels was lovely.", "Hands down THE BEST buffet breakfast! Selection of tropical fruits and made to order smoky omlettes were my personal favourite. Meal choices to suit every culture and cuisine - awesome start to the day.\n", "\nOn our honeymoon when we spent 3 nights in Bali, the location of Nusa Dua is fabulous. The hotel is nice, has huge, clean and beautiful swimming pools. The lobby is beautiful but being non Air conditioned, it can get a little hot and humid. Overall it was a nice stay, the rooms can be a little more spacious but the carvings on the doors were awesome. They gave us complimentary champagne and decorated our room and bathroom with rose petals when they got to know that its our honeymoon. The staff is very friendly and sweet. They have a compliemntary professional photograph taken aginst a picturesque backdrop.\n", "\nMe and my family, 2 daughters, we there fof the end of December and we dine on the 25th at the hotel. Considering the price, the food proposed was so so, PASTA for example !!!.", "As during the stay very few activities proposed by a 5 star hotel, no smorkeling, glass bottom boat, pedalos etc, so not a a level of a 5 star.", "Evening entertainement very poor.", "Staff was very friendly not waiting for the tips as elsewhere ; positive point.", "Hotel atmosphere excellent, neat gardens with nice ponds and great tree flowers.\n", "\nWe booked this hotel through Expedia and booked a dearer Premier room with a pool view. The room we were given on arrival was nowhere near pools. We were offered an 'upgrade' to another room also without a pool view which we declined. I have noticed since being here that the rooms overlooking the pools are being renovated. Not sure if the hotel had notified Expedia of this but someone should have let us know that we wouldn't be getting what we booked.\n", "\nWe stayed over the Christmas/New Year period.", "An additional USD$70 a day surcharge and for New Year an additional USD$175 pp for buffet dinner. No drinks. No water. No coffee. Drinks were from an additional USD$25 pp for softies …", "The entertainment was OK - female singer; and the fireworks were pretty good. The countdown was similar to a Eurovision song contest. They tried hard, but they needed professional entertainers as it was cringeworthy at times!", "So it's expensive, but that's high season. Yes we could have gone another time but we just had this time off, however so wasn't worth the additional cost for NYE dinner and to not include water and coffee … it's the little things.", "Check in was a miss. Much commotion on our check in with 2 people fussing over copying documents, credit card … We were nearly at the end of the check in process when another traveller walked up and was taken care of with his check in. They then hand us our keys. We were both checking in to the same class of room - the suites, so don't know why they couldn't finish our check in first??", "We travelled with a teen and the suite was a really good idea. He had his own toilet. Bliss.", "Only fault with the room is the bathroom is small to put stuff; the wardrobe doors are hard to open. But the bed is lovely. Gorgeous in fact.", "Sitting by the pool in a 5 star resort, I expect not to have to get up from the lounge chair, make my way to the bar to order food and drink. And wait. They are not quick with service. Lots of commotion to take an order. With all the people on the beach and around the pool, they need to think about a roving waiter or two. ", "And to bring the docket with the food or drink please. So often we had to walk to the bar to ask for it. Much commotion, many people involved, where's the check, what was the order?! I noticed many people walked off without fixing the check and the waiter asking me where they were. Gone sunshine. Missed that one. Not just by the pool but at the restaurants as well it happened.", "We waited for over 30 minutes for our drinks on the first night, and asked for them 3 times. Our meals were delivered. In the end we went to the bar.", "Breakfasts are amazing. Large variety. The afternoon tea and pre dinner drinks are a really nice touch with the type of room we have. Many times you have to follow up the drink requests.", "It's hard to be cranky. The staff are happy and helpful, just painfully slow. Lessons to learn on food and beverage service to bring it up to 5 star.", "English skills are patchy so much gets lost in transit. For an international resort, they need a few more people who can speak English. Yes I'm in Bali, I get it, but working at a resort isn't my living.", "The spa was good; the theme nights were very good. The gardens are amazing. The pools and beach clean.", "Overall, hit and miss. More education to the wait staff and the process please!\n", "\nThe good:", "Friendly helpful staff", "Great spa", "Quiet location", "Great landscaping and cute ducks", "Decent breakfast", "Beach good at high tide (no swimming in low tide)", "Jetski rental was fun", "Close to Bali Collection", "Not far from the airport (but far enough that is doesn't disturb)", "It's not terribly expensive", "They are helpful with taxis and tours", "The not-so-good:", "Check-in was unprofessional and slow", "Our requested room wasn't available and we had to wait 45min with no information", "The room we did get was damp and musty - we saw mould", "Changing the linen three times made no difference - it always felt damp", "The room was a bit buggy, even for the region", "The large scale of the resort means it's not incredibly private, and it can be difficult to find a chair at the pool or beach", "The resort is worn out and needs to be refurbished", "It has a \"family resort\" feel, which isn't great for all couples", "The general area is safe, but a bit dull", "The resort had too many people trying to sell things", "The verdict:", "It's not the most phenomenal resort, but it has some positives", "It's a good base to explore interesting/authentic parts of Bali", "If you can tolerate the few negatives - it's a very reasonable price and you may like it more than we did", "It probably wasn't the right choice for us, and we'll definitely try an alternative accommodation next time in Bali", "I don't like to give negative reviews, but in the spirit of helping the TA community make informed choices and to help the resort know where to focus attention – I feel I need to provide the positive and negative aspects honestly.\n", "\nMy husband and I went to Bali to relax. We spent one week in Nusa dua at this hotel. We weren't expecting much from the resort but we were pleasantly surprised. The atmosphere of the hotel is amazing and the style is contemporary Balinese. The main entrance to the hotel beautifully connects the interior to its tropical surroundings. There were numerous water features that brought about a feeling of serenity. Our room was also much nicer than expected, with gorgeous balcony views overlooking the tropical gardens of the hotel and Beach in the distance. The room was very clean and we'll maintained by house keeping. We received two complementary bottles of water per day. The hotel's restaurants and in room dining were all well priced and the food- delicious. The service was very polite but, there was a sense of limited English that made some communication a little difficult, but overall we managed well. In terms of location, there are many things/places you can access by taxi or the shuttle service but not much to do if you plan to walk around on foot. There is one mall 'Bali collection' that is very close by, if you like shopping, but it is quite westernised in terms of the pricing. Overall, a great stay that is highly recommended.\n", "\nBooked through Luxury Escapes and loved every minute of it. Location and facilities fantastic, staff always happy and most helpful with any minor problems quickly sorted out. So many pool areas to choose from and never felt crowded (the spa pool area extremely peaceful with great amenities). Hard to choose between the pools or the fantastic beach. By far the classiest looking entrance I have ever seen to a resort. Only $10 taxi ride to Kuta and really appreciated peace and quite when back at resort. Management very \"hands-on\" and go out of way to make stay enjoyable. Highly recommend to anyone and will certainly stay again if returning to Bali.\n", "\nI was at the Nusa Dua for a conference, for some days. The hotel staff are kind and helpful, and although the hotel is not the newest, it is in decent conditions. The whole hotel compound is nice, the pool is clean and well kept, restaurants are ok for dining (try the one on the beach, nice surrounding), the lounge bar offers some good cocktails. Wifi is available only in the common areas, not in the rooms, but if you have a room at the ground floor and step out in the garden, then you connect.", "The beach is not so good (swimming only with high tide), and if you are staying in Bali you might want to consider staying in a less touristic area. Nusa Dua is a secluded area, where you don't get to see much of Bali, so next time I'll go, I will stay in Ubud or closer to the nightlife of Kuta\n", "\nWe booked the Nusa Dua Beach Hot e based on the very good reviews we read on Trip advisor and Booking.com however our stay has been disappointing. The rooms smell and feel damp, we asked to change rooms and all of them smell damp! The wifi is available in the room but they charge you for it! Free wifi is a service you would expect from a 5 star hotel, especially that it's been pouring down since we arrived 3 days ago. And there is no distraction in the hotel apart from outdoor entertainments.", "Due to the bad weather we decided to leave early and as we paid our booking in full when we arrived, I asked to get the remaining 3 nights partly refunded. The hotel manager categorically refused to give us some sort of refund! So we will be leaving the hotel 3 nights before our planned departure and not even one night will be refunded. ", "So I would not advise people to book in advance and pay in full.", "On the bright side, the staff are really helpful and welcoming but I would definitely chose another hotel next time I come to Bali\n", "\nOk let's be frank here. This is not the most expensive hotel in the area, nor the newest or most modern. It's somewhat dated and you do notice immediately .....", "BUT we had a great time at this hotel. It's absolutely spotless, the staff are super friendly, the food is great (not amazing but great) and well you pretty much get what you would expect for the price you will probably pay.", "Lots of families so a great hotel with huge pools for kids, lots of options for dining and a nice friendly atmosphere. The grounds are lovely and very central to other hotels within mins walking distance.", "A few things I could pick on:", "-wifi is free in community areas (pool, bar etc) but is $11AUD per DAY if you want it in your room. Pretty average and it's well...misleading advertising!", "- poolside staff should be more available - you pretty much have to get up off your chair (god forbid!) and go searching to get a drink or a snack", "- breakfast staff (one or two) got a little above themselves when I asked for a fresh watermelon juice (\"sorry, not available today)\". It was delivered a few minutes later when I pushed the (minor) matter (though a whisper and snide comment passed between them). Average service for a minor request.", "- the spa prices are expensive for Bali - a shame as I would have indulged. Instead I walked two minutes to the beach (go to beach and turn left, walk a minute and ladies will flock - you should pay between 50,000-80,000 rupiah for an hour - $5.00-$8.00AUD) and got a fabulous massage while hearing the sounds of the waves rolling.", "If you're after something to blow your mind, try St Regis up the road....however we were perfectly happy with the hotel.", "Thanks for a lovely few days.\n", "\nWe spent a night for our wedding anniversary at Nusa Dua Beach Hotel Bali. We had been there with our kids, enjoy every moment in the area, clean pool, clean beach, beautiful Bali atmosphere, quiet and relaxing, but this time we traveled as a couple. Surprisingly the hotel decorated our bed with 2 towel swans and roses, then served 2 glasses of wine and bunch of roses in the pot. Special welcoming letter addressed to us. They prepared a room close to the pool and the beach, as we requested. The exceptional hospitality and care touch our hearts.", "We had an unforgettable moment there. We highly recommend this hotel.\n", "\nWe stayed in this Hotel with family for 5 nights. Everything of this hotel was brilliant. Rooms are big enough with excellent decoration and beautiful outside view . The breakfast was great. The service was excellent and you will have unforgettable time there. We spent most of our time inside the Hotel. I will recommend this Hotel and will stay there again if coming to Bali once more.\n", "\nI was staying here for work, actually. I was at a week-long conference in Nusa Dua and chose the ND Beach Hotel primarily for its proximity to the conference venue. However, because it looked so lovely, I invited my mother to fly up from Australia and share my room. We had a really blissful week together there and talked about a bigger family gathering at some stage down the track. It's situated right on the beach in a string of similar resorts but this one looked the nicest by quite a margin.", "The room was quiet and comfortable but it's the grounds that make this place so pleasant. Beautifully tended gardens, wonderful swimming pools and right on a lovely beach - it's really quite exquisite. The pools are clean and they wisely have a very nice kids pool which tends to separate those who want to lie quietly with a book all day from those who need to burn off some energy. They even have a basketball hoop set up in a little side pool so plenty of options. You just pick up a lush towel poolside and find a chair from which to begin ordering drinks and snacks. ", "The beach is also gorgeous. It's clean and the water is beautiful. There are no touts here because it's a private beach. You can eat dinner right on the beach which is a gorgeous thing to do but pick up some insect repellent from the shop first because there are little sand flies or something that can be mildly annoying once the sun goes down.", "There are plenty of places to eat but special mention goes to the breakfast buffet. It was absolutely amazing. Indonesian, Western, Japanese food, an omelet bar, magnificent fresh fruit and juices, pastries, it really was a highlight - especially for someone coming from the UK where there is very little variety. The food we paid for (lunches and dinners) seemed really reasonable to me and was always lovely. Drinks are pretty expensive though.", "The one odd thing about this place that I would point out is that they sell airport transfers for five times what it costs to take a taxi. I have no idea why but a taxi costs about $10 and the transfer $50. Other than that, the staff and the service were great. Lovely people, of course - as anyone who has been to Indonesia would anticipate. I don't normally stay at resorts, it's not my thing. But this place would make an amazing getaway for a week and if I can bring my family to Bali, this is definitely where we will stay.\n", "\nThis is a full on resort on a large beach with large pools, multiple programmed activities and restaurants. Staff are exceptionally friendly. Rooms are of decent size with all the usual amenities. Large breakfast buffet is great. Location is in a secure estate style area full of other resorts. The village nearby offers cheaper options for massages as well as cheap shopping. The en\n", "\nWe're celebrating our 40thanniversary & was the best place . We had lovely wellcome& our room ", "Was upgraded .We had lots of other surprises.Very clean hotel, & friendly staff.Breakfast was ", "very lovely. We really the beach.,you can do long walks. Hotel location is ideal away from hustle ", "& bustle. There is shuttle bus service.Very good resturants to eat in evenings.We will definetly", "go again.Beautiful swimming pool & zakuzi.\n", "\nI love everything about it. It is walking distance to the Bali convention center and it has beautiful white sand beach. I especially enjoy having dinner on the beach itself served with it's 5- star service. It is Bali at its best.\n", "\nWe've stayed at Nusa Dua Beach Hotel three times now and will be returning again next year.", "The staff are amazing, always friendly and helpful and the food is excellent (not six star calibre, but very consistent and tasty).", "We like to mix up Nusa Dua with a couple of days in Seminyak (at the W last time) and the combination is great. We avoid Kuta like the plague, it's horrendous, especially compared with Nusa Dua which is so clean and not over the top.", "If you can afford it, the club offers some handy benefits (cocktails and afternoon tea), but depends on how much time you spend at the hotel, compared with shopping or on the beach (we spent lots of time in the hotel by the pool).", "If you plan to party and go out each night, you might be better off in Kuta or Legian, but fi you want five star service with each beach and pool access, it's a great option.\n", "\nMy husband and I recently spent a few days at the Nusa Dua Beach Resort en-route to Europe and we were pleased to say it has not lost its charm. The last time we went to Nusa Dua was in 2001 and stayed there for 10 nights. This time, after a multi-million dollar upgrade and refurbishment, we were delighted with the whole experience. ", "We stayed in a Palace Club Room this time which gave us access to breakfast away from the masses as well as an evening cocktails. During the day there is an assortment of little sandwiches and other snacks in the Club lounge and recommend the little strawberry and creme tarts!", "Part of the reason we chose this resort is that it is close to the beach and easy access to the Bali Collection area as well, which has a good range of restaurants and shopping in Nusa Dua. While the food at the resort is excellent - especially the dinner buffets and shows, we tend to want to go out in the evenings - and the free shuttle makes that easy.", "The only downside of this resort is that the Wi-Fi is only free in public areas, meaning that to watch streaming movies from your iPad in your bed, you would have to purchase a Wi-Fi access. Not a huge deal as we didn't really spend too much time in the room anyway.", "Another big recommendation is to go to Sakala - which is a fine dining place around 20 minutes away in Tanjung Benoa. Most exquisite food ever in a pool lounge environment (similar to Potato head).\n", "\nWe booked a 3 night stay in the Agung Suite ($800 AUD per night) & were upgraded to the amazing 'Nusa Dua Suite' - the President of Japan had stayed in it prior to us for the APEC Meeting in Bali. OMG we were blown away to say the least!!!! ", "Red carpet private entrance, 2 storey (bigger than our house in Australia), 2 master suites each with their own spa, 5 bathrooms, Offices, huge lounge & bar area, fully functional kitchen, private pool, Flower arrangements everywhere, fruit basket, 360 degree views of the superb beach...we were truly spoilt!!!!!! Customer service second to none! All Club Palace privlidges including private breakfast, afternoon tea, evening cocktails...worth the extra $$$ to be treated like royality!!! ", "We ate at the restaurant by the pool - delicious & saw the kakec Dance during our stay which was a highlight! $1000 USD Resort Credit which could be spent throughout all areas of the Resort!! Free transfers to/from resort. It was the best stay of our 3 weeks in Bali & will be back next year!!! On behalf of the LONSDALE family - thank-you to all for absolutely EVERYTHING & making our stay with you FANTASTIC!!!! See you next year!\n", "\nThis is an AMAZING and INCREDIABLE hotel. I've never experienced anything like this in my life and believe me I do enjoy my luxury's especially on holiday. I came with my husband and son to celebrate my husbands 32nd birthday and the trip has been wonderful and all due to the super friendly hotel staff, the excellent fine wine and dining (let's not forget that they catered for my 7.5 yr old son), incredible facilities and the fab location looking over the beautiful nusa dua cove. ", "Room was great with everything we could want and if we needed anything it was clattered for with super speedy service. ", "They knew it was my husbands birthday and went the extra mile with an amazing flower display in room plus a choc birthday cake. Don't think I could have ordered a better cake in Australia!!!", "It's the additional things that they do at this hotel which has made the experience an unforgettable one!!!", "HIGHLY recommend nusa Dua Beach Hotel and will return for many years to come. Will even try and arrange international conferences here for work.\n", "\nWe arrived on a Saturday afternoon. On the Sunday morning after our first night, our door bell rang at 8am with staff member wanting to clean our room!! This is a very early time to be cleaning rooms especially on the weekend. Every day after that, we put the \"do not disturb\" sign on the door so we could sleep in during the mornings.", "There was an awful smell coming from either the drains in the bathroom or the toilet. This smell continued throughout our stay.", "The shower was awful. As the shower head is in the ceiling of the shower, you have no choice but to wet your hair during every shower.", "The man who serves us at the cafe near the beach front was not friendly.", "The burger I had from the beach front cafe was awful. It tastes quite bad.", "I found that the staff were overall not as friendly as the hotel I had stayed in prior to staying at Nusa Dua Beach hotel. The staff behind the main counter just seemed interested in running a business and did not go above and beyond, like our previous hotel did.", "I did not feel appreciated at all during my stay.", "The man working in the gym was very friendly. This was one of the only positive things I can say about the staff at Nusa Dua Beach Hotel.\n", "\nI stayed here for 8 days in November, good resort for chilling out. Staff very pleasant, room was spacious and clean. Hotel facilities very good especially the bar in the pool.", "For me it was a different kind of holiday but I still enjoyed myself. I would certainly recommend this hotel/resort to friends.\n", "\nStayed here in early November, and was really enjoyable. Rooms are spacious and have retained a more traditional feel about them. Bathroom is a little on the small side, but adequate nonetheless.", "4 or 5 restaurants to choose from, as well as 3 pools and 3 or 4 bars.", "Staffs at the hotel are fantastic. We had a few maintainence issues that were fixed within 60 minutes of my call. I have stayed at other hotels where 4-5 hours the norm is.", "The new bypass road to and from Kuta is fantastic, very few people are using it as it is a toll road so it makes the trip in and out very quick.\n", "\nThis was a hotel with great Balinese character, with authentic temples and lovely landscaped grounds. You have to see the squirrels in action - they scamper up trees and balconies and leap from one poolside umbrella to another. The staff are all friendly and attentive, but also relaxed, so we felt very relaxed (as opposed to some hotels where it is very impersonal).\n", "\nWhat we paid for and what we go were two different things.We were ripped off. The staff were rude and not a nice experence at all I will never recemend this hotel to anyone.I wont bore everyone with our stay as they wont put this review online anyway.\n", "\nThis is among the very best of holiday hotels I ever had the pleasure of staying in. The architecture is Bali temple inspired without being tacky. Two 3 story wings reach out to the beach front and between there are lovely garden sections with beautiful flowers and high palm trees between discreetly placed restaurants and swimming pools. ", "We tried most of the restaurants which were all very good with regard to food and service. The breakfast buffet was spectacular.", "The staff was great - always polite and friendly, helpful and discrete.", "Any negative points? Only a minor one. Why in the world do they offer free wi-fi in all public areas of the hotel whereas you will be charged 10 USD a day for using internet in your room? By doing so they only annoy their customers unnecessarily.\n", "\nI was really surprised by the negative reviews on TripAdvisor for this property. Of course, being the first hotel on the Nusa Dua stretch (the property's been around for 30 years), it does not offer the same experience as the newer chains that occupy the same stretch now. However, the hotel offers a true Balinese experience, the staff are gracious and ever willing to help, the buildings and rooms have a charm of its own (don't worry, they're all clean) and the grounds are just gorgeous. Plus, you'd have a beautiful stretch of beach at your doorstep. I did have a look at their standard rooms (which are okay) but I stayed at a Palace Club room on the ground floor which opened to a frangipani-scented garden. Plus, guests of this room category will also receive Palace Club privileges, which is great as you can have your breakfast and cocktails in relative privacy. Again, the grounds are truly beautiful and you'd love wandering about. Get a good room (I recommend the Palace Club), sit back and enjoy your stay!\n", "\nNusa Dua is well away from the Bali surfing and active night spot and action scene. Even the nearby golf course is now closed, with the nearest some 40 mins away. The hotel was opened by then President Suharto in 1983, which makes it 30 years in service. This is a place for easy morning walks, calm beach waters and a quiet time in general. Many of the staff at the hotel seem to have been there for quite a few years, with the breakfast staff needing an injection of urgency. The breakfast food is reasonable, however the staff and service is very ordinary. Staff assigned to other locations are quite attentive and okay. I also found a piece of wood type art (with quite sharp edges) protruding from the bottom end board of the bed. When walking past the bed it caught the side of my calf twice, and I ended up with 2 good sized cuts. I tried to explain this to the hotel guest liaison staff in the lobby, however their remedy was to visit the hotel clinic and send me some flowers with a nice card wishing me a good holiday stay. The best solution is to engineer out the problem. For the remainder of our stay I remedied the problem by pulling the bad cover down over the end of the bed to cover the sharpish protrusions.\n", "\nWe spent a week here after being in Ubud at the Royal Pita Maha and thought we were going to another 5 star hotel, but it didn't feel like that was the case. Check in staff had no idea what they were doing and took ages, rooms are very standard, shower floods if you have it turned up to much, the balcony was very small and there was cockroaches crawling around in room! Overall not a 5 star experience.", "Disappointing :(\n", "\nMy husband and I stayed in this resort for 5 nights with free transfers to and from the airport. From arrival to departure we were both blown away by the resorts beauty, exceptional service, facilities and serenity.Breakfast was amazing with so much to choose from, a highlight being the freshly made to order omelettes! Another highlight was dinner at sunset on the beach and afterwards being serenaded by the three local musicians who were performing that night at the resort!! We also found a wonderful driver/guide (Maday) that picked us up from Nusa Dua Hotel at very reasonable rates any time/day that we required. madestours@yahoo.co.id. We cannot wait to return with our children to this wonderful part of the world and stay in absolute luxury at this resort next year. Thank you so much!\n", "\nI just want to share about our travel experience in Nusa Dua Beach Hotel and Spa. I am delegation of KTT Bali Democracy Forum VI. During the stay at this hotel, I felt that services of the hotel especially at breakfast is too poor. Everytime we breakfast, well received by the registerar at the restaurant \"Wedang Jahe\". But after noted, we do not transfer to the table, not offered a drink, even dining table is not ready for use. Is such a five-star hotel service we received. We hope that the service can be improved again to this hotel the hotel of choice of domestic and foreign guests. Thank you\n", "\nI stayed in this hotel for a week-long conference at the conference centre a stone's throw away.", "As a business traveller I spend two thirds of the year travelling around the world and in hotels and this one was absolutely incredible. The hotel was built in 1983, which is rather old - but it is so well maintained that it looks as though it was built yesterday. The public areas are open to the outdoors, which some may not like, but I absolutely loved it because I try to avoid air conditioning whenever I can. The hotel had this extraordinary feel of peace and relaxation. Beautiful gardens, landscaped public areas with ponds filled with huge carp. Green spaces which were filled with birds that I enjoyed hearing when waking up in the morning. ", "The hotel is popular with discerning Japanese and Australian tourists. The food was incredible too - and the setting... beautiful.", "Staff were very efficient. The laundry service, which many hotels turn into an extortion racket, was incredibly cheap. The bedroom had parquet flooring and the bathroom had both a bath and a large shower. Top mark all around.", "Many of my colleagues stayed at the Westin hotel next door. Their feedback was that the Nusa Dua was much better since the Westin had less of a genuine feel and the bedrooms there were apparently tired (carpets etc.)\n", "\nWe stayed a week and really didn't want to leave. The real wonders of the property are the immaculate gardens and pools. They are quiet, beautifully landscaped and maintained. The property has its own beach front and it is amazing to see the expanse of clean, swept, golden sand beach with very few people. In fact, you can walk for quite some distance along a partially shaded coastal path, passing other hotels. The 25 m lap pool at the spa is an oasis of quietness and beauty. Restaurant and food quality was a trifle disappointing but we had no problems, eating well for the week. Staff are excellent and you can see the investment in training. Gentle, thoughtful and service oriented. The club room we had was spacious. Plumbing and aircon all worked as they should. Internet access was generally good, with some patchy performance. It could be faster, at less than 1 Mb speed it's at the border of acceptable. In summary though, we would find it hard to try a different hotel in Bali after the success of this stay.\n", "\nI booked online on hotel website as there were some specials running incl free airport transfer. Online booking was simple, quick and very easy to use. We were met by a friendly driver at airport and our experience was faultless from begining to end. Lovely private beach (bigger than other luxury hotels and more private and exclusive), at the end of the \"busy\" hotel strip at Busa Dua Hotel area. Easy walking distance to Bali Collection, but a little removed from busy tourist strip - which we loved. Food and ambiance were perfect - highly recomended and will definitely return.\n", "\nThings I love and the main reason I picked this resort to stay:", "A. Great location on Nusa Dua beach. Resort manages a beautiful beach with some cute trees! ", "B. Bali style resort, I especially love the front entrance gate (photo enclosed).", "C. Bus stop point to Bali Connection, many restaurant/shops there.", "D. Price is reasonable.", "Things I would like to see improvement:", "1. Too many souvenir selling locals resting on the hotel beach front, perhaps the security should sort of control that a little bit? This is the main reason I take out 1 star for my review. I really don't mind few hanging around because I love what they sell. But I noticed none of them would rest by The Westin hotel because that part of beach does not have any trees! ", "2. Food is too expensive and not very good. Only love breakfast buffet.", "3. No free wifi in any rooms, and lobby free wifi is super slow.", "4. No bath tub in Deluxe room, but I can live with this. I'll just go to spa.", "I will likely to stay this resort again if I ever visit Nusa Dua, for point #2 & 3 it's easy to solve. For #2 I'll go to Bali Connection to eat. For #3 I'll bring my own travel wifi device. But would really like to see #1 improved.\n", "\nStayed at the Nusa Dua beach for one night on business.", "This is a spectacular hotel set in beautiful gardens. The entrance hall is enormous, cool and inviting, with views to the rear over the gardens. ", "My room was just as spectacular as the entrance to the hotel itself. The bedroom was very large, with closets and writing area off. The bathroom was vast, with a shower and a large double Jacuzzi. There were twin washbasins and top-class toiletries. ", "I enjoyed an excellent night's sleep in the extremely comfortable bed. Room was kept cool all night with very efficient air-conditioning.", "I ate twice at the hotel. Dinner on the first night was on the open veranda, kept cool by rotating fans overhead. The food was excellent and the service just as good.", "Breakfast was also extremely good, with a huge choice from several cuisines.", "Staff were charming, friendly, courteous and anxious to please.", "All in all, the experience was absolutely faultless. My only regret was that I could stay only one night. I think that this would also be a wonderful hotel for leisure purposes and am considering returning for a holiday some time in the future.", "Extremely highly recommended.\n", "\nWe stayed at Nusa Dua Beach Hotel and Spa for 6 nights.", "A wonderfully restful hotel complex; which provided plenty of on site leisure and dining options.", "The food was superb - we especially enjoyed the the fish dishes.", "The staff were gentle, happy and most helpful. ", "We highly recommend this hotel.\n", "\nStayed here for 6 nights in September. I expected the hotel to be a bit dated due to it's vintage but was pleasantly surprised by the recently refurbished rooms and tastefully simple decor. Beyond the aesthetics, the staff was extremely friendly and helpful. The food at the restaurants was fresh and prepared well. Definitely recommend the breakfast buffet. Lastly the beach in front of NDBH is a great spot to watch the sunrise, breathtaking. I did not miss a day.\n", "\nStayed here for four nights and it was excellent. Very clean and comfortable room, great location, lovely restaurants which serve fantastic food, nice and friendly staff. The only moan is regarding taxi service booked through the hotel, which seems a bit steep and fares open to negotiation! Otherwise, all great and comes highly recommended.\n", "\nWe stayed at Nusa Dua beach hotel for a week with our 2 year old son. ", "I will start with saying that it was a week in paradise!", "We cannot recommend this hotel enough. The staff are so friendly & helpful. The food was amazing in all of the restaurants...and we tried all of them! The breakfast was fabulous with all sorts of options. Even the room service was great.", "The beach was clean & had plenty of shade. The pools were immaculate. There were even 2 baby pools although these were not in the shade but still, we could use the bigger pools, parts of which were shaded.", "There is a kids club too.", "We only left the hotel to go to the water park & we also had a wedding so we can't comment on the area.", "If you are not sure whether this is the hotel for you because you have small children, we can ease your concerns & definitely recommend it. ", "We cannot wait to go back!\n", "\nOverall it is a wonderful hotel. Comfort room, helpful and friendly staff, clean and beautiful surrounding, great pools, evertything designed beautifuly and easy for us (me,my husband, and my 1 year baby). A lot of garden, bale-bale, and we're adoring Wedang Jahe Resto for breakfast...this place really natural and beautiful with fishpond and crane so my baby enjoyed his breakfast experince. Sure, we'll return one day and wished we had booked for a few nights more.\n", "\nI booked Nusa Dua Beach Hotel & Spa for my 75 year old mum as our dad recently died so she wanted a relaxing week away from everything. My travel agent suggested this would be ideal for her and WOW he was so correct ! Mum only left the resort once to visit the local shops. She told me everything she needed was at the resort and the staff made her stay very enjoyable. I asked her if she would go back next time in Bali and she said 'definitely'. Thank-you to all the wonderful staff for making this holiday a memorable one.\n", "\nTo us this hotel is \" Bali \" and will now no longer stay anywhere else , we can't speak highly enough of this hotel , the staff , facilities and general feel of the hotel are great , we have been to Bali 7 times and stayed in Kuta , Legian and Seminak but staying in Nusa Dua( and this hotel ) is different kind of Bali experience . You pay a little more but it is so worth it , and to have 150m of private beach front in your hotel where you can relax and get served a drink on the sand without getting hassled is just one of the many things that makes this hotel a truly great experience , even if the hotel is full it still doesn't feel over crowded . We loved the feel of the hotel as it still keeps with the traditional Balinese feel from its gardens to its architecture and is very relaxing . Also it is only a 10-15 minute walk from Bali collections where you can enjoy hassle free shopping and great food at the many restaurants( but the hotel also has 5 ) in a clean environment and the international hospital ( for peace of mind ) and golf course are literally across the road . Would recommend this hotel to anyone , if you don't like it then your very hard to please .\n", "\nI had the pleasure to spent last week at this splendid place and hotel in Bali. It was just another business trip enriched by a unique accommodation. Its name sounds promising already, what you find upon arrival is just amazing: A marvelous hotel complex, traditional style, in a beautiful park with colorful vegetation. Welcome, staff, atmosphere and service is simply excellent and beyond \"usual standards\". The breakfast buffet in the open basement and close to a charming fishpond is substantial and exceptional. The resort offers a number of other restaurants around the pool area and on the beach side. The room was good with a nice balcony (standard here) with a look on the garden full of birds and nice squirrels. I enjoyed a traditional massage in the Spa area for a reasonable price. For families with kids the large complex with direct access to a clean beach offers almost everything and is a sort of paradise -- like others before (check other recent reviews), you will be delighted from this unique hotel experience.\n", "\nwonderful atmosphere and service .Beautiful surrounding and service was excellent. Will definitely be coming back again. The staff were patient and extremely helpful.The food was wonderful gained a few extra pounds from the potato wedges which was midnight snack the entire stay from room service.\n", "\nThis was our(me and my wife) first trip to Bali and undoubtedly we made an excellent decision to stay at Nusa Dua Beach Hotel & Spa. As soon we entered the property to check-in the first few words were \"wow\" :). The staff is very friendly and courteous. There is so much to do there that you don't feel like going out of the hotel and explore the city. The hotel arranges daily activities for guest like biking tour of the city, aquabics, pool volleyball etc. We took a biking tour early morning and I must say our biking leader took us to few spots around the city which were wonderful. ", "The food and drinks are fantastic we had so many options for our breakfast and dinner buffet. Do not miss on the banana & bread pudding and all berry dessert. I will definitely recommend this place to everyone whether you are going with family, friends or as a couple.\n", "\nWe have just spent 3 nights here and was far beyond our expectations. Wonderful location with loads of space, friendly staff, great food and very relaxing. Will definitely return one day and wished we had booked for a few nights more. We saw some of the previous reviews and by London prices, everything was terrific value. Very relaxed before we hit Gili!\n", "\nSet amongst beautiful tranquil gardens with friendly attentive staff and next to a lovely beach this is the perfect short holiday. We enjoyed 2 dinners right on the beach with our feet in the sand. The guitarist in the bar was fantastic! Breakfast was also superb.\n", "\nI was at this resort last year, People are very friendly,We stay together with our families they come from Sydney and Perth.It is happen one day, we can't use our card to open the door. called the front desk,They take care right the way, Butler was find out Safety box was open. But , we find out everything was safe, We always remember this matter,It was happen with two room, really appreciated all his attention.", "I always will recommend some one to stay at this resort,\n", "\nFrom the time we checked in the hotel gave us a wonderful experience. There is do much to do there we ended up spending more time relaxing at the hotel than exploring the city. Good entertainment at night in the lobby such as live singer and piano player. Spa was the best I have been to and great value for money. Good lessonssuch as yoga and aqua aerobics was a great feature to have.\n", "\nBefore booking, a travel agent told us that there was nothing to do in Nusa Dua so recommended only a short stay. We're so dissapointed that we took her advice as we could have easily spent a full week here rather than the 4 nights that we had. ", "The rooms and staff were lovely and housekeeping came sometimes 4 times a day! The swimming pools were incredible - one of them is like a lagoon with sand in it and a volleyball net for some fun. Another is a deeper, bigger pool with the swim-up-bar and the other is a secret long pool down near the spas. All of them were perfect for different things. My partner was particularly impressed with the small Basketball pool where we spent a couple of days shooting around.", "There were also table tennis tables, water aerobics and other balls and equipment that you can collect from the little hut. Everything is kept in very", "good condition. ", "The entire resort is also on the beach front with plenty of deck chairs around (including around the pools) that meant that no one area was ever really busy. All of the areas had a good amount of shade and sun for when that Bali sun just got too hot. ", "We asked at our reception where we could go to get to Nusa Dua town and they suggested an outdoor shopping strip or the markets. Bali Collection was the outdoor shopping strip - within walking distance along the beach from our hotel or just get on the free shuttle bus - and we spent a couple of nights or lunches here for a very cheap lunch or dinner and a good look around the stalls and shops here.", "I can't stress enough how amazing this place is and how quickly we would come back if we could. We even walked through the other resorts that are adjacent to ours along the beach and in terms of pool space and beach lounging, none of them compared!\n", "\nExcellent service and delicious buffet breakfast. We had never been to Nusa Dua before and booked this resort randomly, it was a very pleasant surprise. Only stayed one night but would definitely recommend this hotel to friends.\n", "\nStaying here for 2 nights. When first arriving @ the hotel, i was surprised that the hotel and its landscape were better seen than it were on the pics. Although, it is 30 years old, it doesn't show its age as some reviews stated. Atmosphere is so nice from front-desk until the beachside area. As Nusa Dua area getting dead faster than Kuta-Legian-Seminyak are after dark, the concept of Lobby Bar of the hotel which opens until 2.00 am everyday for those who wants to sit and to drink while enjoying the night atmosphere of the hotel with background of its stunning gardens and for those who still wanna \"hanging\" out-of-room morever after 10.30 pm, the time when most beachfront restaurants of Nusa Dua hotels /resorts closed yet. Breakfast was so so, average, compared to those of other hotel/resort in Bali. Hotel's staffs front-desk, cleaning, and restaurants are polite and ready to help. I'd like to recommend this hotel especially for those who want to look for, to stay at hotel with balinese designs and to enjoy the ambience of such environment as well. If enabled, I myself will be happy be back here....\n", "\nI spent 5D4N trip in Bali with my wife and 18months baby boy. I only stayed in Nusa Dua Beach & Spa Hotel while i was visiting Bali.", "Well, the hotel staffs were really nice. Service was excellent. Room was tidy and clean, bed is comfortable, just that the furnishing is quite old and no bathtub available for standard room, too bad for my boy who loves to use bathtub while bathing. ", "My boy loves the pool, and not forget to mention the kid club is a really great place for kids.", "One disappointment for me was the noises out of the door could easily hear from inside the room, the problem came when someone passing by your doorstep at the early morning which could really wake you up, especially staffs pushing trolley passing your doorstep.", "I was expecting nice beach, but it was not, the beach out of Nusa dua hotel is full of shell/coral fragments and particles which really hurt when you are going out there with barefoot, and the sands are way too rough and full of rubbish, i would not recommend to bring kids along, although the sea water is clean but your mood will definitely get turn down by the rubbish and rough sands.", "I was glad that Nusa Dua hotel has bicycle rental services. We rent two bicycles and get around and found out the beach right at the Westin and Hyatt is much better compare to Nusa dua.", "Location wise, it is far from city center and no shuttle provided, you need taxi in order to travel to other parts of Bali. it would be wiser choice to rent a car to get around. ", "Breakfast is included in the room package, but do not have high expectation on food being served. Breakfast is ordinary which could be served by 3-4 stars hotel, they will charge you for ordering fruit juices other than papaya and watermelon juices, while daily served breakfast is limited and menu is exactly the same everyday, i get bored with the served breakfast on the 3rd day while i stayed at the hotel. You do not have much choices when come to lunch and dinner time at the hotel, i was feeling grateful that the hotel was giving 4 x rp50,000 voucher, but you can only spent each rp50,000 voucher for every rp200,000 you have spent. I tried one of the Raja restaurant and ordered a 2 person meals and drink which cost me rp600,000, Wow!!! it was surprisingly know that the served portion were so small and actually not enough for two person.......taste is normal.... and i do not expect the foods to be sooo expensive, much more expensive than The Taaras Beach & Spa Resort which i had stayed at........ I would have better traveled to Kuta for more choices of lunch or dinner... ", "Overall, it is a nice hotel with great spa....but avoid the beach, it is not safe for kids...\n", "\nGreat location if you want a more private beach and away from the popular crowded beach areas. Well maintained and managed resort with local architectural features and landscaping in very relaxing surroundings.\n", "\nI was skeptical to come here, as I wanted to spend more time in Ubud, but my travel agent wanted us to stay here as well to experience the best beach resort! Indeed it was a great beach destination. Our rooms were very good & clean, accessible to most of the restaurants. I just loved the breakfast area its juz so cool!Loved the elaborate breakfast spread.", "There are so many activities to keep all age group busy. We went for the water aerobics which was fun! tried our hands on making festive hangings with coconut leaves. We got to see the kecak dance with authentic Indonesian dinner. ", "The only thing which disappointed us was the full body spa, wasnt anything to what I had expected. For shopping only option is to the Nusa Dua center via shuttle, which is available every 1 hr. As center is way too expensive, would rather suggest to go out of Nusa Dua for the actual shopping spree. But the overall experience was a very memorable one!\n", "\nThis was my first time in Nusa Dua and in a segregated area of resorts the Beach Hotel and Spa did not disappoint The property was great and had every thing that you would want..2 Truly spectacular pools and the beach on your door step, The rooms and service was excellent. The disappointment for me was that by 8 pm there was nothing happening....Even though Nusa Dua one of many resorts in a gated area, read the tourist info because the concierge will not direct you anywhere but the hotel you stay in....if you are after a safe reliable spot in Bali Nusa Dua is great, If you are looking for culture, adventure and embracing something different,.. it may be disappointing.\n", "\nGreat staff, excellent facilities and landscaping, perfect breakfast. I stayed there for 5 nights and it was an amazing experience. The hotel is well maintained and the pool and beach are amazing.", "Do not hesitate to book this hotel. Great value for money!\n", "\nFrom the speedy, warm and friendly check-in we loved everything about this place. This hotel is in a relaxed location and provides everything within a calm and tranquil environment. Standards across the board are excellent. The spa is a must, highly recommended - you will not find anything better. The only negative comments are for the rude, embarrassing Australians who find it acceptable to be rude to the staff who cannot do enough to please you. We were given flowers in our room for both our wedding anniversary and a birthday. Thank you for wonderful memories.\n", "\nAm aware of the gated nature of Nusa Dua, unfortunately has a negative impact on finding the real Bali . The hotel looks beautiful, great lobby and snacks pool ok walk out to the beach is beautiful. The staff seemed a little tired and lacking in Balinese graciousness could be the result of dealing only with westerners and international clients who expect their creature comforts. Good place to go if you want minimal taste of real Bali\n", "\nMy husband and I stayed at this hotel for 5 days. The staff are absolutely lovely and very hospitable. Our room was cleaned by effecient staff and the restaurant and wait staff were very attentive. The resort itself is well maintained and in good condition. What I loved the most were the trio of singers that visit the restaurant along the beach every night. They have beautiful voices, a good sense of humour and take song requests. I hope that management here shows their appreciation for the wonderful contribution their workers make to the resort. The food is top quality and the buffet breakfast is delicious. The hardest part of this resort is the cost of everything. While I know for certain the Balinese people get paid very low wages paying $16 for a cocktail, the same as I would in Australia where staff are paid a decent amount for service, its hard to swallow the concept that at full western prices the staff are still on such low wages. The other problem that stems from this is that while there is a pricey bill at the end, you will also lose money from tipping, which if you feel for the human condition of Balinese people its kind of essential to tip and they deserve it because they work hard. Overall we left very happy from this resort and would definitly return again in a heartbeat. Its beautiful, the fascilities are awesome and staff make you feel at home.\n", "\nThe deluxe double room for four is spacious with the children in an interconnecting room. The balconies are huge, the bathrooms small but functional. The gardens and pools are beautiful and the beach was better than we expected. The sand and water were pristine.", "The banana lounges were plentiful and nicely spread out across the large beach frontage, either on sand, grass or by the pool (especially compared with neighbouring hotels). The limited number of hawkers allowed on the beach were friendly and not pushy, making for relaxing shopping if interested.", "The day spa was outstanding!\n", "\nMy daughter, Jo Ann, and I went to Bali on a vacation and stayed at the Nusa Dua Beach Hotel & Spa. This is the second time I've stayed at this hotel; I stayed there seven years ago and really enjoyed it then, too. The breakfast buffet consisted of Asian and Western style foods. They also had a chef who would make any type of omelet for you. There was a wide assortment of food and it was delicious. You could sit inside or outside. We enjoyed sitting outside and viewing the channel of water next to the dining area, observing fish swimming past. The landscape was lush and peaceful; there were small stone statues placed in the water and a couple of small bridges. The hotel lobby is ornate with wood and stone carvings and a large", "fountain.", "Our room was large, clean and had a balcony with flowers growing on it. The grounds of the hotel were like a park. The beach is cleaned early each morning, giving us a nice place to relax and enjoy the ocean. ", "They have two beautiful swimming pools that really look nice in the evening with the lights on them.", "The spa also has a lap pool with nice chaise lounges for relaxing, and a nice relaxation room.", "The massages were wonderful:)", "This is a hotel that you really don't ever want to leave.......", "J. LeFeber\n"]