["\nwent here 1 year ago 4 business trip and i brought my hubby & daughter (15 mos)..", "nice hotel, nice room, nice beach and not to forget nice kids club for my daughter..", "while i'm attending the seminar, my hubby brought my daughter to the kids club so she didn't bored while waiting 4 me :)\n", "\nFine, relaxed full service luxury hotel. Fine facilities and overall relaxed environment. Good range of food and entertainment. Tours easy to arrange. Rooms comfortable. We are from New York and this was a place for unwinding.\n", "\nHad great stay. Friendly staff, great location and very relaxed. Rooms were large and well serviced, the kids loved the beach and the parents the spa pool.", "Breakfasts were huge and buffet selection vast with the standard western fare and local specialties.", "Taxis from the Hotel were good value to anywhere. Resort close to shopping centre and many restaurants that are cheaper ( and in many cases better ) than the Resorts offering.", "A walk up and down the beach is a must early in the visit to see the neighbouring food and liesure offerings.\n", "\nBeautiful hotel, beautiful beach, many amenities, great for families or couples, breakfast buffet is phenomenal, spa and gym facilities are very clean and nice, friendly staff, multiple restaurants on site with a variety of foods, you never have to leave the resort if you don't want to", "I would definitely visit this resort again!!!!\n", "\nI had a wonderful 17 days here and was very happy with everything. Great access to the beach, just a tiny walk there. Our room was very nice and comfortable and we had good service from the friendly staff. Alot of time spent in the pool which was surrounded by lush gardens.Will be left with beautiful memories.\n", "\nNice setting with direct access to the beach.", "The hotel is quite old and in some areas it shows but not a major issue.", "Bedding was comfy. Service was ok but not outstanding. Breakfast has many choice but nothing stood up. Pool is great.", "Price of food at the restaurants is very expensive but so is everything else in Nusa Dua area.", "There is free shuttle or local \"taxi\" for Rp35.000 to take you to the mall nearby.", "If you're budget conscious, call yourself a bluebird taxi instead of using their fixed rate at the concierge to take you to the airport.\n", "\nOne year ago, On 17th Sept 2012 we got married here, just the two of us, at this fantastic hotel & it was a perfect day from start to finish. After having our spa treatments that morning, we had lunch on the beach then went our separate ways to get ready. (Staff had taken my dress to the laundry so that it was crease free - it looked perfect). If you are considering getting married here, do not hesitate and go for it. From sorting out the relevant paperwork (we are from the UK) to choosing the venue, flowers etc it was all easy, no stress and the beautiful grounds at the hotel are just stunning. We got married within the grounds by the ponds, not on the beach. The walk to the alter was covered in petals, the flower arrangements were just beautiful, the musicians playing traditional music was lovely, as was the order of service, the cake was spectacular and all in all it was a wonderful happy day. I cannot speak highly enough for the attention to detail , the attentive staff and organisers, the photographer, all staff. We had a beautiful 6 course meal by the pool that evening and the food was truly amazing. Our wedding day was sheer bliss! This hotel and all staff are first class in every aspect from grounds, rooms, service, location, friendliness. So whether it's a wedding venue or just for a holiday, you will not be disappointed with your stay at this hotel and will have a memorable stay. Kind regards to all staff at the hotel x\n", "\nJust awesome!", "Especially the SPA is amasing; ", "Entire resort is focused on bring you joy- from the plently breackfast, the multiple variaty program arranged every day, including special time for children.", "I will definatelly consider returning here!\n", "\nMy husband and I made our first trip to Bali for our 48th anniversary. This hotel lives up to the full meaning of a \"resort.\" EVERYTHING was perfect! I'm going to miss the coffee and juice at sunrise, the amazing buffet breakfast, the pools, the beach with tall cold beer, the lobby bar with Eti, dinner with a show or a special dinner at Raja's Balinese Restaurant, and of course a cool clean room with a very comfortable bed!!!!!!\n", "\nWe are return customers Nusa Dua Beach Resort and Spa, this year we brought along a few family members. We all had an amazing experience yet again. This resort covers everyone's needs; from our young children to my elderly mother.", "There was something for everyone. We celebrated our children's birthday's on the same week just on different days. The service we received during these celebrations was second to none. I had arranged cakes, celebrations etc... prior to our arrival and everything went to schedule.", "The cakes were scrumptious, I only wish I could order one the same from home. ", "There are many hotel facilities, easy enough for our 7 and 9 year old to organize and attend themselves. It is safe and staff are always available and ready to help.", "Our children love this resort as much as my husband and I. We cannot wait to return for another visit soon.\n", "\nMy husband and I stayed in a standard room for 8 nights. The hotel is very clean, beautifully presented and the staff are very friendly and helpful. The buffet breakfast is excellent and offers a large variety of food options. On our third day we were unwell and we had the hotel doctor come to our room. The doctor was very helpful and gave us medication which relieved our symptoms very quickly. The hotel then left flowers and a get well card in our room which was a lovely touch! The only negative of the hotel are the prices of the food and drinks are a little expensive, however you are paying for a 5 star luxury resort which offers you a very safe, clean and relaxing experience.\n", "\nWe recently stayed there 5 nights. The room was clean and comfortable, the bed was huge! ", "The service of the hotel was excellent, the staff was always helpful and friendly. ", "Facilities were perfect. Pool is great, beach is clean and close. ", "There was no free wi-fi in the room, only in the main lobby, but there was an internet room with PCs and quick internet access for free. I did not mind that there was no internet in our room. ", "Breakfast was colorful, wide (Chinese, Japanese, English, continental, local, lots of fresh exotic and local fruits, bread with crusts...). ", "So, all in all, everything is excellent!\n", "\nHave just returned from another memorable 12 day visit to this Hotel. Cannot speak highly enough of The Palace Club staff, Mr Sunada, Suniati, Supadmi, Wardana and Sugiarta, together with all of the others. The breakfasts are excellent and the afternoon teas are superb. The grounds are still being maintained to a high standard.", "We had several drinks at Chess Bar and were always welcomed by the staff there and a number of meals at Chess in the evening, which were quite good and surprisingly inexpensive.", "Once again many thanks to all your staff.\n", "\nWe recently stayed there for 2 nights with our 3 daughters and had a superb time. Great resort hotel with a real nice beach. The facilities are excellent. Pool in the fitness area is amazing and allows excellent relaxation.", "The only issue we had was the wi-fi which worked very badly in the lobby area and was not available at all at the rooms. I would expect for an hotel like this to provide better wi-fi service everywhere.\n", "\nStayed at this hotel a few months back and was quite disappointed with the whole experience. The rooms are just ok. The service contained a lot of smiles, but nothing more. Had lunch at their cafe by the beach and got served by 3 different waiters, none could understand what we ordered (it wasn't like we wanted them to cook something special for us, we just pointed at two things on the menu and they still got them wrong... twice!). Their spa area is massive, but the gym is quite small and the equipments need an upgrade. Actually, so is the whole hotel as some places look very old and weary already...\n", "\nThis hotel is just paradise. We had booked 11 nights in March 2013 in a palace room which meant the benefits of the Palace Lounge, where you have breakfast, soft drinks all day, afternoon tea and then evening cocktails and canapés. Just makes everything seem extra special. ", "Unfortunately our palace room (which was beautiful with Balinese décor) was right next to the building site next door to the hotel which would have been noisy. My husband spoke to the Palace Lounge staff and we ended up with a Palace Suite on the other side of the hotel. It was huge and amazing. Of course we had to pay a fee but it was discounted given the circumstances. Shame it was upstairs as I had really wanted to have outside garden space which was provided with our original room but it was still a better outcome all round.", "The breakfasts have both western and Asian options and are amazing. The afternoon tea is obviously western but a great treat. Evening cocktails are very generous so be warned.", "The landscape of the hotel is incredible and breath taking. The grounds are just amazing. The lap pool beside the Spa is always very quiet and relaxing if you want to get away from the crowds. The restaurants on site are excellent. Our favourite was the sushi restaurant which was outstanding.", "You can go to the local shopping mall using the very regular free shuttle bus if you want to get out for a change.", "Everything about this hotel is great. Highly recommend. Hope to go back one day.\n", "\nMy wife and I had the most fantastic stay there. The location, the building structures, the grounds plus surrounds, the staff and security were all brilliant.", "We found ourselves discovering and enjoying a different part of the resort and its restaurants each day.", "To relax and rejuvenate in that environment was just sensational.", "Thank you.\n", "\nthey are trying to make a turistic area wich seems unnatural regarding the context of Bali... Very clean,secure,good quality shops and restaurants...but is not Bali. It is a civilized world,a little bit in a snobish way.", " The hotel is quite old and need for an urgent refurbishment ( except this, rooms are very good,no matter what is your landscape-everywhere is a park!)", " I saw more birds and animals here,inside the green area of the hotel,then in entire Bali. Feeding squirrels in my balcony was an every morning delight !", " Gardening is exceptional!", " But...extremely poor internet and extracharge in the room for this? Hello!\n", "\nStayed 6 nights end August 2013. Superb facilities for resort. Got the premier room, not as big as seen on pictures, though still comfortable and get a good night sleeps ", "The breakfast was good. I like the fresh topical fruits served daily at breakfast. The papaya juice and the bread pudding is my favorite.", "Didn't enjoy much of the facilities since most of my time for work at the conference center just in front of the hotel, but I managed to try the gym, sauna, play house and the swimming pool at the Spa house for free...", "Would like to stay there again in the future\n", "\nHaving stayed in a number of hotels in Nusa Dua and Benoa we were not sure what to expect when we selected The Nusa Dua Beach Hotel and Spa although they were high and the hotel did not disappoint. It is grand, stunning, luxurious and very well appointed. Location is great, close to Bali Collections, New Hospital and all water sports. The beach is wonderful, the pools equally, and the facilities many. Breakfast is multicultural with a wide array of choices and the many restaurants very nice but if they are not to your liking a short walk or taxi ride to Bali Collections will present with many more to choose from all at reasonable prices. The staff were very friendly and always willing to help and advise if asked. Our only complaints would be that the rooms are small but none the less well appointed and there is no WiFi available in the rooms unless you pay for it although it drops out frequently. WiFi is available free in the lobby area but again unreliable and for a hotel that supports an array of telecommunication infrastructure both within and for the local area it was a little poor. All in all a wonderful relaxing and thoroughly enjoyable hotel with all the facilities and amenities you need and all very well appointed. Would recommended it for singles, couples and families and will certainly come back only for longer next time.\n", "\nWe are so please to be able to recommend the Nusa Dua Beach Hotel & Spa. We are from the United States and never thought we would travel to Indonesia for a holiday as the trip from the US is such a very long flight. We had a job opportunity which moved us to Singapore and now we are able to travel to places we never thought we would be able to before. My husband 40th Birthday was coming up and I could not think of a better place to go but Bali to celebrate. Once I booked the hotel, I mentioned in the special request comment box that it was my husband’s birthday. It was only a few days later that The Guest Relations representatives reached out to me to see how they could help make his day as memorable as possible. They were so helpful with all the arrangements for my husband’s special day. The room they put us in was amazing. The cake delivered to our room the morning of his birthday to the wonderful romantic dinner on the evening of his special day on the beach, it was perfect. The whole entire stuff at the Nusa Dua Hotel are the most spiracle and kindest people and we can say we had the privilege of meeting a lot of them. If you are looking for a five star resort that that you can relax and get away from it all, you will want to stay here. I can say we will definitely be returning in the very near future. Again, we can’t thank the staff enough for making this special trip so memorable.\n", "\nThis hotel will definitely answer all your dreams for a perfect stay in Bali. The hotel is very grand and luxorious. Top-notch design and facilities. The staff is very helpful. The rooms are beautiful although some can be quiet far away from the beach (but close to the fitness center). The breakfast and the restaurants serve great food.. The beach is beautiful and is only for the hotel guests. We very much enjoyed our stay at the hotel. This area of Bali is beautiful! We were quite dissapointed with the wi-fi. There is only wi-fi available in the lobby area and most of the time it didn't work properly which was definitely not what we expected from such a high-class hotel. Other than that, highly recommended hotel! Should stay a minimum of 2 nights to truely enjoy!\n", "\nTook for the family for the first trip to Bali - three kids 11-8-2. This was a really nice resort in the gated Nusa Dua area. Kid's club - plenty of activities - very service oriented. Breakfast was great - lunch was okay. Dinner options were less interested after a few days - but there is a good walking mall down the road with shopping and restaurants. Do no expect to see the \"real\" Bali - but certainly a nice relaxing place\n", "\nBeing next to westin hotel, they cleverly maintained traditional identity in costumes food and presentation. Although westin appears a bit more smarter, the traditional atyle gives it an edge. ", "Mosquitoes are a problem to worry abt even in lobbies.", "Food and drink r expensive. ", "But stay is nice. ", "Welcome drink with fruitjuice n local arrack mix is nice. With low alcohol content.\n", "\nWe stayed here for 7 nights at the Palace Chub Room. Got upgraded to a suite as it was my special birthday (thank-you). The staff at the palace club were awesome. Really looked after us and all my friends and family that accompanied us to celebrate my birthday. Cocktails in the evening, breakfast in the morning, afternoon tea/snacks and service with a smile at the palace club is worth the extra. Yes yummy drinks at the pool bar. ", "Thou service and communication at main front desk (reception) can be improved.\n", "\nWe cannot praise the management and staff of this hotel enough, from the minute we booked in with ageing parents one in a wheelchair we found the staff and the hotel absolutely wonderful. They helped make our stay very comfortable and easy the accommodation and access for the wheelchair and the assistance given by the staff at all times was exemplary and we will certainly be back to enjoy another friendly stay here. ", "This was our second stay at this hotel, and we must say it was even better than the first with more entertainment like classical guitar the BBQ/Fire dancers etc. etc. ", "Thank you to all staff and management for a great time.", "Terry and Julie Howard - Perth, Western Australia\n", "\nA marvelous time in Indonesia. We travelled through Java with our private guide Sonny and driver Hudda. Everything went very well. We've been back for more than a fortnight now, but every day Indonesia is still on our minds. And when we arrived in Nusa Dua, it was the perfect finish of this holiday. We started off early from a rainy Kalibaru to cross the sea by boat and then further on land by car to Nusa Dua. It was a long, long way! And when you end up in a place like Nusa Dua, it's almost perfect. We were welcomed by a beautiful girl - sorry I can't remember your name - who brought us to our room and told us how everything worked.", "Nusa Dua is a beautiful residence where you can relax, do a work out (if you like) and have beautiful meals. And be entertained.", "We want to thank all the people who made our stay almost perfect.\n", "\nWe stayed for 5 nights in 1999, then again in 2003, & then lastly,2012 shortly after their $Multi-Million Dollar refit of the Hotel.", "It is more traditional than the huge American Luxury Hotels built around it, giving a cool feel about it, & the beautiful Gardens are a real treat to wander through, relaxing & enchanting.", "We had a beautiful corner Suite, on the 1st Floor, overlooking the pools & beach, we could have gone for a grand, ground floor Suite with it's own splash pool on the patio, which looked great, but we were very pleased with our choice of Suite, due to the view, which the ground floor one didn't have, as it had a wall around the splash pool.", "The reception area is spectacular, with a long bar behind it to one side, where it is cool & relaxing, & gives a view over the lagoon to the Dining area, reached by large stepping stones from the outside, or a lovely cool corridor from the inside.", "The SPA is just wonderful, with open air Cabanas, for all treatments, a lovely cool lap pool down the centre, with local flowers spread on the water, the treatments are all you could wish for, & we used it extensively during our stay, well recommended!", "We were very pleased with our 3 stays so far, & look forward to going back again during their 30th Anniversary.", "NUSA DUA is a special area built away from the old noisy & crowded towns of the Region, which is Exclusive for well heeled travellers, with plenty of 4 & 5 Star properties, built around the wonderful sandy beach, looking towards Lombok, where the Komodo Dragons live.", "We think that if you want to get away from the Sanitised American Chain Hotels, this is the best alternative available, that punches it's own weight with the best BALI has to offer.\n", "\nMy family and i stayed for 4 nights in a premier room. At first, i had doubt that the resort would be a pleasant one due to its 30 years old age, so I kept my expectation low. However, when i first reached the resort, i was impressed that the resort was well maintained. Even though not as impressive as other resort in the same area but was nice. Our check-in was very smooth and we got lots of vouchers. ", "This resort was located in Nusa Dua which is my favourite spot in Bali. This time i brought my snorkle with me so i could explore the shallow beach during Low-tide (around 10AM-12PM or 4-5PM). I found nice coral fish like clown fish and other nice fishes. Interesting. ", "The resort ground was nice with pools facing the beach. My daughter liked the sandy pool so much. A playground was a plus for us who bring children. There were nice balinese sculpture and walls (nice balinese feel) in the landscape. ", "The room itself was impressive and clean with nice traditional decorations. I had a feeling that the rooms had been renovated. The toilet was clean and had nice design. Overall, total satisfaction. ", "Breakfast was nice with sufficient choice of menus. Lots of seats. Staff was great and attentive. ", "Overall experience was very pleasant. Considering the rate that we got (was a good deal comparing to its neighbours), I would think this resort was excellent. I would highly recommend this resort to everyone.\n", "\nWe stayed only for one night at 10 August 2013 but we very pleased to stayed at Nusa Dua Beach Hotel & Spa. We arrived late at night booking for 2 rooms, but lucky we got an upgrade room even it's only 1 room but we like it... :D but it's take a long walk to arrive to our room... Nusa Dua Beach Hotel & Spa it's a big hotel area... so you must known that there's possibility to take time (walking) to your room... our room it's clean and spacious have balcony and big bathroom. In the morning me and my father take a walk at the side of the beach there's a pedestrian path and jogging track and it's connecting to other hotels so it's a long walk around 20 minutes.. ^^ and you can see a lot of cute squirels, they not disturbing us, they just curious to saw us like us to they.. hahahhahahaha.... :D even they crossing at your balcony.. ^^ the beaches was clean.. like to played there..", "They have 3 kind of pool... The breakfast was great I like it, there's a lot even and I can ordered Benedict eggs ^^ it's so great to stayed at Nusa Dua Beach Hotel & Spa..\n", "\nJust stayed 3 nights in a deluxe room in Mid-August. The grounds and the lobby are spectacular and have many places to sit and lounge around the pool and beach. Large grassy area next to the beach provide a choice to lay in the shade under the palm trees and still be steps to the water. Check in was pretty shaky as we arrived at 2:30 and still had to wait 1 1/2 hours for our rooms to be made up. ", "Rooms themselves were okay - not great. Furnishings are chipped and show a lot of wear. The style of the room itself is nice and modern but condition of the furnishings bring it down a lot. Bathrooms are tiny and although the fixtures seem to be new it looks like they just put the new fixtures in a badly designed bathroom. If you don't have a room facing the interior pool area the view is uninspiring and the generator from the adjacent resort make sitting on the balcony unpleasant due to the loud hum coming from the generator. We had requested rooms (we had 2) facing the ocean or pool about a month beforehand and neither room got an interior facing room. What we got was a tiny sliver of a view of the ocean. Lesson -- don't request an ocean view.", "Breakfast buffet was amazing and had many choices including both american and ethnic. Although we were in high season the buffet never felt crowded or crazy.", "Service overall was great. Everyone was very helpful and nice. ", "We went to the Nusa Dua area because it was the end of a long trip after Hong Kong and Bangkok and wanted low stress and quiet. Just sit next to the pool and beach (don't expect spectacular sunsets on this side of the island though!) and read. Nusa Dua area is perfect for that. However, culturally it was pretty much nothing and you are pretty isolated from Bali in general. The security to get into the area (gates, guards, opening trunks, etc.) makes the area very secluded but also too isolating at the same time. We're glad we spent 3 nights in Ubud beforehand for a more 'real' experience. Just know what you want before you go.", "Last note: If you want to be connected to the internet during your stay then look someplace else. No wifi (paid or otherwise) except for the immediate lobby area which gets overloaded very easily during breakfast because since there is no wifi anywhere else everyone tries to do their surfing at the same time in the morning. In this day and age it's unforgivable for a resort of this class not to provide such a basic service. There are ethernet jacks in the rooms for paid access -- too bad hardly anyone uses ethernet to connect to the internet anymore.\n", "\nOur honeymoon was in Bali and we spent 4 wonderful nights here..its a beautify property with a magical private beach...customer service is outstanding..Bali convention mall is close by and they have regular shuttles from here..there are lot of activities which you can do here like water sports, spa, cycle rides that time flies like anything...keep it up\n", "\nThis hotel is typical of those in Nusa Dua. Having only stayed here for two nights my thoughts are about whether the hotel met my expectations. It did and more. ", "A sun lounge beside the pool does need to be nabbed earlyish but there are lots of shaded lounges just a few metres away on the beach. Lunch and dinner menus are very western and I imagine Balinese / Indonesian meals are light on the chilli! Breakfast is well worth having, lots of choices covering most bases, western, Japanese, Chinese, Indonesian etc in a lovely setting beside a small pond of water lilies. With 300 or so rooms its a big hotel but its well laid out and we found it to be very affordable. $140Aus for a large, very clean and comfortable room with a lovely view.", "If you are arriving in Bali on a late flight and want a couple of nights to settle in before heading north it's perfect. ", "One thing all Nusa Dua hotels offer is the opportunity to stroll hand in hand along clean beaches, on two-person wide footpaths that are flat and well-lit at night. That's a bonus compared to the up, down, trip single- file scenario in other busy tourist destinations.", "The best thing about the hotel - it is just so easy. The worst - getting good Balinese / Indonesian food for dinners, and of course, byo wine.\n", "\nMy friend and I have just returned from an 8 nights stay at this hotel. BEST IDEA EVER!! ", "We stayed in a second floor premier room with twin beds overlooking the garden and duck pond, and got a great deal on one of the booking websites suggested by Tripadvisor.", "The hotel is huge and very ‘Bali’. Our room was very clean and comfortable, the only thing we disliked was the lack of sound insulation from the bathroom. The separate toilet has louvers in the door for ventilation but because there are openable shutters (so you can view the room from the bath) in the bathroom wall, all sounds from the toilet can be heard loud and clear in the room. This was our only issue though. I requested a firmer pillow and extra quilts (we prefer sleeping in a cold room with heavy quilts) and housekeeping were happy to help. There are plenty of English speaking TV channels if you want to relax in your room for a while (my friend was feeling ill so she spent some time watching TV in the room to escape the midday heat, and was delighted to find a live AFL game on TV.)", "I won’t talk about the annoying lack of wifi in the rooms – everyone else has already mentioned it.", "Any minor issues/requests we had were dealt with immediately by staff who were always smiling and friendly. When we checked in about 3.30pm our room was still not ready. We were offered a welcome drink in the bar and after a while I politely asked if we could have a couple of complimentary beers while we waited. By then it was 4.30 though and the room was ready. Because they knew we were frustrated by the wait, when we got back to our room after dinner there were vouchers there for us to have a one hour Balinese massage each in their beautiful spa. Top marks for customer service! We were allowed a late checkout of 2pm free of charge as we had a midnight flight on our last day. After 2pm we relaxed at the beach and pool for a few hours and had a shower in their spa before heading into Bali Collection for dinner (and a 2 hour spa treatment – much cheaper than the hotel spa though maybe not as luxurious). They were more than happy to hold our luggage for us all day.", "Breakfast is amazing, the best we’ve ever had at a hotel. The choices are the same every day but there are SO many choices that you can have something different every single day. And so yummy! We ate in all 4 restaurants and also had room service, and enjoyed them all. We also had some great (and cheaper) meals at Bali Collection (20 min walk along the footpath on the beach).", "There was a release of newly hatched baby turtles on the hotel’s beach during our stay. The hotel is involved with turtle conservation and the guests can get involved.", "The best thing about staying in this resort area within Nusa Dua is the peace and quiet compared to Kuta/Legian. We took taxis in there for shopping and some meals but were always so glad to come home to Nusa Dua where it is clean and feels very safe. We paid about 110,000 rupiah for a taxi to Legian (30-40 mins). ", "We are already preparing to book again for next year :)\n", "\nThis hotel is more on the expensive side, but the hotel is great. Right on the beach and perfect rooms, spotlessly clean, large in size and many different facilities at the resort. ", "The drinks and food is a little pricey here, but if you have the money to stay there it shouldn't be an issue. I'm used to Kuta prices so it was a bit of a shock, but I soon discovered that the rest of Nusa Dua is the same.", "Very close to Bali collection if you want some restaurants or to do a little bit of shopping. Great for a weekend getaway and some relaxation time.\n", "\nLike all Nusa Dua hotel's it's not the \"real Bali\" and that's fine I've been there several times and didn't expect an authentic experience. But this place is SO out of date, rooms are old and in disrepair, had to room change 3 times until I got a room w/AC and where the room was functional. Concierge and Bell Staff tried to arrange transportation/trips for me that were SO much more expensive than they should be. They prey on the \"first timers\" to Bali don't be fooled! One of the worst things is the lack of Internet. They only have wired in the rooms and the cables don't work for newer computers. The only choice is the business center which is soo slow and what's worse they have \"free\" wireless in the lobby but it is so bad and the entire population of the hotel is huddled around it that it can take 40 minutes for an email to open! Only about 10% of the rooms are even sea view. The only things that are good is a great beach, breakfast and location. But everything else is frustrating. You can't even get a chair at the beach or pool unless you get up super early. Skip it, pay the extra money and stay somewhere else in Nusa or better yet Jinparan or Sanur.\n", "\nMy husband and I just returned from a five day stay stay at The Nusa Dua Beach Hotel. This was our first holiday without our three young children and we wanted to stay somewhere peaceful and luxurious. This Beach Hotel was perfect. Everything about our stay went smoothly. We stayed in a Garden View room with very close access to the beach and pool. Although the room was a little small it was always cleaned by lunchtime and suited us as a couple.", "The breakfast buffet had a wide selection of fresh food which was always abundant in supply. We managed to get a table looking out at the garden every morning and the service was excellent. We also ate at the Asian Bistro which was my husband's favourite meal during our stay.", "The hotel has free WiFi in the lobby. It was a little slow, however available if needed. I had one spa treatment which was very good but not the best I've ever had. ", "If you want to shop, the Bali Collection is close by. It only takes about 15 minutes to get there and its a nice beach walk. There is shuttle bus which runs hourly if you too tired or too hot to walk.", "If you like to shop, I'd recommend to wait until you go into Kuta as I found the prices more expensive in Nusa Dua. We took a cab from the hotel and although it takes 45 mins each way it was worth the trip out. We found it cheaper to return to Nusa Dua by cab, than leave, as the hotel will try to organise a cab service for you.", "All up, we certainly would return again and we would take our children to this hotel. If you like the beach, green gardens and a selection of restaurants and pools then this hotel would be a great option.\n", "\ngreat service.Lovely staff. Great pools.But! I cant accept there is no wifi in rooms in 2013.", "This a five 5 star hotel. You can get wifi in a One Star bungalow in the middle of the island .", "You need to do something about this.\n", "\nMy husband and I visited here on our honeymoon in 2011.", "We had a wonderful time. The hotel was stunning, really beautiful. The staff were wonderful and the breakfast and room service was excellent. ", "The room was large and comfortable. Very clean and well equipped. We had rose petals on bed and in the run bath upon arrival which was a nice touch. There was a huge bed with comfy pillows and a comfy mattress. The little touches are everywhere, like the turndown service would put a little mat, and a pair of Balinese slippers beside your bed every night, along with a bottle of water. Rooms were serviced everyday and the staff were very polite.", "There was a huge tv with lots of channels and choice. Good for those stormy nights in. ", "The grounds were beautiful and well maintained and the pool and the beach are clean and quite. It's a large resort so you offer feel like you are alone. However when you go to breakfast you are aware of how occupied the hotel is. ", "I had a wonderful stay, and found the hotel to be everything I wanted for a relaxing, romantic honeymoon. ", "We ate at the Italian restaurant beside the pool which although we found food to be okay, service and prices weren't great. ", "We used the shuttle bus or walked to the Bali collection most nights, when weather was calm (We had room service one night during a really heavy storm which we found well priced and delicious)", "The Bali collection is much cheaper for meals and drinks. We also found spa treatments to be much cheaper than in the hotel. I would recommend getting a manicure or a massage. I can't remember the name of the spa we used but shop about as prices vary quite a bit and we didn't go for the cheapest, we picked the one that looked most relaxing while still reasonable prices. ", "We ate and mai mai a few times. Really delicious Balinese food. ", "We also did a few excursions while in Bali. Elephant riding, cookery classes and a trip to ubud and surrounding villages which we booked through our tour guide which was provided through Thomas cook. However beware of telling the local taxi drivers your plans, as we were wrongly picked up and took on the wrong elephant trip, by a local taxi driver by unwittingly telling one of our plans the next day. This experience did leave a sour taste in my mouth but we were unaware until we returned to the hotel and our guide wanted to know why we weren't picked up.", "The island depends on tourists for their economy and its dog eat dog and when walking taxi drivers always stop and ask to take you where you are going. But they are far from rude or persistent and a swift no thank you moves them on. ", "There were lots of security check point about nusa dua, which are normal however as president Obama was due to stay in the hotel next to us the following week security was abnormally high but again not rude or intrusive and made me feel very safe. ", "We visited Kuta which we found to be busy, commercialised and grubby, lots of young surfers and party groups about.. Very glad we did not stay in this area. We experienced lots of the \"real\" Bali by taking tours and bought lots of local crafts from little villages rather than gift shops. We understand that the part of Bali we stayed is not the real Bali and rather idealistic, but as holiday makers rather than travellers, we found it beautiful, safe, luxurious and romantic. ", "Overall we had a wonderful trip and left with wonderful memories of Bali.\n", "\nThis hotel is right next to the westin hotel. U can walk to Westin and use their restaurant. We were lucky. We got upgraded. Huge living room and bedroom. Service was amazing. I will definitely go back there again.\n", "\nWe stayed here with my family(son and grand daughter). A very nice hotel, very friendly staff who provide excellent and warm service.I enjoy very much the beach. Great to be able to get food and drinks service on the beach. Lots of shady spots with cushioned beach lounges were available, great large clean beach towels. ", " The breakfast was excellent available from 06.30 till 10.30 AM, We loved the omelettes specially made to order with your own mixture.They also separate the pork contain food from the other. This breakfast leaves a similar type we had in the Flamingo Hilton Las Vegas. The choices in the four restaurants were quite impressive and good quality food.When my son ask for thinner blanket,the house keeper send him not one but three choises of blanket!. My grand daughter also enjoy Gecko Kid Club very much,she was very exiting when practice how to wear complete Balinese Cloth guided by very professional and friendly Club attendant\n", "\nThe resort is indeed a beautiful, 5-star hotel with very friendly Balinese employees, an activity desk, on the beach, an open air design, with an adequate gym and three pools, including a lap pool.", "We had a few issues that very well might be unique to my wife and I; you be the judge.", "1) The resort is very isolated in its own area with security checkpoints to enter the area and to enter the hotel grounds. We walked to Bali Collection (about 10 minutes), an outdoor mall with shops and restaurants – we eat there twice. There were few people at the mall and the shops mainly junk although there was a supermarket, so for any better shopping or nightlife a taxi at about $8 each way would be required to Kuta.", "2) Twice a week the hotel has folk music until 9 pm. We were tired the first night and wanted to get to sleep early but couldn't because the music reverberated throughout the whole hotel.", "3) About $15 for Wi-Fi that the hotel would not waive! They recognize this is a problem but they have a contract with a third party that has to run its course. (We paid $175 plus $20 for a room upgrade that included breakfast (excellent), service and taxes.)\n", "\nIt was our first time to stay in Nusa Dua and I don't think I will be back again. As other people say, the beach is beautiful and the room is very nice with a good view. But it is too big and commercialized to feel fully relaxed. I felt like I was staying in an amusement park. And you have to walk for 10 mins or so to get to any restaurants or stores outside the hotels. It would be a good choice if you would like to stay in a large-scale hotel with a lot of other guests with very limited interaction (or negotiation) with local people. But if you prefer a peaceful and quiet hotel with welcoming staff for your relaxing vacation, this hotel may not be your best choice. The beach was great but the experience here overall wasn't really what I wanted for my vacation.\n", "\nI really love stay in this hotel. Specially because we stay at room type deluxe for 4, the room so comfortable. I stay there with my husband, my mother and 3 kids.", "my kids really like the pool and the beach so clean and the breakfast also yummy", "we likw to stay here again\n", "\nI will add to this later but wanted to share with people. The wired internet works fine and they provide a cable. Wireless works basically only in lobby.", "The food and drinks are expensive. Catch the free shuttle bus to the Bali-Connection and stock up in the markets (there are 3 but the prices are the same); only one has wine/spirits. If you miss the bus, the walk is short.\n", "\nThis is the second time we have stayed in this hotel and we just as good as the first and possibly even better. There was a seafood BBQ on the beach with fire dancers which was reasonably priced and certainly no shortage of food. The restaurant staff are very friendly and we remembered them from our previous stay as many of the staff have worked at this hotel for a many years. The facilities at this hotel are fantastic, particularly with the pool in the spa area being a quiet zone where kids are not allowed. We have booked a third stay again in a couple months time and can't wait to stay again. The only negative is there is no WiFi in the room but it is very comfortable in the lobby bar where free WiFi is available and enjoy a cocktail or two.\n", "\nAs repeat guests of the Nusa Dua Beach Hotel (10 visits since 2002, together with our best friend couple) we would like to recommend Palace Wing accomodation especially because of an outstandig qualitiy of service by all staff members under the leadership of Mr I Gusti Made Sunada. Professionalism, helpfulness, friendliness and attentiveness of the Palace Wing Crew cannot be topped anywhere else.", "All rating categories referring to the room respective suite can be marked excellent. ", "Our average rating of the Spa does not at all refer to the Spa staff. All the therapists do an excellent job but the quality of the Spa facilities could be improved.", "To praise the environment, the Balinese architecture of the hotel lobby, restaurants, rooms and overall garden & pool & beach landscape would mean bringing coals to Newcastle.", "So many thanks for another unforgettable holiday.", "Klaus and Beate B.\n", "\nWe attended a wedding in July 2013. It was absolutely beautifully. Everything was perfect, highly recommend.", "The hotel it self was very nice. It was quite and clean. But, wifi was bad, very slow. Breakfast was excellent. For the rest was ok. I found they over cooked the sea food. Also it cost about 100,000 rp every time to wants to cross to the other side os island. Apart from this we had a greatb 8 day stay.\n", "\n3 nights in Nusa Dua Beach Hotel was not enough! The room was great, the breakfast was awesome and the environment was the best! A nice quite yet breezy day we spent the afternoon laying on the beach and on the evening there's nothing better than swimming on the pool. Luckily, during my stay they were about to release turtles to the sea. There were hundreds of them which proves that they're concern of the nature and it was an awesome and fun experience. The experience we had there will never be forgotten! And by the way, good facilities also includes awesome kids club; Gecko. Kids will never be bored there. They have awesome schedule and parents wouldn't need to worry a bit! Even if you would like to leave your kids over lunch or dinner, they're ready to help you out! So yes, it's a worth place to go again! :)\n", "\nMy wife and I chose to spend our holiday here and stayed for 11 nights in a Club access room. We made our reservation via the hotel website and had a quick response email confirming our booking. On arrival at Denpasar we had expected to be collected by the hotel as this was part of the online booking deal but although we had supplied our flight details the pick-up did not happen. In the end it was not really an issue as we had no problem hiring a taxi and the cost was minimal.", "On arrival we were met and greeted by staff and taken to the Palace Club where check-in was swift and trouble free. As our flight arrived at 6.30am we were concerned that we might not get access to our room until the official check-in time of 3.00pm, but as the hotel was not heavily booked staff had, without being asked, assigned us a room straight away; very much appreciated.", "Our room was clean and reasonably spacious and looked out onto a beautiful garden setting. Because we had booked a Club room we had access to the Palace Club where we had breakfast daily and drinks with canapés every evening. I have to say that the service here was exceptional and unlike most 'clubs' there was table service although for cereals, fruit etc. you could serve yourself. Staff were extremely attentive and always remembered your name, a really nice touch.", "We ate at most of the hotel restaurants which were much as you would expect at a resort hotel, a bit expensive and the food fairly bland. The exception was Raja's where we had two extremely nice meals with dishes that gave the taste buds a bit of a treat.", "The Hotel grounds are beautiful and are home to many birds, lots of squirrels a few very large lizards and the beach is a nesting area for sea turtles. During our visit we witnessed and took part in two releases of baby turtles, the first relocated from Kuta beach and the second from a nest on the hotels beachfront.", "We can thoroughly recommend staying here and will certainly do so next time we visit Bali.\n", "\nTwo weeks spent in this amazing hotel, filled with friendly trustworthy and social staff . I'm seventeen years old (female) and this hotel is fit for all ages , I would like to start off with the fitness centre although many of you come for relaxation if you are coming with your children in the centre it has a variety of activities such as : tennis , squash , bicycles , gym ,spa and a swimming pool etc - The staff in this centre are incredible , in the gym I had a staff member personally train me and motivate and encourage me to keep going , also before you go into the gym they show you how each machine works. Buffet breakfast is what everybody tends to enjoy a lot in the mornings which ends at 10:30 giving you plenty of time for a sleep in , a variety of different foods from pastries to eggs and bacon to rice dishes.The small restaurants around the pools are fast serving, delicious and at a great price. Also this hotel is very close to Bali collection which has a shuttle bus to take you there for free every half hour to an hour which contains numerous restaurants and markets.overall the hotel is beautiful.\n", "\nI forgot to review this hotel last year when I spent four days Lebaran holiday break in Bali. The room we have ordered was premier I think but some how it got upgraded to Deluxe for three by the Hotel Manager. He was so nice and very friendly. ", "The hotel is very cozy and locates beside Westin hotel. The breakfast was good and the swimming pool was also good.", "I had nothing to complaint for Nusa Dua Beach Hotel. :)\n", "\nHaving a week stayed in here! A traditional property room designed comes with modern F & B outlets by the pool or beach.", "Those the property been about 30 years but it still well maintained. People are friendly and serves with a warm heart especially the housekeeping team. ", "Good breakfast spread in the Jahe and felt good just next to the water feature by just hearing the running water. ", "Make sure get up early just for the sunrise at 6.30am. A glass of free refreshing juice next to the beach and enjoy the warm from the sun.", "Don't missed the morning bicycle tour which happened twice a week only. A great fitness guide \"Awan\" bring us thru' the whole Nusa morning bike ride! He even share with us the local ceremony culture and the must visit place \"Water Flow\"! Well done!", "My room was designed with Kamasan painted and took a little times to adaptor into get a good sleep. But the room is clean; full toiletries and good bath & facilities.", "Overall; a great experience! You are surely don't feel bored to spent a week here!\n", "\nWe stayed for 7 days, was recommended to us by friends who have stayed there many times. A beautiful hotel, very friendly staff who provide excellent and polite service, nothing we asked was too much for them. Brilliant how they have an inviting desk with visitors chairs set aside for Client Relations adjacent to the reception area. The breakfast smorgasbord that was included in the accommodation price was awesome and available from 06.30 till 10.30 AM, loved the omelettes specially made to order while you watch. This breakfast leaves a similar type we had in the Crown Casino in Perth Western Australia for dead. The choices in the four restaurants were quite impressive and good quality food. The free shuttle bus (5 mins) to and from the local shopping centre called Bali Collection was good, the supermarket there was useful and we also enjoyed a cheaper alternative to 5 star hotel meals. We had some massages that were excellent, room service when asked for was perfect. Great to be able to get food and drinks service on the beach. Lots of shady spots with cushioned beach lounges were available, great large clean beach towels. The only less than perfect thing was that the Wi-Fi was only available in the lobby area and was often slow or hard to get going. The minor noise during the day that you could hear coming from construction activities on the new resort being built next door did not bother us at all.\n", "\nGood hotel, with an outstanding beachfront and great pools. Is connected with the rest of Nusa Dua hotels by a walking track along the beachfront. Good food, suiting a vegetarian Indian palate - the chef customised food for us too. Slightly dated property but very much in sync with the Balinese ethos.\n", "\nStayed here in June 2013 while attending the Coaltrans conference. Haven't stayed here since 2005. ", "Sprawling hotel complex right on the beach at Nusa Dua. Easy walk along beach path to the neighbouring Westin where the conference is hosted. A bit surreal, to walk in a suit along a Beach path on a tropical paradise in Bali.", "I felt the room was looking a bit tired and could do with an upgrade or refurbishment. Because the property is so huge can take you 10 minutes to walk to your room from reception, therefore not a joke when your key card doesn't work and you have to trek back to reception (happened more than once - a day)", "Breakfast area and content is excellent, otherwise restarauint notices are a bit lacking. Wireless Internet access in the room was terrible, probably because of the sprawling nature of the complex, but still strange this hasn't been addressed given the hotels proximity to the conference centre and volume of business travelers and conference attendees.", "Nice escape from the madness of the conference hotel, yet only max 10 minute walk.", "Generally good hotel, probably would stay here again, but value for money could be seriously enhanced with a few small adjustments by management that would not cost much, such as Internet access. Rooms well overdue a facelift. I know they have a captive market with the coal conference, but given the fact that I had staff in 10 rooms for at least 5 nights each, I felt we got no better treatment, service or attention than someone that a last minute arrival would have.", "When I stayed here in 2005 I was highly impressed, less so the time.\n", "\nStayed 10 nights in early June/July this year.fantastic experience overall.have nothing but praise for very professional and friendly staff and management.very comfortable and well equipped bedrooms. Enjoyed the food and beverages.great swimming pool and and beach.was amazed when I got to view the baby turtles entering the sea for the first time.cant wait to return !!\n", "\nBusiness trip for a convention at the Westin right next door. Very happy I did not stay there as it seems the Westin is the host to all of the business conventions and is always loud and busy verses the surrounding hotels.", "This hotel was suited 100% to relaxing in the sun as a couple or in small groups. Even though there were nightly activities going on right next door, the Nusa Dua was far quieter and far more quaint.", "Rooms were nice but not the cleanest I have seen. Not particularly modern either, but with right room you can have a great view.", "Food at the various restaurants was good, I enjoyed the morning buffet the most.\n", "\nWhile there are many other hotels around competing for their quality, Nusa Dua Beach Hotel is going to opposite direction. It's becoming an average experience with their new GM this 2013. He's trying to cut costs in every aspects and so quality is almost forgotten.", "Not worth the $ you spend for at the end.\n", "\nWe stayed in this HUGE resort with 3 kids in an adjoining room. The resort has spectacular gardens and fountains. Great swimming pools and a private beach. Many restaurants to choose from. The breakfast buffet is fantastic. The rooms were a bit small and bathroom was just ok. There is a great spa. The facilities and the fantastic staff made it worthwhile. We would come back.\n", "\nThis was my first stay at the Nusa Dua Beach Hotel , we stayed in a Palace Club room, which I have to say is worth the extra cost.", "First the room, very spacious with a modern spacious bathroom, the bed was high quality and very comfortable, there is a good size flat screen TV with a wide variety of international channels and free movies. There is a good size balcony, with comfortable chairs, we face a lovely Balinese garden complete with ducks, unfortunately a old cigarette butt had been left uncleared on the balcony which was not good.", "The pools are good, however the sun lounges are quite dated old plastic ones and look due for replacement.", "The beach is private, however you are still annoyed by hawkers selling items, there are ample sun lounges near the beach. Sadly the beach is blighted by plastic garbage like most Bali beaches , although the cleaners rake up the bags, bottles, and other rubbish ,the next day more just washers up from the ocean, the cleaners bury the garbage in the sand, not ideal, the main solution is too stop garbage getting into the ocean.", "The Palace Club rooms represent good value, the private breakfast is ideal, as the buffet seemed very busy, the variety of food is excellent. Afternoon Tea is served , is OK but consists of only Western food, I suggest some Asian savoury dishes be available as well. Perhaps some rice , spring rolls or samosa, the sausage rolls were delicious though.", "evening cocktails start at 5.30pm , great selection of drinks, and hors dervs are substantial, it was a treat to get an invite to the managers party one night.", "I would expect that Palace Rooms should include free airport transfers but is not available this is included in most elite resorts , so really should be included here.", "the hotel give you so called Nusa Dua money, which is very annoying to use, we did not present ours to a hotel restaurant for the discount at the time, so were refused to use them later on when we asked the cashier in the palace club room, this should be easier to work out.", "There are numerous restaurants in the area and they will all pick you up from the hotel and drop you home.", "We enjoyed the baby turtle release and the hotel is to be commended for its turtle work, some more green efforts would be removing plastic water bottles from sale and using only glass.", "would recommend this resort and the palace club rooms.\n", "\nThis is our second trip to Bali,My husband, myself and 3 boys,We had a great time relaxing in the serenity of the resort,It offers the total feel of walking into comfort fresh open lobbies and", "wonderful rooms with direct pool excess or sea views,The service and food at the hotel were very good, as was the spa. I really enjoyed the special dinner buffets with the local cultural,Breakfast and overall food quality was exemplary. In particular the coffee was excellent.A great place to relax and splash out on that luxurious touch. We would recommend to others\n", "\nWe stayed in Nusa Dua after first scuba diving in Permuteran and then having a few days in Ubud, thereby seeing the \"real \" Bali, so when we arrived at the Nusa Dua hotel we were a bit taken aback at first by it being such a huge \"touristy \" resort ( beautiful decor ) We had booked a Deluxe family room with interleading rooms but they upgraded us to a triple room , at no extra cost, as they must have made a mistake with assigning rooms. This meant my teenage son could have his own bed and bathroom instead of having to share a king size bed with his sister, so we were all very happy with this.The food prices were a bit higher than we had expected ( but probably to be expected at a five star hotel and with our poor exchange rate ) so we went into town most nights for dinners but the one night we went to the seafood buffet and fire dance at the hotel and it was excellent ! The breakfasts were amazing ! The hotel sent a lovely bouquet of flowers to my room on my birthday and when my son was sick with Dengue fever for our last few days there, the hotel sent fruit and flowers to his room as well. It was very convenient that there is a clinic at the hotel which meant he could have his blood drawn there and the results were ready within a couple of hours. I think if you want to have the real, cultural, Bali experience you should go to other areas of Bali as well, but Nusa Dua was very relaxing and also a very great part of our holiday. It was also a good base to go and explore areas like Kuta, Uluwatu, Jimbaran beach etc as they are all just 20 - 40 mins drive from there.\n", "\nJust arrived home after a great week at this resort. I have been very fortunate to have been to this resort a few times, and I still love it.", "It has absolutely every thing you need for a perfect holiday. We stayed in the palace club suite which is gorgeous, but the whole resort is outstanding.", "At the palace club you truly are made to feel like royalty. The breakfast, drinks, afternoon tea and cocktails are great.", "Special mention must be made to Supadmi and Suniah who were outstanding, the other staff were also attentive and professional in all aspects.", "There are so many resorts in nusa dua but this stands out because it looks more Balinese and its not full off kids.", "Because of the sheer size of this hotel there are so many places to hide if you want peace and quite.", "My only suggestion would be more variety in the cocktail food. Even a nice cheese with bread or crackers would be a nice inclusion.", "They have a different theme each evening but they didn't have a sauce with them so they were a bit dry. Especially the Indian night.", "Wi fi should also be addressed as you could only access it in the club lounge ( not in your room) which is sometimes annoying.", "Overall this resort is almost faultless. ( this would be our 54th trip to Bali so I have been to many resorts).", "Well done guys, we will be back.\n", "\nWe went as a family to this hotel and even though we had read the reviews we were still amazed with everythimg about the hotel. The people are very hospitable and the overall design of the hotel is breath taking as it incooperates so much of the nautral environment into it architecture. The spa area is a definite must-go-to\n", "\nWe stayed here 4 years ago and loved it so much we booked in again - (2 adults and 2 teenagers) for 5 nights in a Deluxe room for 4. The interconnecting rooms are great as we feel we have plenty of space and privacy. The rooms aren't the biggest or newest but everyone was happy. The price for the Deluxe room for 4 is so reasonable and well worth it.", "Nusa Dua is very peaceful and a great place to just unwind and relax. The beach is lovely as the trees are growing in the sand and beautiful to sit under. The Bali collection shopping centre is a 10 minute walk (or 2 minutes in free shuttle) with supermarket, pharmacy, department store, massage etc so you can get anything you need without any hassle. We actually had some really nice cheap Balinese food there too. It is nothing like Seminyak or Kuta/Legian so if you are looking for loads of shopping, restaurants or party time its probably not the place for you. ", "We requested the same rooms as our previous visit which overlooked the pool and beach. They accommodated our request and we were so happy with the rooms. Thankyou so much!", "The hotel is older than most but we actually love that about it. It has beautiful established gardens and lots of Balinese character. The pools are large and there are a number of options. Tennis courts are a bonus and we loved having use of them.", "The staff are lovely and so friendly - always very accommodating We met Youdana 4 years ago and he remembered us and looked after us so well at the Chess Bar. We hope to get back to the hotel before he retires in 2015.", "We enjoyed the breakfast as plenty of choice so you can have a different style breakfast everyday.", "We were lucky enough to be there when some turtles hatched and we were able to be involved in their release on the beach. Turtles have laid there eggs on the beach and the hotel protects them until they hatch. Very special!", "Only criticism was the access to Wifi. Only free in the lobby. To use in your room you had to pay for it but the reception was hopeless and kept dropping out. Very frustrating when trying to do some work!", "Would love to go back again.\n", "\nThis place was honestly amazing. We stayed for 5 Nights in May 2011 for my brothers wedding and it was just perfect, the wedding was beautiful, the rooms were incredible balinese style and the views everywhere were amazing. They offered a very professional Babysitter for my baby neice during the wedding and the general customer service was great. Breakfast was ridiculously good! Friends of ours got married here in May 2013 and also had nothing but great feedback.\n", "\nMy husband and I just celebrated out wedding anniversary at the kayumanis private villas and spa and cannot praise the staff, the accomadation and the location enough. We both felt like VIP guests as our every need was catered for. Our villa was beyond our expectations and afforded us great privacy and ample space. The staff could were so helpful and friendly which enabled us to totally relax. The resort provides transportation to and from the local area and always readily available when required. The food was excellent and we felt that we got great value for money. We enjoyed an afternoon in the spa which again went above and beyond our expectations. The resort is nestled between many other 5 star resorts which we visited when we wanted more variety. We hope some day to return as this was our first but not our last holiday in Bali.\n", "\nStayed here for a week for a conference which was being held next door at the Westin. First off it is US$100 a night cheaper than the Westin and has much more character. The rooms are older but they are spacious and all have balconies with a view. The gardens are expansive and the pool areas are great. Find the large lap pool at the back of the Spa area near the tennis courts - no kids under 12 allowed and basically the pool area is empty 90% of the time. There are a number of great restaurants from casual to fine dining and there are great local restaurants outside of the resort complex. This is a very nice Hotel, less busy than many in the Nusa Dua Resort Area and is very reasonably priced for a 5 star hotel. Breakfast is included in the rate.\n", "\nBali may have many great hotels and this one is particularly great with good private beach, great restaurant and nice swimmingpool. I particularly like the services, staffs are friendly. If you like spa, this hotel has one of the best spa in Bali and has been top rated several times.\n", "\nI was there 5 years ago spending my honeymoon.", "Perfect atmosphere, food, room, hotel's garden, beach, attention... I'm looking forward to come back and celebrate our anniversary", "What's a pity it's so far away from here.\n", "\nWe stayed at this hotel because the Westin (next door) was fully booked, and I'm really glad it was, because we had a great time. The room, the food, the spa, the sport facilities, the ambience were excellent. This is the only hotel I've seen that actually has some genuine 'bali feel'. There's also a sort of traditional amphitheatre with weekly balinese dance performances (and a delicious buffet). The only negatIve point was the internet: no free wi-fi in the rooms and the connection in the lobby (where there's free wi fi) was terrible. The member's lounge wi-fi was no better.", "Apart from this, it was a great choice and we'll definitely return.\n", "\nWe have stayed here 4 times (most recently in May) and each time the service has been amazing. Warm and friendly with excellent facilities. Two large pools, beachfront and a wide range of Restaurants on the premises and nearby. We stayed in a standard room and thought it was well fitted out. Love to stay again in this area and at this hotel.\n", "\nThis hotel is our second home no other resort gives to it guest as much as nusa dua beach does", "This resort has the total package for the most relaxing holiday , palace club facilities our out standing if you haven't tried it do it ,such a friendly and welcoming management chefs and staff", "We have never experienced such warmth any were in the world can't wait to return\n", "\nI travel to Bali last March ~~~", "Bali ~ Island of thousand Temple Nusa Dua Beach Hotel and Spa located outside city area which need to pass through 2 security check point to ensure tourist had a safe stay at Bali. One check point through general tourist area and another Nusa Dua Beach Hotel & Spa check point. As is located a distance between the city is best to just stay in the hotel and enjoy all the felicities the hotel had to offer. Although the price is abit higher then the city center can offer but it worth it. Nusa Dua had their own private beach which is very spacey and well maintain. During my travel to Bali I had only come across one public beach in Bali which crowded with alot of people local and tourist. Therefore for me it is good to have a private beach from the hotel. The room are will decorated suitable for couple. The toilet and bedroom had a window that are mean to be opened haha ~~~~ But during my stay I actually had to pay separately for my WIfi connection that is something I dont understand after all customer had paid premium price for the stay and the wifi felicities is there why don't they just allow the customer to use it lolz. Overall I had a pleasant stay just hope it dont rain to enjoy their beach.\n", "\nMy wife and I stayed here for 6 nights in June 2013. There is a lot to like about the hotel- beautiful gardens, clean swimming pools, friendly staff, our room was serviced twice a day which was fantastic.", "The down side was mosquitos in the room, only having free wifi access in the lobby, expensive food and drink at the hotel, expensive hotel transport. On our first night we wanted to get transport to a local restaurant for dinner. The hotel charged us 80,000 rupiah for a 3 minute drive. We caught a metered taxi back for just under 20000 rupiah. The hotel transport was 4 times as much! I was very disappointed by this as talking to other people staying there they were offered a reduced price when they complained. From then on I had to insist for a metered taxi for transport, as the hotel staff kept pushing for us to use their transport. The hotel is some distance from shops and restaurants, but it is worth travelling for the cheaper restaurants.", "A great tip is most of the local restaurants will transport you to and from their restaurant for free, you just need to call them. Laguna Garden restaurant in Nusa Dua is great, excellent food and value and free transport.\n", "\nStaff were helpful and friendly. Could not fault the breakfast buffet. Great seafood barbeque in the evening. Our friendly barman in the pool bar produced amazing mango and lychee mojito's :)", "Short walking distance to Bali Connection for dinners or lunch and reasonable souvenir shopping. Had the pleasure of using the spa facilities, fantastic. Most enjoyable time spent with friends.\n", "\nLove the hotel, beach is clean and peaceful, staff are friendly, room service is good. Pool is awesome especially Kid's pool. I was expecting bigger room and found few mosquito. If I visit Bali again will prefer to stay here again.\n", "\nWe stayed at the hotel for our honeymoon, my husband and I, and it was one of the best experiences ever. The hotel is gorgeous in its architecture, the staff are very friendly and helpful, the food is amazing (From Wedang Jahe to the Asian Bistro). Our room was neat and well equipped, we had complimentary champagne on our first night. The whole mood of the place is surreal and pleasant.", "Wifi is only available at the lobby which was perfectly okay for us since we didn't want to be distracted by technology :) ", "The spa is an experience on its own. We visited the spa for a massage session and facial, the staff are very good at what they do, they're always smiling and willing to offer their assistance when needed. We enjoyed a dip in the spa's private pool (which stays open till 10:00pm!), the atmosphere was calm and serene.", "I recommend this hotel to anyone visiting Bali and will definitely come back!\n", "\nWife and I stayed here and it was excellent. The breakfast buffet was amazing. Fresh local fruits, pastries, omelets cooked to your specs, open dining area. Seriously would go for breakfast anytime I am in Bali. The pool was great but do not recommend swimming in the ocean. This section of beach gets lots of seaweed etc washing up. Hotel does good job of cleaning up but still. Room was top notch. Note though that this is a resort and not near any real shopping or dining accomodations outside of the complex. There is a tiny street area about 1/2 mile away that had a couple restaurants and a couple shops but nothing much. Best to get a driver to go into town or sightsee. Had fun walking home from restaurant one night, the sidewalks were covered with snails, big ones. In the dark it was impossible to avoid stepping on them and having them pop like light bulbs. Still this hotel was very good. Great staff and accomodations.\n", "\nMy big family (all 20 of us) came on Friday afternoon. The cold towels that were provided when we checked in were great. The facilities were clean and very resort-feeling. We all got standard room, I think. I like that fact that it has a small veranda. But I don't like the tiles in the bathroom and there's no bathtub. The bed and pillows were comfortable, though. ", "Breakfast were fabulous. Love the artisanal bread. It was crispy on the outside but soft inside. The automatic coffee maker was even better. You can make yourself a cup of cappuccino or latte, you name it, just by a touch!! Amazing! ", "The beach was clean and the plants were well-tended. We had late lunch in one of the restaurants. The baramundi and the burgers were excellent. The sausage was gamey though.", "On our third day, we need a room for family talk, and they gave the meeting room free of charge!", "Overall, it was a nice resort with great service.\n", "\nMy partner and I stayed at this beautiful resort from 7 to 16 June 2013. This resort definately has the WOW factor.", "We arrived late in the evening and was greeted by the reception staff with a cold towel to refresh ourselves and a glass of juice. Checkin was speedy and was given lots of information about the resort.", "We were shown to our room. Outstanding. Clean, spacious, modern, with safe, coffee facilities, bar fridge, nice big bathroom.", "There is a good Kids Club at the Resort. Full of acitivies for the children.", "Pools. There are two huge pools, especially designed for families and young children in mind. Children can play in pool/lagoon area and have lots of fun. There is also plenty of chairs to relax in. One pool has a swim out bar - excellent cocktails can be had here. ", "Restaurants. There are a number of restaurants in the complex. The buffet breakfast is outstanding. The location is simply beautiful and relaxing.", "If you do not want to eat in the resort, you can catch a taxi 5 mins away is the Bali Connection. This is full of restaurants - cheap cheap, lots of shopping, spa treatment shops, money exchange booths, entertainment. Just beautiful to stroll through the complex.", "Staff: We have to say, the staff were fantastic. Kind and caring, always want to please their guests to make your holiday memorable. The management should be very proud of their outstanding and very happy staff.", "The Resort: Absolutely beautiful - breathtaking. Clean private beaches. True Balinese feel. The most beautiful kept gardens to stroll around, there is a great walking path/cycle path along the beach, that will take you to all the other resorts in Nusa Dua. Well worth the walk, especially at night. They do have a free shuttle service on the hour to go to Bali Connection. They also have a tour desk there, if you wish to book tours with them. You can take a taxi ride into Kuta (main shopping complex), short taxi ride of 40 mins or so. Cheap! Great to explore Kuta, but we found it noisy and a bit dirty and was glad to come back to our beautiful Nusa Dua Resort.", "Wi-Fi - Unfortantely Wi-Fi is only available in the Lobby/Reception for FREE. If you want to use it in your room or around the resort, you have to pay for it. We felt for a 5 star hotel and the $10 million dollar or so upgrade, that surely Wi-Fi, should be FREE throughout the Resort.", "That is my only negative thing about the resort. It such ashame, when you see guests all huddled in the reception area, checking their free Wi-Fi emails/facebook/etc. ", "We would highly recommend this resort. We have already recommended it to work colleagues and family alike. ", "Enjoy BALI!!\n", "\nHad a wonderful stay at Nusa Dua Beach over Easter and couldn't speak more highly of it. The hotel is a great balance of resort retreat and family friendly. You have the opportunity to hide away in a secluded paradise or be social with other guests and enjoy the many and varied activities available. Our room was clean and well appointed, staff were all wonderful, cocktails at the pool bar were sublime. Will definitely be returning!\n", "\nStayed for 3 days at this grand hotel...From the room to the pool to the breakfast, everything was perfect...stayed at the deluxe garden view room...the room was clean, the bed was extremely comfortable (me & my husband literally wanted to steal the pillows), washroom was small but comfortable. The only thing that put me off was that the balcony was a bit dirty so we did not feel like utilizing it...breakfast was amazing with sausages, hash browns, waffles, pancakes, eggs, assorted bread etc..pool was warm and huge.I give two thumbs up to this hotel...\n", "\nWould highly recommend this resort but stay away from the oysters!Short walk away from a shopping centre along the beach and would recommend the \"sensibly\" priced beach food vendors. Avoid walking to the old resort after dark.....beware of the bats!\n", "\nEverything you could want in a hotel, right on the beach, two very large swimming pools, bars, restaurants, spa and gym, rooms to cater for everyone. We will definitely be returning to the hotel, Nusa Dua is a wonderful area and a cheap cab ride from Kuta beach.\n", "\nHad a lovely stay in this beautiful resort with 3 friends in a room for 4 people which is basically 2 adjoining rooms but much better value than booking 2 separate rooms. Nothing negative to say whatsoever. Beautiful grounds, pool, beach and great buffet breakfast too. Apart from the included breaky only had a couple of meals in the hotel (which were very nice) but prices higher than eating out at Tanjung Benoa or Bali Collection. Would highly recommend and cost of accomodation was quite reasonable for Nusa Dua.\n", "\nStep in the legendary hotel of Nusa Dua Beach Hotel & Spa Bali early of May 2013 and i found this hotel are still doing great, clean and refurbished room. I stay there for 2 days only and unable to explore all facilities yet hence i fell in general are good.", "- Process Check in is fast, helpful and no need to wait:-)", "- Room is spacious, clean and unique with balcony", "- F&B is good, i try some cocktail and meals are fulfill my taste", "- Access to the beach is easy and good to do relaxing", "- Last but not least is Staff friendliness is GREAT.\n", "\nWe stayed here in Jan 2013 for a week and what a week we had it was wonderful.......we booked into the club rooms and we were not disappointed. Our room was on the ground floor, open the balcony door and a large patio awaits looking unto a perfected manicured lawn with several ponds full of fish ......the grounds are beautiful and tended to on a high standard......we were invited to a VIP cocktail evening in one of the suits ...... the drinks and canapes were divine as we watched the sun setting on the ocean waves.......breakfast, afternoon high tea, cocktails & canapes were served at the club lounge out on the patio each day/evening (four rooms down from our room) which was excellent. ", "The friendliness and service of the staff is second to none, everyone was so attentive and helpful.....I had some spa treatments which were heaven thats the only way one could describe them . ", "The hotel is set on a beautiful beach with lots of sun loungers and chairs , the beach is spotless with beautiful white sand........The Nusa Dua Beach Hotel is like being in paradise on the Beautiful Island of Bali........We hope to return there again one day soon.\n", "\nOverall my trip was good.The hotel had nice food, a nice pool, good service-everything a hotel should have-but, unfortunately the Bali Sea was in very bad condition.There are some workers who clean up whatever is washed on shore.But i recommend not swimming. But the hotel was at a very high standard. And over looking the sea i would recommend relaxing in these tropical views.\n", "\nWe have just returned from our family holiday at this hotel. We were very impressed with the look of this hotel as it looks like a Balinese temple at the entrance. The staff were lovely and very friendly especially to our 4 year Old son.the room we had was satisfactory and clean. Very close to the breakfast restaurant and the pool area.there are some great pools and the children's pool was our favourite as our son could play in it safely. There are also plenty of beach chairs around to accommodate all the guest. The beach was also clean and with plenty Bach chairs.the hotel complex is very large with shops, restaurants and day spa.there is also a kids club but it was mainly empty so no insentive to sent our child there.overall good facilities but...", "This hotel caters mainly to the corporate client and big functions and holiday makers have to endure the big dinners and entertainment that goes with that. On our last night at this resort we had to listen to thumping music until 11 pm.that is all great if you are part of the party but not so great if you try and get a 4 year old to sleep.the other negative is that this resort the prices on food and beverages is very high.the cost for a local beer was 64000 rupiah and a simple hamburger 160.000.that's ridiculous.we felt that we needed to go out all the time to eat somewhere cheaper. There are some good restaurants at the collection shopping centre which nearby. There is a bus that takes you there for free however not that reliable. Better of getting a metre taxi for 15000.we liked the resort but we would probably not stay here again.\n", "\nOverall the hotel was average. The gardens were well maintained, the pools were stunning and the staff were very nice. The breakfast buffet was also really good. The room was a bit disappointing, the bed was very uncomfortable and the pillows smelt really bad. The outside balcony is not well designed, as soon as it rains you have to go back inside as the chairs get wet. I also would have expected better food at a resort of this calibre (at the restaurants) - it was nice but very average. I was very surprised to find out that there was no free wifi in the room (which most hotels have now), and we could not make use of the free wifi in the lobby on the 5 occasions we went there to check email and do some banking. It was nice but I wouldn't go back here.\n", "\nI booked the premier room for 2 nights for a trip with my partner. This was the first time we stay in Nusa Dua area, so I was very excited to experiencing this hotel.", "We were given the corner room so it was bigger than the ordinary room. Overall, the room is very well equipped with all amenities. However, once we checked in, I found that there were a dirt and stain in the bed linen. I asked the hotel to clean my room again. Once I came back from a dinner, the hotel's staff had changed the bed cover. I can still spot dust at few corners of my room.", "The hotel's facilities were nice. The swimming pools are quite large and clean. It has a fantastic garden where squirrels are playing around everywhere.", "One thing that I wish to highlight from this hotels is the service standard does not meet a 5 stars hotel that I expected. While most of the hotel staff are friendly and attentive, I experienced some unpleasant situations: 1) at the time we arrived, nobody took initiative to take out our luggage from our car, I even need to asked for a valet parking before a hotel officer came to take my car; 2) when having our breakfast, nobody offered us with tea or coffee like a normal 5 stars will do, but I noticed that the waiters were serving other foreign guests; and 3) at the day we checked-out, at 12.10 PM, a hotel staff knocked our door while we were still packing and said \"Why you haven't leave yet, sir?\" I was very disappointed, I knew that we should check out at 12 PM, but it is very rude to said like that to guests, come on it only 10 minutes past the suggested check out time and the hotel was not crowded at that time. I noticed that some hotel staffs were more attentive and friendly to foreign guests than to local guests, please turn this mindset away, as the hotel guests there is no difference between local and foreigner as we deserved to have the same service.\n", "\nThe hotel looks very promising and manicured but in reality a lot is missing. It’s an old property so the rooms need better attention. The staff is old and some of them are rude and do not even greet the guests. As a result we had to leave the room instantly and when we stepped out it was even worse. We left the hotel and were feeling quite sick for the next hour.", "While resting around the pool areas, beach or restaurants at the hotel, unknown strangers and outsiders would approach us and try to sell trips and package tours to us as if we were staying in public beach.\n", "\nJust returned from 2 weeks at the Nusa Dua Beach . We had stayed there nine years ago and enjoyed it then , we were not disappointed this time . The rooms are of a good standard , the staff are very helpful , and the location is in our opinion the best in Nusa Dua . The pool staff were very good and worked very hard , in fact the hotel could probably do with a few more staff at the pool area . No wifi available way from the lobby area. Overall a solid 8/10.\n", "\nThere is simply nothing negative we can say about the Nusa Dua Beach Hotel and Spa. I stayed with my wife and two children (5 & 8) and found the atmosphere, service, food and amenities to be excellent. We were made to feel relaxed and happy at all times.", "The are 2 pools to choose from and one in particular suits the children perfectly. There are five excellent choices to dine and the outlook from the beach is very romantic if that is what you are after.", "We originally stayed in the adjoining Deluxe room which suited our needs well as we were rarely there. Upon raising a concern on the entertainment noise at night time with the Manager, Mr Saronca, we were relocated to a Palace room which was an unexpected but most appreciated. It was, again, another example of the commitment of the hotels staff to ensure their guests are happy.", "We are planning another holiday to Bali in Late December and I can say with 100% confidence that we will be staying back at the Nusa Dua Beach Hotel and Spa and will be recommending it to all we speak to.\n", "\nI stayed here for 4 days with my mum we stayed in the palace club suite with club privileges we couldn't have stayed at a better place it was beautiful, chief was great he remembered my order every morning, nona anik werni and putra were lovely staff all staff was amazing, highly reccomend.\n", "\nWe received hotel offers to use Santi Lounge for our meeting on November 2012, however we were not really satified towards the meeting room because it seems the room originally not built for a purpose of meeting arrangement. On the other side the accommodation room and and its facility in the room condition OK. Breakfast and lunch and or dinner set up were OK. The most important thing we like to stay here is becase it is just a few walks away from the Bali International Convention Center. But most of the hotel staffs are very friendly and did their best to serves our group. Their spa worth to try.\n", "\nWe booked this hotel for 9 days and had the most wonderful time, by the pool and beach. The facilities were great and the staff could not have been more helpful.", "The beach was cleaned everyday and the weather was perfect.", "I was close to plenty of resteraunts so you can eat in the hotel resteraunts or go out.", "The hotel resteraunts are excellent but a bit pricey for Bali\n", "\nWe stayed in this hotel for 3 nights upon arrival in Bali, It is very beautiful, the gardens are amazing and well maintained, and it has a lovely Balinese feel to it but with all the modern conveniences. The spa is super nice. The food was not very good at the restaurants but this was not a problem as we went out to eat. Breakfast was included, it was varied and there were great choices of international foods. The beach though very beautiful was full of floating debris, garbage! this was a total turn-off. I would stay here again because the price-value ratio is good. I do agree with the other reviewer, they need to fix the wifi problem.\n", "\nSpent one week there with family. The resort is beautiful but lacks the quality, amenities & feeling of a 5star! The first night did not make a good impression but was certainly a lasting one!!! Chose to have the seafood buffet for dinner - found the food to be overpriced & terrible! The fire dancing was really nice but you can't eat that!!! The first room given to us had a drainage problem that resulted in a foul odor every time the tap was opened. The mattress had a urine odor & stain. The room was then changed. The stay did get better from there but while dressed like a 5star, this hotel is by no means one! The staff is kind of hit or miss - either fantastic or not! The rooms very standard & dark. The food pretty ordinary. The highlights were the good service by Anni at the tour desk - the diving/cruise with Bali Hai is awesome & not to be missed! Also dinner at Jimbaran is a must do! Nothing about this hotel is particularly special- & we would not return.\n", "\nWe are on a business trip, that's why wifi connection is very important. They offer paid wired Internet connection in the room. There is no free or paid wifi in the rooms. But as you know there are devices that works on wifi only. So, I have to go to the hotel's lobby for the free wifi connection and do my work. From my room, going to the lobby is a long walk. ", "Another thing, the hotel's breakfast buffets is sumptuous but I do hope they change their menu. Because I stayed there for 5 days, and their breakfast buffet is the same for the entire 5 days.", "What did I enjoyed in the hotel? There room is great, pool is huge, spa area is nice (but I had no time to experience the services) beach front is clean and not crowded, people are nice.\n", "\nWe had a week at the Nusa Dua Beach Hotel & Spa. We could not have picked a better place, for a relaxing holiday, great location, very grand, peaceful and tranquil gardens. Can not fault anything.", "The photos on the site are what you see.\n", "\nThe hotel is beautiful considering it is 30 years old, The grounds are amaculate staff very friendly. Wi fi was good in the foyer of the hotel. It was a clean hotel pool area, reasturants,and beach. The rooms were not that clean need to be improved, and sheets yellow and marked. My daughter and I stayed in A club room and the breakfast the hightea evening cocktails and canapes were just magnificent.It was lovely to sit and relax and meet other people from all over the World.Staff in club lounge would hel with anything you needed. Would differently stay here again but would pay the extra and stay in the club lounge.\n", "\nGreat location, very grand, peaceful and tranquil gardens. We were pleasantly surprised as the photos on the website didn't really do this place a justice, however I have been told by the management that they are in the process of upgrading the photographs.", "This place is 30 years old but in a very good nik, however some modernisation of the rooms and common areas is required for it to compete with the likes of Westin and Lagoona and other new properties coming up on Nusa Dua Beach.", "We stayed in the palace club rooms, the staff in the palace club could not be faulted. The added benefit of having complimentary high tea and cocktails and au d'oeuvres was fab.", "Great main pool and surrounding pools...excellent for children (and adults).", "Great for weddings (we witnessed two) or special occasions: milestone birthdays/anniversaries.", "Within short (15mins) walking distance to Bali Collection and the shops and restaurants on the main road.", "The food was good at the hotel (many cuisines to choose from)...however you can either wonder down to Bali Collection or the main road.", "The Spa is highly recommended even if only for a message.", "This hotel is a bit on the expensive side...but recommended.\n", "\nThe hotel is large and well set out with many rooms having great views of the pool, beautifully lush gardens and beach. Rooms are clean and quite small particularly the bathroom but well set out. There are a number of restaurants and places to have a drink so no need to go outside the hotel if you don't want to, great service. Free Wi-Fi is provided in the lobby area but it is quite slow so i would recommend using the business centre to quickly take care of emails etc and then get on with your day. Gym is small but has all basic equipment including cardio and weights.", "A free shuttle service is provided each hour to a local shopping center which has clothing, foreign exchange and convenience stores. There are also several restaurants and the atmosphere at night is very relaxed and is a good cheap place to dine out.", "There is a long line of hotels along the beach, so first evening I recommend going for a walk along the waterfront to check out other hotels and their numerous restaurants/bars. ", "Issue with this hotel was the noise in the rooms, especially from the rooms above and you can hear everything from people walking, moving chairs, opening wardrobes and dropping anything on the floor. Doors also close loudly and anyone coming into their room late could wake you up.", "Overall a good hotel with plenty of things to do. Recommend this hotel for families with children, maybe something little more upmarket for a romantic couple getaway.\n", "\n1. great idea, to put this cimbali machine, which offers a real quality of coffee everymorning.", "2. internet issues - but solved great and gender after complaint - this hotel really needs to work on Wifi ! public internet very poor !", "3. authentic place of Bali, in middle of touristic place - great entrance and nice stuff - but beach and pool should have mor local authentity - ...... ", "very bad - pool closes at 7 pm.... so no romantic nightswim.... even though nice idea to have Kuta/Lombok sand in entrance of swimming pool ", "4. expensive hotel food ! ", "Hotel design very near to real BALi - different to all Nusa Dua Hotels - highly to recommend there !\n", "\nOur honeymoon included stays at the Shangri-La in Singapore, the Nusa Dua Beach Hotel, and finally the Chedi Club in Ubud. Of the three hotels, Nusa Dua was the one I was most nervous about, following some of the reviews I'd read in TripAdvisor. Well, we had nothing to fear. Our experience was perfect. It probably helped that we arrived at the very start of the season (April 2013) so it was very quiet. Very few families with children and not the 'mass resort' that I feared from some reviews. If you're going to Bali to experience the try culture etc then this hotel may not be your best stop. However, if you're going to relax on the beach and have no worries about food and accommodation then you can't do much better than this. That's not to say we couldn't still explore Bali and we did so, but the hotel was a nice stress-free environment to return to each day.", "The hotel is BIG. The biggest I've ever been to. It's one of a number of very large hotels along the beach, all side-by-side. You can walk along the seafront between them and use the different restaurants and bars at each. Having said that, Nusa Dua has an excellent selection of eateries - traditional european and asian. At each of these the food was faultless. It's not the cheapest way to dine in Bali but it is very convenient.", "We had a Deluxe Room with a garden view. Very nice. No bath, which was a shame, but otherwise it was just what we needed. We got a glass of champagne each on arrival as a honeymoon couple and this helped us settle in. You get a balcony but, and this was the only negative of our stay, there is construction work going on to build an exhibition centre next door so we faced a tower crane and the workmen start quite early. So there was some construction noise in the morning. You don't hear this away from your room but it was slightly annoying at first and if you were to spend a lot of time in your room during the day might become quite the nuisance.", "The service was excellent and the staff very friendly. Almost everyone would ask us our names and where we were from and would be happy to chat.", "There are sellers of clothing and other items on the beach that you expect will be annoying but in fact they are all licensed and behave well. They may approach you but a quick \"No thank you\" will be enough to send them on their way and they won't bother you again. The beach is immaculate and cleaned daily. The sea itself has quite a lot of seaweed growing on the bed so it's not a crystal clear blue lagoon but at high-tide you hardly notice.", "Overall we loved our time at this hotel. The room, staff, pool and beach were all exactly as we had hoped and for a honeymoon couple who didn't want the stress of haggling and travelling about it was perfect.\n", "\nThe entrance of the hotel has a huge architecture which resembles a gateway split into vertically symmetrical halves. This is unique to indonesia and this depicts the yin-yang theory of life.", "The room was big enough for 3 people (triple sharing room).. however, the bathroom was very tiny... there were 2 huge chairs to sit in the balcony and enjoy the view.. the welcome drink served to u at the lobby bar is very interesting. mango with local arak. simply yummy!! ", "the hotel gives u a VACATION and resort feel.. not the usual stuffed lobby-hotel types.. the breakfast had a decent spread of choices. best seating is near the small pond wherein i happily fed the fishes with croissants :) ", "the chess bar is a lovely plce to sit and enjoy ur drink... lovely cocktails.. :) the bartenders are helpful in case u need any assistance :) ", "The SPA!!!!! OMG ! worth the money... best spa in nusa dua i can say !! i got a private villa with open air shower when i opted for their balinese massage.. hospitable staff... gr8 ladies changing room with jacuzzi, sauna and good toiletries.. worth ur time and money.. !! ", "Must stay if u are looking for a relaxed holiday.. !! if u want fancy and partying type of location, go to legian and kuta areas...\n", "\nBeing stayed in this nice hotel for few times within a year. My last stay was during the21st International Seaweed Symposium as this is the most convenient and closet hotel to the venue. The room is clean and the breakfast selection is great. Nice swimming pool with a beautiful beach front restaurant as well. Definitely is a good hotel for family vacation or business.\n", "\nStayed for 2 nights with wife and child. The hotel is beautiful, with the balinese architecture and landscaping. You don't feel that it's 30 years old! Room was comfy. ", "Staff were friendly and welcoming. Restaurant food was good but pricey (similar to all the hotels in Nusa Dua I guess). We had the buffet dinner on Fridays by the beach which had fire dancers performances, quite enjoyable. ", "Best thing we enjoyed was the uncrowded swimming pools - my toddler had great fun waddling around in the pool. ", "Wireless internet is only available in the Lobby, which was annoying - pls extend this to the rooms! The business centre had computers but was heavily utilized so didn't get a chance to use them. ", "Pro-tip: Ask for a local taxi instead of the hotel taxi - costs much cheaper.\n", "\nNusa Dua Beach Hotel and Spa is located in a complex with other resort hotels like the Westin and Laguna. The front text greets you with a nice towel to refresh yourself from the humid air. Free wifi is limited to the lobby area, but there are plenty of couches and seating for you to take your time fulfilling your online obligations.", "As you proceed through the lobby, downstairs is the breakfast buffet, which has an amazing selection of tropical fruit. It has a selection of Western and Easter breakfast choices. After breakfast, you can take a quick dip in the pool or wander towards the beach. Tide recedes in the mid to late afternoon, so plan accordingly. If you feel adventurous, you walk past all the beach resorts and move towards the public beach and some cliffs eroded by the ocean waves.", "The room has a comfortable bed and large tv. Most rooms have a balcony or porch for you to enjoy the outside breeze. The shower water pressure is a bit weak, but everything else was great. If you are bored of the beach, you can take a free shuttle to Bali collection. There are a few convenience stores for you to stock up on some snack and drinks if you are planning an excursion. Enjoy your time at the Nusa Dua and Bali!\n", "\nThis might be a good hotel for someone but I dont think so! This'll is our second visit to Bali and after our first very good hotel this one looks awful! ", "The rooms are pretty big but not very clean, there was dust on the floor. ", "The compliment water was not enough for three of us and the price of mini bar water was extremely high for Bali. May be this is normal but here you are in the middle of nowhere and can't bay your own. ", "I agree that the overall the gardens looks nice and there are several restaurants but for less than one day there we have paid more than for we have for at least 2 days in Seminyak! We have diner in Italian restaurant , order few things as we ware not hungry (only our 4 years old doughter was hungry) but pay as for regular diner! And the food was not good.", "In the morning the cleaning staff come at 9 o'clock with a several bell rings which seems very inappropriate for me for a holiday resort! Another problem with our sleep was the noise. The doors and windows did not stop the noise! You could hear every crying child passing around, and the annoying bang-bangs which suppose to be relaxing music starting also at 9. ", "The breakfast was disappointing. Not enough local dishes, overall have no enough choice!", "Another issue was the Internet- free wi-fi only in lobby but very low speed! They offer only cable Internet on a vary high price! You could not use your smartphone on the pool as no wi-fi!", "I do not recommend this hotel!\n", "\nStayed there for 3 nights. Hotel grounds, pool, and beach area very relaxing. Thanks also for the management, we received free upgrade from deluxe to club room. Club room has more space and has direct access to club area beautiful garden. Staff are friendly but some should smile more ilke other 5* hotel in Bali. Now for the flaws : breakfast quality is ok, but variety must be improved, our room is humid, the tile in our room is very moist, the bed sheet is a bit moist, probably caused by the old aircon. Overall still recommended for the value we paid.\n", "\nWe stayed there for 4nights,the location is perfect for retreat and relaxing,we didn't have to leave the hotel,great variety breakfast buffet plus 4restaurants. The room is really clean and privacy, staffs are friendly and helpful. We will definitely come back and stay there again.\n", "\nOk, ok. You don't wanna go to Bali to be on the internet. But I think this is an important thing these days...", "The resort is very good and beautiful. Well mantained with an absolutely awesome pool. It's good for the kids, also (I don't have, but it's a place they would love). The breakfast is INCREDIBLE. One of the greatests I had in my life. There's so many options that you could spend a week there.", "The rooms are good, spacious and clean. The quality of sleeping is very nice. The shower is good, also. They also provide a lot of amenities...", "The staff is polite, not warm. They're well trained to offer us the best experience. And they reached it. The restaurants are good also.", "The beach is nice, as the ocean is not as impressive as we expected. This is a perfect place to rest...\n", "\nWe went their on our Honeymoon for 5 Nights. its a very nice property for the price they offer it in.", "Brilliant beach, Ice Crams and drinks are served on the beach. They have a brilliant Pool Bar.", "good options of Massages on the Beach and water sports. No need to beach them from the hotel. there are guides on the beach who arrange them for you and its really cheap.\n", "\nWe went for 4 days to Nusa Dua because we needed to work and relax a bit at the same time. The resort is so beautiful! It is a pretty big place and we visited in low season (April) so there wasnt that many people there, i guess it would be a different experience if the resort was fully booked. We got the palace club room which is very recommendable since you get to stay at the palace club, where the breakfast is much better, and you get evening tea and cocktail our included in room price. the rooms are also much bigger and are situated at the most beautiful pond with ducks swimming around (in the morning they come up to the palace club to demand breakfast each day around 10 o clock, it is so cute!", "The staff is very nice and considerable and the food in the balinese restaurant is very good! also the chess bar has great salads and lemonades. There are 3 swimming pools, and we stayd mostly at the pool in the spa facility since no kids are allowed, so it is much more quiet and tranquil there.\n", "\nWe stayed here for 4 days in April, and I have to say it is an amazing resort. Beautiful and prestine with a lot of Balinese culture infused, clean and comfortable with many picture worthy spots.the beach is perfect and clean with a beach bar. The pool is gorgeous with lotsa of deck chairs and shade. The staff are friendly, attentive and courteous. Special compliments to mr.mushadi who was in charge of the pool bar who was patient, attentive and generally good natured, also to the staff at chess bar whose service and courtesy is amazing! a few suggestions to the management, would be to have free bottles of water readily available at bars n restaurants and also for the breakfast buffet times to be extended. Also the deck chairs at the beach should have abit of shade (umbrellas/cabanas/etc) like the neighboring resorts just so your guest can enjoy the beach at high noon without getting burnt.however, All in all this is excellent resort, perfect for relaxing and rejuvenating the soul.. Would definitely recommend this resort to family and friends and will be back soon!\n", "\nI went there with my son with a Turkish travel agency and we chose the hotel together. I fell in love the place at the moment I saw it, so did my son. We had a very big room, with a small balcony looking in to tropical trees. The room had this special peaceful, relaxing atmosphere as if that atmosphere was emenating from the wooden panels, floors, well everywhere.", "I had my reflexology massage near a little fountain, the sound of the water and my relaxing feet luuled me into sleep.", "The hotel is very close to Ubud , a place that I wanted to see for a long time.", "Blissful experience.\n", "\nWe have just returned from 10 days,all the facilities were great,the staff were just fantastic,from management down.My wife had a mild illness,but the reception took her to the hotel doctor who gave her medications,which were successful,later that day we received a bouquet of flowers in our room wishing her well.", "Brian Osborn\n", "\nWe stayed at here for 10 days in April 2013. ", "The included breakfast buffet was awesome! We stayed in room 3131 and had spectacular resort and ocean views.", "Our bed was comfy, and the room was quiet", "The staff are friendly and very helpful, and the grounds are pristine.", "As a hotel guest, my only suggestion would be to ask for a room that doesn't face the construction (looks like a new resort being built).", " For the hotel, my one suggestion would be to offer free water with purchased meals. As someone coming from north America (where we can safely drink tap water for free just about anywhere), it's a bit hard to come to terms with paying 2 or 3$ for a water when already paying a premium for a meal.\n", "\nWe were pleased with the gracious knowledgeable service staff, especially in the club. Remembering our names, drink and snack preferences made us feel welcome and at home. We liked the serene privacy and tranquil setting. The hotel has all the right amenities including, contemporary Balinese guest room, quality spa, private adult pool, pool beach food and drink service, Asian and Western restaurants. Breakfast each morning in club was best. Wifi was included in club not guest room, this was strange.\n", "\nIt was my first visit to Bali, I made the reservation through the internet and I was lucky to choose the hotel. The hotel is the BEST place for relaxation. Every single detail in the hotel is nice starting from the Lobby to the rooms, restaurants, pool, garden, ...etc the staff is very friendly and cooperative. The staff is trustworthy I forgot my iPhone at the breakfast restaurant on the check out date and called them from airport; they were very helpful and tried sending it with a driver but he couldn't catch me so they kept it at their Lost & Found department till a friend of mine was in Bali and took it.\n", "\nI have heard many positive comments about Nusa Dua Beach Hotel & Spa from my girlfriends. Thus, I decided to make reservation without any hesitation and I really looking forward to our stay.", "We were surprised upon our arrival at the hotel, it is really big and it took us few hours to explore the resort. Besides, they have good services, spa, lounge, beach and many more. I love every corner in this hotel. Greenish is every where, and the weather was really chilling.", "Breakfast - there are varieties and good food, we enjoyed our breakfast everyday by the pond. Yes, they have a small pond beside the breakfast area. It is good to breath the fresh air every morning. We stayed for 4 days and throughout the days, we were happy with their services. Room was a bit far from the lobby but it doesn't matter to us. Is good to walk while we have the chance to pass by all the great scenery and greenish plant. Our room was big enough, with a balcony. It would be great if they have a bath tub.", "Overall, it was good stay with beautiful memories. We will definitely come back again.\n", "\nWe have just returned from the Nusa Dua beach hotel and spa and we are already planning our return trip next year. This was our first time to Bali (myself and my wife) and we could not rate the Nusa Dua beach hotel and spa highly enough. Firstly the buildings and traditional temples within the grounds are spectacular. If it is an authentic Balinese experience you are after you won't be disappointed. The attention to detail is extraordinary throughout the whole resort. The rooms are excellent, the a/c works a treat and the bathrooms are great. Lastly I would like to give a big thank you to all the staff. Especially in the palace club. The level of attention we were given made us feel like royalty. When you book, it is definately worth while upgrading to palace club. ", "So to sum up, we could not fault the Nusa Dua Beach hotel and spa. The best experiance we could have ever hoped for. ", "Jason Marechal", "Wagga Wagga Nsw Aust\n", "\nI was on my way to Australia for business and I had two days to kill so I decided to stop in Bali, did some research online and saw that the Nusa Dua Beach Hotel & Spa had some great reviews online. I took a chance and booked my reservation, I ordered an airport pickup, the driver was waiting for me right outside international arrivals and whisked me off to the hotel. I have been fortunately to stay at some of the greatest hotels around the world, I must say the lobby and grounds of the Nusa Dua Beach Hotel & Spa are fantastic. The rooms are extremely clean and comfortable, in this super hot and humid environment the air conditioning in the room worked great. No complaints about the rooms. ", "I loved laying out by the pool and the beach, the hotel provides beach chairs and umbrellas (subject to availability) at no charge. Eating by the pool/beach is not cheap but there is really nowhere to go unless you walk for about 10 minutes down the path there is a local restaurant shack with some pretty good food. ", "Make sure you book your room with the breakfast buffet, it's definitely worth it. The Friday night seafood beach buffet was really good, I highly recommend it. ", "The beach in Bail is absolutely beautiful, there seems to be a lot of “sea grass” growing in the water by the hotel, a lot of it washes to shore, also there seems to be plastic debris washing in as well. It really bothered me to see the beach cleanser sweeping up the grass and trash and burying it in the sand. Why are they at least helping the environment and picking up the trash????? Not a cool move Nusa Dua! I also noticed that the waiters by the pool/ beach/ bar did not recycle their bottles. I’m not a big environmentalists but Bali is almost as close to paradise as you can get, why aren’t they trying to preserve it?", " ", "Overall it was a great stay! I will be back 100%\n", "\nfrom the time we check in the hotel at the lobby itself we already fall in love with the beauty and their balinese traditional wood carving, it was so beautiful the receptionist staff and other dept are so friendly the beach was so beautiful and clean they had balinese cultural show during dinner we are very impressed during our stay there their traditional bali food was marvelous it was a very enjoyable stay there and will definately recoment to my friends ", "10/ 10 ponts\n", "\nMy 1st time stay here in Nusa Dua. Was very impressed by the hotel's amenities. Big lobby with nice unique architectural design. Nice swimming pools that fit many. Great buffet spread. Friendly and helpful staffs. Even though hotel is old, but the level of maintenance is very commendable. Good size of rooms. Just beside the beach and the beach walk was awesome. Had a great massage by the beach. Very serene and romantic place. Unlike the bustly town of Kuta.\n", "\nStayed in this hotel for 4 days 3 nights on 29/03 - 01/04, I would say this hotel met my expectation. We were looking for a hotel with a quiet but nice ambience while in the same time offers a private beach and a 5-star service and this hotel fits the bill. Located in Nusa Dua, altho far from the shopping district, it does offer the guest a nice and peaceful environment. Having a private beach helps a lot too. The good thing with the beach is it's connected to the adjacent hotels through a jogging track along the beach, a very nice way to enjoy your morning/afternoon walk. ", "Internet. Wi-fi isn't available in the room. We're fully informed from the previous guests' review here so we were prepared, but still, to think a 5-star hotel with no internet connection available is definitely silly. Breakfast was okay, but being an Indonesian and staying in a hotel in Indonesia, I was expecting a few Indonesian dishes here but I found none. They do serve 3 different types of dishes every day, but probably my expectation on this is too high.", "Price is alrite, standard 5-star hotel rates, not as expensive as a few other hotels, but it does the 5-star basic right.\n", "\nThe staff were very friendly and helpful . The breakfast is very average and two fans in the restaurant area are missing bare wires showing (not a good look for a supposedly top rated hotel. The paving around the pool were in some places very uneven and slippery one guest stubbed his toe quite badly on both toes. My sister nearly fell over as she stepped into a hole in the paving near our rooms. The PH of the pool was not up to standard and you could feel the water was slimy and looked cloudy. Four people we know of were treated for ear infections at the hospital and it wasn't till complaints were made that the pool was improved. One couple had to be moved from their room because of bed bugs Also, one of the guests had to ask for a refund on the al a carte meal as it was sub standard. We also would not eat at the restaruant again mainly as it is far too hot the fans are totally inadequate to be of any use. and we also had In Indonesian night and were looking forward to the satay on offer but were sorely disappointed when only lamb skewers were available and were told the chicken was too expensive to give us yet chicken satay was offered everyday on the poolside menu. Not good enough Wont be back that's for sure.\n", "\nThe spa is totally worth it, specially the sauna and jacuzzi deserves at least an hour everyday :) the keckak dance with lobster dinner is also a most!! .. overall this is a great place to be pampered and have a blast!!\n", "\nWe have stayed at three of the hotels in Nusa Dua. The Nusa Dua Beach Hotel and Spa is by far the worst of the them. We recently stayed for 7 days. Our room's air conditioning did not work and despite the fact that I ask two managers and and an engineer to fix it or move us they didn't. They kept telling me it was fine. Waking up sweating every night is not fine for me. The refrigerator in the room didn't work well either, the drinks were warm. Again, I asked for this to be fixed and they said it had been fixed. The shower was also broken and supposedly fixed but never done. ", "During our stay the breakfast was the same everyday, there was little to no change in the offerings. The waffles were horrible, and pancakes not much better. ", "The service was also not very good. As I am not a coffee drinker, I drink Diet Coke in the morning and after two days of having it at the breakfast area, on the third day a waiter told me that they didn't offer diet coke in that restaurant. I explained that I was willing to pay for it and I had gotten it the two days prior but he insisted that it wasn't an option for me. The service at the spa was not better. I had pre-payed for massages when I booked out room. The night before my anniversary and big spa day, one of the spa employees tells my husband as he was leaving the spa that by the way your wife needs to pay for the services tomorrow she didn't pay in advance. So, needless to say, I had to worry about arguing with them that night and the next morning about my previously paid for services. They were able to find my paid services but it wasn't as enjoyable since I was preparing for a fight going into a massage. ", "My 7 year old daughter said the kids club was terrible, they made cookies but weren't allowed to eat them. They also didn't stick to the kids club schedule so don't be so sure your kids will have fun. My daughter also said the people working the kids club were not nice. She is a kid that LOVES kids club so this was a disappointment. ", "Finally, when we tried to arrange transportation back to the airport, my husband had to talk with three different people in order for us to get arrangements back to the airport. The manager kept saying that they didn't have a vehicle that could accommodate our family of four, with four large suitcases. ", "Needless to say we will not be returning to this resort or recommending it to any friends.\n", "\nMy husband and I stayed here for our honeymoon between 11th and 18th March. Overall it was pretty good but I have to admit I have stayed in better hotels. We had a rough start to our trip seeing as the shuttle we booked from the airport to the hotel was infested with ants which climbed all over us and got into all our bags. When we went to check in we were greeted by a very unenthusiastic, almost rude member of staff. Not helping matters, both of our credit cards would not work and we were forced to put almost all of the Indonesian Rupiah we had on the room. Not a good start at all... We were very tired from 2 flights so we had a quick swim, had dinner and went to bed.", "The next morning we were feeling better and were able to start fully enjoying the hotel. The room we had was the perfect size and had everything we needed. I will however note that it was not as clean as I would expect of a hotel room and one of the shower heads (there were 2) sprayed everywhere but downwards, leaving the whole bathroom soaked. We took to just using the shower head that actually worked properly so this was not too much of a problem. The bed was rock hard but I actually found that I slept better than I had in months as did my husband. It was surprisingly comfortable. There is an amazing array of TV channels to choose from in the rooms, very good if you just want to blob out in front of the TV, or if it's raining outside!", "Yes it's true - breakfast is absolutely amazing. It's a good idea to get in early (before 7.30am) so you get first pickings. I've never eaten so much in my life. I had to stop myself going back for 3rd and 4th helpings! ", "The grounds of the hotel are clean and well maintained. The pools are clean and at a very refreshing temperature. We tried all of the restaurants and bars in the hotel and found them all to be of good value with very nice food. I recommend trying \"Burgers on the Beach\" which you can get for lunch from the Chess Restaurant. It's very cheap and you get a good helping of burger and wedges. You also get to choose your own salads and sauces. ", "On our first day the hotel was quite crowded but this was because it was \"Silence Day\" in Bali and no one was allowed to leave the grounds of the hotel. On every other day we felt almost like we were the only one's there, which was nice. ", "The beach wasn't amazing but it was nice. Good for a quick dip and a lie in the sun. You do get approached by people selling things on the beach a lot though, you just have to be able to say \"no thanks\", often more than once. This is the same wherever you go outside of the hotel. We walked the the \"Bali Collection\" shops one day to do some shopping and we were harassed by every cab on the way and then by every sales person at the Bali Collection. Just make sure you're firm in saying no and you'll be fine. ", "All in all the Nusa Dua Beach Hotel and Spa is a nice place for a relaxing holiday but is not the best hotel I've ever stayed in.\n", "\nWhat an amazing trip. This is my first trip overseas so for a newbie you can understand why i was on edge. As soon as we arrived at the hotel we where greeted and looked after, didnt take long to be relaxed. We had our wedding here and every detail was perfect. Eka our wedding planner contact at the hotel was fantastic. Stunning location and was great to chill out by the pool. Food was great and plenty to choose at brekkie. Will go back again to enjoy.\n", "\nWe stayed at the Nusa Dua for a week during Easter. The resort is beautiful and staff is extremely friendly and helpful. We had an amazing time, there was a great variety of local fruits at breakfast, the restaurants also offered good meals for dinner and lunch (although they can be a little expensive in comparison to other restaurants in Kuta or Ubud I think they were reasonable for a 5 star hotel).", "Everything about our stay at the Nusa Dua went above our expectations and by check out we were already planning our next visit. The only aspect of the hotel that came to my attention as something that needed a change was the chairs on the beach. They are plastic and look dated especially in comparison to the ones in the other hotels alongside Nusa Dua's beach.", "However this did not cause any discomfort while taking nice naps after lunch on the calm and peaceful beach...", "Definitely recommend this hotel and hopefully coming back soon!\n", "\nWe stayed here for 4 nights early April 2013. We enjoyed our stay but after such amazing expiriences in other parts of Bali (Sanur and Ubud) We were a little disheartened at first about the area. There is nothing but hotels and although the hotel is lovely we prefer eating in other resaurants and doing shopping. There is a shopping arcade there but its all fixed price and expensiveThe swimming pools are very nice and large and the grounds are gorgeous, especially the huge lobby and breakfast area. Breakfast itself is amazing, definalty suggest getting the daily buffet.They have different dance/dinners on a weekly schedule and we went to the Keckak dance and very much enjoyed watching the lovely dance while eating a huge meal (24 AUD pp) The beach was nice and we enjoyed getting drinks and food while relaxing on the deck chairs. There is squirrels everywhere and we enjoyed watching them and even feeding them some fruit, probably not the best idea though because we did get scratched twice. There is a few restaurants and we got an enjoyable dinner at the one on the beach a few times but it was pretty espensive (12AUD for a main) compared to prices in Sanur and Ubud (3-6AUD for a main) Overall a nice expirience but probably would stay 3 or even 2 nights instead of 4 as its wonderful for relaxing but not for much else.\n", "\nThe people of Bali are very pleasant this hotel is older but nice There are two main concerns communication and smoking. Even though I told them four times I would come to their BBQ they had no table available Others ran into the same problem yet I saw many tables unoccupied all evening. They sat me, a young family and others at their bar ( No utensils or place mat) and then turned it into the smoking den for a tour group of Russians When I moved the ash trays away from where I was eating they moved them back. Forcing POISONOUS 2 nd hand smoke on young children, pregnent women and people dinning is NOT ACCEPTABLE. They did not care no matter what you said they answered YES YES The smoking also happened around they pool several days in a row. You sat down and a few minutes later you had smoker move in on both sides. Left early because of it Bali past it prime now a SMOKERS den\n", "\ni believe this resort is 30 years old but they have gone to great lengths to keep the resort from looking dated. the staff is what makes this place great. friendly, and helpful. this resort is truly accessible was there supporting my friend who is in a wheelchair.\n", "\nOur first holiday as a family with our three and a half month old son. Four night stay in first week of March 2012. The place is baby friendly. There was a baby cot put in the room and the baby’s feeding bottles were promptly washed when requested. The cot was nice with cot bumpers depicting the Kung Fu Panda theme. The resort was a little dated, but was good. The rooms were of Balinese décor with ample storage. A good place to keep all the shopping. ", "The staff was fantastic. Very friendly and caring. Ms. Deeka was outstanding. We wanted to perform a traditional Balinese blessing ceremony for our three month old son and Ms. Deeka put in a lot of efforts to make sure it happened properly. The ceremony was done at the hotel’s Hindu temple. A fulfilling spiritual Balinese experience.", "On the flip side, rooms were a bit old and the breakfast had the same items everyday. There were hardly any local Indonesian items. Normally when you visit a particular country, you want to indulge in the local cuisine. However the exemplary service more than made up these minor flaws.\n", "\nAfter a week in Ubud, we moved closer to beach and stayed here. Great resort for couples and families. Our room overlooked the pool and had a partial beach view. The beach was beautiful, nice and quiet. Rooms were clean. No issues with mosquitoes. Staff was friendly. We particularly enjoyed the pool and pool bar. Bartender at the pool was great. Drinks aren't cheap but you are staying at a resort so expect to pay resort prices. Same goes for the spa. I loved the spa at the hotel so much that we visited every other day. Sure there are cheaper places outside of the resort area for drinks and spa treatments but when on vacation at a resort like this, everything you need is right there. I really enjoyed the daily breakfast here too. So much food to choose from. We also tried three of the restaurants at the hotel (the pizzeria, Asian bistro and beachfront restaurant) and the food was all tasty. We booked an all day tour through the hotel and our guide, Putu, was such a sweet and friendly guy. As a photography fan he never minded taking pics for us. Overall a wonderful stay at Nusa Dua Beach Hotel & Spa. Would definitely recommend!\n", "\nStay from 14/3 to 18/3/2013.. Hotel was spacious and green, we brought my 4 months baby along and is baby friendly..", "Staff are very friendly and the chamber man is very helpful .The de luxe room is a bit expensive us$ 168.00", "There was hardly any Singapore tourists in sight., although the next day I saw a lot of PRC", " The breakfast is the same everyday. If you stay more days you really get sick of it, ", "I suggest they should change the menus and it cater mostly for Ang MOH\n", "\nMy husband and I picked this hotel for our honeymoon stay because it seemed beautiful and secluded. The hotel didn't disappoint. The staff is super friendly. Our room was cleaned at least twice a day. We never went without water in our rooms. If we needed something we would just call and they would have it at our room within a reasonable time. Room service was exceptional. The variety of food available was great. We had a beautiful room with balcony over looking a peaceful terrace. I'm very picky when it comes to room cleanliness; I need to be able to sleep comfortably in my room, on the bed, and shower comfortably. I was able to do all the above throughout my entire trip and stay at Nusa. I loved it. Especially because it was our honeymoon we felt it was definitely a great choice for our stay in Bali.\n", "\nAs soon as one came out of airport warm & humid typical tropical air welcomes you, which", "In my case is associated with holidaying so I just love it. I had booked this hotel online after seeing its good reviews though most of the hotels in bali are having pretty good reviews.my choice was limited to hotels in nusadua & kuta areas.I had booked premier room with breakfast & airport pickup. Transfer to hotel was smooth as it is around 20 mts drive.", "About the hotel: pros :checkin & checkout was supersmooth.service is quick & efficient.staff is always smiling & rather too courtaeous.premier room is average in size but neat any smaller room would have been cramped.breakfast & in general food is good in all four restourants.", "Cons: I m beach person but the beach of nusa dua strip was not of high standard. It was too short & steep & once sea is down it leaves vast area of mud & waste land.", "Another problem was mosqitoes which despite using repellent creames restrict our movements in hotel after sunset for the same reason we were not able to open door to our balcony.", "Our overall experience in bali in this hotel was good.", "Must do in bali is balinese massage & spa. Stone & wood carvings are beutiful.", "\n", "\nWe have stayed at this hotel a number of times over the last few years. No, it is not new but always so welcoming. The grounds are very nicely kept and as it is an older property the garden and trees are mature. My husband and I love returning here every time. It is so peaceful.", "My only gripe on this occasion was noise from the ducks, very early in the morning.", "Breakfast is not as good as it was on previous trips. Pizza at the Italian eatery was good!", "Staff are very friendly. The hotel could probably do a bit of a touch up here and there.", "No wifi in the room and the wifi in the lobby which is free is very slow.", "We are happy to return to Nusa Dua Beach Hotel & Spa.\n", "\nStaff was great. Beautiful surroundings. I read some poor reviews. But these are unfounded. I would go back. Rooms where great. A short walk to restaurant ,pool and beaches. Restaurants were all great, loved the whole duck at Rajas. And the sea food combo by the pool or beach,doesn't get any better.\n", "\nThis hotel was ok. Pool area is really lovely. However, the hotel room was woeful. The room was just so old and not that clean. The patio chairs were unusable due to them being wet all of the time and smelling of foist. We had just come from the Ayana hotel so any other hotel would have a lot to live up to. However, this hotel is just old and a little bit worn out. Frayed towels, holes in poolside umbrellas, that kind of thing. The grounds are really lovely and the hotel is on the beach but I just didn't like it. Breakfast was the usual choices but again not exceptional. Staff were all very nice. No Wifi in the rooms but free in the lobby, service slow though. Didn't go into Nusa Dua. Taxi fare from hotel to airport $25 US which is a rip off. Would I go back. No.\n", "\nNice balinese architecture. Great service, good breakfast, and the room was spacious. Beach was clean and quiet, perfect for getaway. You can take a walk along the path behind the hotel to enjoy nusa dua beach and some of its beach bars.\n", "\nWent on holidays from Costa Rica to Bali with just a lot expectations.... This hotel host us for 6 days and each day was special...Great service, good food and nice rooms .... Higly recommendable...Thanks a lot for great Holidays....\n", "\nI stayed at this hotel for 2 nights during the Seclusion Day. Even though it was considered as a public holiday for all Hindus in Bali, however, the hotel was still open and provided all their services like any other day. ", "The room was clean and nice, the pool was also fabulous. ", "Breakfast, however, was standard. I hope they can improve the variety of the food in the future. ", "Overall, it was a pleasant stay at the hotel. I would definitely go back for another weekend getaway!\n", "\nWe had a wonderful time in Bali . Staying at Nusa dua beach hotel and spa was a wonderful experience !! Friendly staff , beautiful food , amazing location ... Perfect spot for romantic getaway ... Nusa dua is just far enough away from kuta , no harassment !! Good shopping , lots of bargains .\n", "\nI spent my honeymoon in Nusa Dua, Bali. The Nusa Dua Beach Hotel and Spa is an enormous hotel complex right by the beach. The check-in took some time but I suspect that it was due to the fact that we arrived a day late since we missed our connecting flight from Amsterdam. We were upgraded to a better room on our arrival and we got a nice flat with separate bedroom and living room. ", "The hotel grounds are immaculate and very beautiful with various flowers and balinese style statues - and a lot of squirrels! The pool area is very nice with a pool bar. There is also a spa area with all sorts of treatments. The lap pool, saunas and cold water pool is great! There is also a bar where you can get light lunch and delicious non-alcoholic drinks.", "There are several restaurants in the hotel. The breakfast is good and you can find everything from pancakes to fried rice and omelettes made-to-order. The prices in the hotel are at least 3-fold compared to prices outside the hotel area so usually we preferred to eat outside the hotel. There is a free shuttle to Bali Collection shopping centre with lots of shops and decent restaurants.\n", "\nWe stayed 4 nights at this hotel with our 2 tween daughters. We wanted to stay in the Nusa Dua area and this one seemed to be one of the better value for money ones. ", "I really liked the more Balinese styling and grounds of this hotel. The pools are nice, but the pools in neighbouring more upmarket hotels seemed more interesting. Did like the pool-bar though! Our family room was really big - the girls shared a bunk bed in a separate room to ours. No complaints on floor area! There is a selection of restaurants on site and breakfast is the usual resort fare with gamelan duo each morning. Must agree with another reviewer on staff at breakfast - except for the welcoming lady, the rest was ordinary and it sometimes took multiple attempts to get attention or service. ", "In Nusa Dua, all the resorts are next to each other, so you can do a hotel/pool-crawl which we did one day :) Besides that, the Nusa Dua area is good because it's separated from the rest of Bali, but also bad because it's further to get to Seminyak/Kuta area (traffic was really congested when we were there, especially due to the tunnel works? near Kuta).", "The lap pool/health centre/spa area is nice and secluded if you want to get away. And it's a short walk to the \"markets\" area just past the entrance to the Nusa Dua area and there's a free shuttle to the Bali Collection shopping area. Unfortunately the only free internet is in the lobby area, so many tourists can be seen lounging on the chairs surfing the web. Not sure if this a ploy to get tourists out of their rooms and interacting with each other, but it was inconvenient at times.\n", "\nThis resort is advertised as 5 star but we found it lacking. The Buffet breakfast was less than average - not much of a choice and half the hot food on offer was stone cold on most mornings - even though we were usually there at 7.30 am. The staff at breakfast operated on auto pilot and were very robotic - no interest in making you feel welcome. But the most annoying thing about the place was that there was no WiFi in the hotel rooms which is incredible considering how many people use iPads or similar. There was free WiFi available in the lobby area but the connection was so bad that is was barely usable. The middle of the day was the only time you had a chance of being able to use it. If you had a lap top you could plug in to a connection in your room but you had to pay extra to use it - approx $5 for 1 hour. In a 5 star resort I believe that this should be included in the price. They had a business centre but again the connection was terribly slow and you had the inconvenience of having to go to the business centre to use the internet. We would not stay there again.\n", "\nStayed at Nusa Dua Beach Hotel for 4 nights in February 2013 with my husband and 3 teenage children. We stayed in a Palace Club Room and Palace Club Suite (interconnecting) and what a great experience! From our flawless check-in at the Palace Club to our beautiful room and suite and the immaculate grounds of this hotel, we definitely felt like royalty! The pool area was lovely - especially enjoyed the poolside bar and restaurants, also the daily pool aquaerobics. Loved the traditional Balinese buffet dinner and dancing on Tuesday night. The spa was fantastic and my 2 daughters thoroughly enjoyed their pampering sessions. My absolute favourite was the complimentary afternoon tea served in the Palace Lounge! This is our new favourite hotel and cant wait to return.\n", "\nMy wife and I were in Bali for a friend's wedding. Nusa Dua is a great location if you want to be away from the shopping/tourists/nightlife of Kuta or Seminyak. Just be aware that a trip to Seminyak is one hour away by taxi (R100,000).", "The resort does a very good job at hiding its age (30 this year) and has many restaurants, a few pools, a tennis court, a gym and a spa. The restaurants were good (but not cheap) although I was disappointed by the spa.", "We stayed in a club room. Check-in via Palace Club was seamless and staff were fantastic. Wednesday night cocktails were a highlight. Room was nice although the cleaners needed a few lessons in making a bed. Furthermore the cleaners always seemed more interested in cleaning our room than returning at a more suitable time. Shower was fantastic.", "The main let down of the hotel was the general admin/reception. When I called asking them to reconfirm our flight they instead gave me the phone number. We also had a few issues making our booking. And to top it off I was charged twice for a transfer to the airport which I only realised later.", "By no means a bad hotel and very good value for money - just be aware of its shortfalls.\n", "\nStayed here for 5 nights over 2012 New Year period with my husband & 2 older teenage children. Upon arrival we were whisked away to the Palace Club Lounge for check in. (Palace Club DEFINATELY worth the extra cost!). After a mixup with our reservation we were shown to our rooms. (2 x Palace Club rooms). Rooms were very clean & spacious with Balinese feel. Lovely big bathrooms with nice fluffy towels & lovely toiletries.", "Pool area is nice although a little crowded due to the holiday period. Everyone seems to head to the pool area & puts their belongings on sun lounges to reserve them, then goes off to breakfast/activities & some return to pool hours later. We even saw a pool attendant reserving 2 lounges for someone!", "Beach is nice & kept very clean although we encountered a rather large snake on the path to the gazebo on our first night.", "Palace Club is a definate! Includes Al-la-Carte breakfast, all day non alcoholic drinks, beautiful afternoon tea & amazing cocktails/beers/wines & canapés in the evening. The staff at the Club were very attentive & friendly.", "Spent a few hours in the Day Spa. Sensational!", "We have stayed in many 5 star hotels in Bali including the Conrad & Nusa Dua hotel is up there with the best of them.", "Only negative thing I can say is hotel (& other 5 star hotels in the area) are in a secluded gated area. Great for safety & security but you have to leave the resort by taxi to go anywhere including convenience store or any shops.", "Overall a pleasant stay but would never visit Bali again over New Year period. Took 3 hours to get to airport (normally a 30-40 minute taxi ride) due to holiday traffic.\n", "\nExcellent place for honeymooners, and families.. I however was on my own! But still had a lovely time.", "The grounds, the rooms, the staff, the pool, the beach, the restaurants..EVERYTHING about this place is exceptional! ", "staying on my own I felt very safe everywhere within the resort and all the staff were extremely helpful. The day spa is a MUST! I had the latte detox, and it was divine! The restaurants, bars, room service is all fantastic and plenty to choose from. ", "Everyone warns about changing money in Bali, and I was a little disappointed that the bank within the resort did try to short change me! So be mindful of this!! Also the taxi service is a lot more expensive from the resort, just pop outside the gates and grab yourself a bluebird cab!\n", "\nI stayed at this hotel for three nights in February 2013. The room size was average even though because of high occupancy, we were upgraded to a premier room, it was small and noisy from the construction site close by. The bath tub looked old and a bit grotty. The bathroom amenities were poor. The bed linen was stained.I am surprised by the good reviews the breakfast has received. I am not impressed with hotels that have empty buffet dishes at 10am when breakfast ends at 10:30am. The dining room was old, the silverware worn and the table covers on which the buffet dishes were placed were filthy. After a million dollar renovation, I was expecting a swanky modern hotel, it was a let down. The staff, though friendly were dated. The bar man who served us our welcome drink, proceeded on to break a few glasses that he was clearing. The pools are nice, as expected the food was very expensive. The areas around the pools were not cleaned regularly, a straw and a slice of lemon that feel onto the floor from my drink on the first afternoon was still there the following two days! Next tim,e I will go back to the Laguna or the Westin.\n", "\nNusa Dua Beach Hotel & Spa has beautiful grounds, a true Balinese style hotel. The hotel is set amongst other 5 star hotels built 1 next to the other with no bounding wall separating them, which is great, you are able to walk down the pathway visiting other hotels, perhaps trying dinner at different places. Nusa Dua area is built for the tourists, its clean, safe & much quieter. Kuta is 30 min away & Jimbaran bay 20 min. Although February is rainy season we did not experience 1 day of rain, which was a blessing.", "Nusa Dua hotel is huge consisting of 3 pools, 5 restaurants & 2 bars. We booked the premium room which was facing the pool & sea, the room was spacious, well decorated with wood carvings, had a king bed & a full bath & shower. The amenities were replaced everyday & housekeeping were most friendly.", "The setting at breakfast next to the koi fish-pond was soo calm & beautiful. Service was quick & efficient. Breakfast was scrumptious, had a wide variety from continental to Balinese, Asian & European food, always fresh & always fully stocked. The chefs are always walking around filling up the pastry racks & eats.", "The pool area gets packed quickly, so getting there early is a good tip, while the afternoon seems to fizzle out, more pool chairs become available. The pools are clean & huge, the waters are warm & delightful. The swim up pool bar is refreshing & convenient for drinks. The beach is a few steps away from the pool,which makes access easy, the shallow waters are clear & calm.", "Sandies pizzeria is great the goats cheese cannelloni is amazing – a must try!", "The hotel has its own bank, tour operator, souvenir & clothing stores, taxi service & spa. Blue bird taxi service is a metered taxi, more reliable & cheaper than the hotel taxis – once you are at the taxi counter rather ask for a blue bird taxi. Some of the restaurants in the area offer a free pick up & drop off service. ", "Bali collection is an open mall area consisting of restaurants; spas & shopping just down the road from the hotel. They offer free shuttle service to & from, a great place for dining in the evening & paying half the price which is an up. The restaurants offer 10 – 15 % off your bill as competition is high. ", "Overall Nusa Dua Hotel is an excellent hotel, great & friendly service, calm area to stay, safe & relaxing. It was paradise … simply relaxing... definitely would return!\n", "\nI stayed at the property for 4 nights in November 2012. The grounds were stunning, the pools clean and inviting and the service exceptional! The room was large and comfortable but very light, early in the morning. I asked at the front desk if it was possible to somehow block out the sunlight and within hours, room service staff had stapled black material to the wooden doors, and covered the glass panels. Perfect! Such exceptional and efficient service.", "The breakfast buffet alone was worth the price of the accommodation. Such a huge array of dishes - the selection and the quality of food was fantastic.", "If I had known how much there was to do at, and around the hotel, I would have booked in for more than 4 days. I would recommend that people watch the fruit carving demonstration by the pool, go for a morning bike ride with a hotel staff member, play squash, tennis etc. There is a timetable in the gym area that shows all the activities for the week - many of them free of charge.", "At first I was a little disappointed that the hotel was in a 'hotel compound' so rather removed from the typical Bali scene (night markets etc) but the free shuttle bus provided by 'Bali Collection' (the local shopping centre) was excellent and we used it daily. The front gates of the compound were only a 10 minute walk from the hotel.", "As our check-out was several hours before our flight, we were welcome to use the spa to swim and shower prior to departured. I would recommend this hotel to anyone!\n", "\nThanks to Tripadvisor, we found this excelent hotel. It was our first time in Bali and this hotel and the area were is located is just perfect. 15 min walks and you can eat in Bali Collection or in the Street (I recomended Tropical Restaurant). Excelent pool, beach is quiet and nice. Breakfast is very good with a lot of options. If your are thinking to go to Bali , take this hotel.\n", "\nme and my wife hav had the most amazing time over here in nusa dua beach hotel and spa,", "our room was located at one of the best location, the pool was the best ive ever seen,the beach is nice and quite, big property, breakfast was just amazing, lot of option in all the cuisines,", "we had stayed from feb 7 to 11, felt it was quite less, you need at least 7 days out of which at least 2 full days in this beautiful resort. some more indian menu should be added for the main course,", "rooms are veeerrryyy nice, the people entire bali are very well behaved,staff are good to talk cooprative, understanding.", "we will come to this place everytime we plan for bali,", "as this place is just one of its kind..", "regards", "KAJAL AND SAGAR WADHWANI\n", "\nWe stayed here on advice of our travel agent who had stayed man times previously. It was our first holiday with baby in tow and she recommended staying in the palace club for more personalised service and the inclusions. It wasn't cheap and there were definitely be much cheaper options for a stay in Bali but it was safe and friendly.", "One of the families we met there in the pool travelled to value regularly (they were from Perth, so very easy access with quick short flits) and they had stayed in a number of hotels with their young children and felt this was the best due to the pools - they are by kid friendly with a little sandy beach sloping gently into the water.", "Every day they had some aqua aerobics you could join in with if you wished. Massages were available in the spa of the hotel or more basic / cheaper option was available on the beach. The beach isn't that great in my opinion - no shade and not that nice, but I realise coming from Queensland we are spoilt with some of the best beaches in the world.", "Food at the restaurants was reliably very good and service always very friendly. They love children and make you very welcome.", "If we get a chance to go top Bali again any time soon, I would probably try Sanur as I would like to able to walk to nearby restaurants and have easier access to trips to ubud.\n", "\nThe entrance says it all ... as you come into the property, the candi bentar (split gates) together with the Balinese architecture make this feel a little more in touch with its location than the other resorts along Nusa Dua.", "The rooms are comfortable (premier room may be a touch bigger than deluxe), pools are excellent (esp. the lap pool which was great for laps as well as relaxing - very few people), spa treatments beautiful. Breakfast buffet was impressive in its diversity.", "Restaurants were a little bit of a letdown in that everything was just average. The bar was nice and particularly having drinks out on the outdoor terrace was very relaxing.\n", "\nI believe this hotel was the first hotel in Nusa Dua, an enclave of exclusive resorts. It has a prime beachfront location and is quite large. We were upgraded on check-in, the room was fantastic with great service throughout our stay. The restaurants within the resort and outside are very expensive with average food. The included breakfast is fantastic with a massive choice of dishes. A very nice getaway for 2 nights, we really enjoyed our stay at this resort.\n", "\nStayed in hotel for 3 nights after leaving Seminyak. This hotel was a complete surprise. Outstanding service from the time the concierge opened our car door until the time we left. From the concierge to the cleaner, from guest relations to the bar person......we were greeted by all staff where ever we walked or were served by. We booked a Deluxe Room for Four (2 Adults and 2 Teenage Children) directly through the hotel itself and was perfect. This type of room configuration we found was not on other websites. We had privacy and so did our children, but kept our door between rooms most of the time. There was no construction we found going on. The rooms are balinese style and a little musty but goes. The hotel ambience makes you feel that you are in Bali. Room service and the cleanliness of our room was excellent. Okay so a little more expensive with regards to food and drinks compared to Seminyak/Kuta but you are staying at a hotel in a luxury area of Nusa Dua. We loved the pools and swimming up to the bar for our drinks. There were around 4 restaruants and enjoyed the seafood and Kacek dance on our last night. Recommend the pizza and wedges (Chess Bar and Sandros). Three nights was enough to unwind in Bali before leaving for home. Again the staff were amazing and we would recommend this hotel for family. It does rain more than Seminyak, but we didnt care. We swam in the pool in the rain because it was still hot. So much to do when it does anyway. There is the games room for kids and the spa for adults. I had two amazing massages . Better than Australia and cheaper.", "Recommend that you dont overthink everything. You are in Bali off course. Enjoy. Forgot to mention amazing buffet breakfast. Recommend to get it included in your accommodation cost.\n", "\nWent in Feb 2013 with a party of 2 adults and 2 young children. Chose this hotel based on the good reviews on TA and also because they had a suitable room configuration for us. I just wanted to give a balanced review so that people do not think that all is peachy about this hotel.", "As advised by some reviewers we requested for a quiet room not facing the construction site nearby as it can get noisy. The peace was especially important to us given that our 2 childen went to bed quite early in the evening. We arrived at about 3 pm and were told that our room was not yet ready, and that we had to wait for half an hour, which was not that big a deal. However, after that we were then told that the room would not be ready till 6 pm! We were offered another room, and we were assured it was not going to be noisy. Of course, when we went to this room, we realised it was facing the aformentioned construction site. We asked for another room and they then gave us a replacement room which was not the one we booked for. By this time, we were so tired and the kids were getting cranky so we just accepted the room.", "The room had problems - first the air conditioner thermostat was busted, so one part of the room was super cold and the other was warm. We reported the problem and it took them 2 days to address the issue.", "The coffee machine wasn't working.", "After all our efforts to get a quiet room, we could still hear the construction site. On one night the workers were at it till 2am!", "The rest of the hotel was more encouraging. The building perhaps was a little bit old, but it was well maintained and clean. The architecture retained a distinctive Balinese feel to it. The pools were big, the beach private, and because it was off-peak season, there were lots of space for everyone. Breakfast, although had a wide variety, was pretty much they same fare everyday so you started to get bored of it after a while.", "The staff were friendly and eager to help, however they were let down by one major issue - communication. Finding an English-speaking staff member was an issue and we were often trying to guess what the staff were telling us. I think that our problems mentioned above would have been solved much more smoothly if the staff could or would just tell us what was happening. Even when we were booking the hotel, it tooks us numeorous emails and phone calls to achieve that. We requested an evening check out as we had a night flight, and, even after we specifically told reception in the morning, our key cards were blocked and we were locked out of our rooms on that afternoon.", "All in all, the stay was bittersweet. Although the potential was there for a great hotel, it just didn't deliver in some areas.\n", "\nWe really liked this hotel, the staff were friendly and the service was excellent. There were three pools, one that had volleyball and beach feel for kids, and another with a swim up bar and the third in the spa area which was a quiet area with no kids. We do not travel with kids and enjoyed the fact that we could enjoy somewhere quiet and very relaxing. The Spa was excellent and pricing reasonable. There were several restaurants of different cuisine but the cheers bar had a eating area right on the beach which was a beautiful place to eat as the sun went down, with a walk along the beach after dinner. The bar was open until 2am and when we arrived at 1am we could unwind with a drink and were not made to feel like they wanted to close for the night. The hotel was recently renovated and the ambiance of the hotel and rooms was lovely. It was close to the Nusa Dua market and the Bali Collection Shopping area and we did not need to venture far from the hotel for anything.\n", "\nVast courtyards, massive entrances, sprawling gardens, private beach, sumptuous breakfast buffet and lovely cocktails.......... you have it all. The gardens are lovely with fountains and every room has a balcony overlooking acres of garden. Highlight is the private beach where you can catch the sunrise. We had a lovely time lazing around the beach, soaking up the beautiful ambience, and relishing the yummy fare. I didn't feel like stepping out of the hotel at all!!\n", "\nWe had a 4 night stay in this resort in summer 2012. Just got around to writing about it now, but the memories have stayed with me and will do so for some time I think. ", "The Nusa Dua Beach Hotel is one of the original resorts built in the Nusa Dua part of Bali. This also means it is one of the oldest and a few years back may have become a bit dated and in need of a freshening up.......well, mission pretty much accomplished. The owners of the resort are some middle eastern investment arms of an oil rich state in the middle east, and they have recently injected funds to re-do the resort. It was almost completed when we stayed there last year, so perhaps should be completed by now.", "Peter S, the GM of the hotel was a very gracious host and went out of his way to make me and my family (wife + 3 kids) feel completely at home. We were upgraded to a nice one bedroom suite on the ground level and provided access to the club facilities which meant nice breakfasts, high tea snack, and happy hour drinks gratis. The facility itself boasts a few different restaurants, two swimming pools, morning yoga sessions, gym, kids playgroups, function rooms etc etc. ", "Rooms are large, clean, well thought out, with all the usual amenities of a 5 star resort. Bathrooms also good sized and seems like new fixtures have been added, which is always a nice touch. LCD TV's with DVD players, good linen, nice firm but not stiff mattresses, soft pillows, new towels, and many other aspects which is plainly obvious to have been recently put in place all make for a good value and a pampering type of atmosphere for people staying there.", "The beach is a 1-3 minute walk from the hotel depending on which part of hotel you are staying at. Mall/resto area a 10minute walk away from hotel on main road of Nusa Dua. ", "Nusa Dua is located about 15minutes drive from the main Kuta strip area where alot of the action tends to happen, but we were happy to be in a place where we could just hang around all day and be content. About a 20 minute drive to/from airport depending on traffic. With traffic these days in bali, it's useful not having to go into some of the other parts of the island. whole family was in love with the resort and we did not want to leave...actually inquired about extending the stay but our airline tickets would have charged a big penalty for the change, so we decided to forgo.", "All in all....not a single negative thing to say about the place. Would definitely stay there again in the future.\n", "\nThis hotel had it all. Two huge and beautiful swimming pools - one with a swim up bar and the other with pool volley ball and a sand beach entry. Load of eating choices with an Indonesian, Asian, Italian and International Restaurants. Plus the Cheers Bar.", "There was free table tennis - 2 tables a basketball hoop in a pool area, Beach volleyball. Plus there was yoga classes on the beach and pool aerobic classes.", "The hotel also has a Spa complext attached to the hotel where there are tennis courts (2), squash courts(2), gym, lap pool, saunas and all other beauty therapies and massage. You pay extra for all of these services.", "The room was a deluxe with a king size bed and a nice bathroom. The bed was firm, and I usually like a soft bed, yet I slept amazingly well. I think being so relaxed in this beautiful hotel resort made it so easy to sleep. Plus the air conditioner worked very well.", "All the staff were amazing. The Balinese people and their lovely smiles and friendly and relaxed nature just makes you relaxed too.", "The hotel was immaculately kept and it was quiet and serene everywhere you went. The gardens were so very beautiful with ponds. All the plants were named so it was like being in a botanical garden.", "Breakfast was unbelievable. So much choice. The chocolate danish was to die for!! It was fun trying some of the unusual fruit of the Island too.", "You really did feel like you were staying in Paradise at this lovely hotel. We walked down to Bali Collections which is a great shopping centre with many restaurants - all much more reasonably priced than eating at the Hotel and they had great entertainment also. I shopped at CoCo's which is a supermarket/variety store with very good pricese. Plus there is a small department store - like a mini DJ's. The rest of the shops were boutique style. I loved shopping through here except beware of the two fellows giving you tickets to win a prize. It is a bit of a con to get you to buy into a timeshare so dont fall for it!!", "The were only a couple of negatives of the Hotel. One was the Business Centre.Even though we were at the hotel during a very quite time, it was hard to get onto a computer. Usually two or three of the five computers were not working and they were also very slow. There was no time limit so you luck out (like I did) if a couple of 15 year olds take up camp there and hog the computer. There is Wi Fi in the room so next time I will take my computer instead.", "The other was the small choice of wine on the menu and the huge cost to buy a bottle of wine. All the $40 bottles were not available. So I had to buy a $63 bottle of wine!! The food prices at the Hotel were Australian prices also but even so, we still ate there a lot as it was so enjoyable.", "The traders on the beach in front of the Hotel wear a numbered shirt so I think only licenced traders are allowed to deal there. We ended up having a massage on the beach every day for $10. They were also selling sarongs (I paid $8), jewelery and boat tours. I paid $35 for two people to go in a one hour glass bottom boat trip and we were the only ones on it.", "I would not hesitate to go here again - a fantastic hotel!!!\n", "\nThis hotel is amazing. I loved everything about this hotel. Luxury hotel with everything that we call heaven. When I came here, I has some business with my partner, but I hope that was my vacation. The people were really lovely, easy on the eye and so friendly - greetings and a smile from everyone I met. I'd go back there in my next vacation\n", "\nNusa Dua would be the place to stay if you want to just chill out and avoid the hussle bussle of Kuta. We stayed at the Palace Club room which is a very nice room which opens right into the garden. The room has a tub which opens into the bed area. The air condition in the room feels very welcoming after the heat outdoor. The general amenities at the hotel are excellent. The staff are very polite and friendly. The breakfast was really good, you'll be spoiled for choices. The location is right by the beach next to many luxurious hotels. If you want to eat outside the hotel, you can head out to Bali Collection is probably around 10-15 mins walk from the hotel, else you can also order a taxi to get out of the Nusa Dua complex. We would consider staying at this hotel again the next time we visit Bali.\n", "\nThis hotel are located on a very good beach area long side with other 5 stars hotels. The service on the Hotel was perfect from the reception to the rooms. Safe, clean, friendly atmosphere. The beaches are amazing full of sports activities, swimming pools, bars, restaurants, music all day long and shows during the night. It's a perfect spot for a vibrant holidays.\n", "\nAfter I stayed here last April 2012, me and my wife stayed again in June 2012 because we love this hotel and there was a special deal that we couldn't resist. We were amaze that the hotel was given us beyond our expectation *again*. Our room was deluxe room with pool view as requested via internet booking. The bed was comfy and the bathroom was also very clean. Our experience with this hotel was nice, tranquil and comfy. Also, the service was excellent. There were a lot of choices in breakfast and the taste was quite good.", "Overall, I will going back to this hotel someday. Hopefully they will keep the Balinese design, atmosphere & ambience. This is the main reason I kept going back and try to avoid modern / minimalist style hotels in Bali. Also, try to get a special package / deal. Sometimes you can get a great deal from it.", "Visited June 2012\n", "\nWe stay here for 2 nights in deluxe room,very nice and clean hotel let you feel relaxing. ", " The hotel services is very good,they make us feel very comfortable from the first entry to the hotel till we leave the hotel.", " The room have everything,clean and neat and also quite,we stay at the 1st floor no problems with water pressure,nice shower indeed.", " the pool is lovely,and just few step could reach the beautiful beach. ", " Breakfast have variety choice included Balinese and Western.", " It's a nice hotel for families and couples, if you are interested on shopping of cause better to stay at kuta or seminyak ,and if you are looking for a quite holidays,would recommend.\n", "\nWe stayed from 31st Jan-2nd Feb and it was an absolutely beautiful & relaxing stay during those 2 days & 2 nights. Our room was very clean/comfortable and the location was quiet. The morning buffet breakfast has lots of food variety and the beach/pool were very inviting.The staff there were very helpful too, as they helped me to confirm our dining reservations outside the hotel and with our driver to Ubud. I would definitely recommend this hotel to anyone who wishes to stay in Nusa Dua.\n", "\nNusa Dua Beach Hotel & Spa is without a doubt the best holiday I've ever had. The location is peaceful and the sprawling style hotel runs rings around any of the big hotels. The beach is clean and the restaurants, pools, gardens etc are all top notch. The Palace Club was just amazing every day with changing food and the service from the friendly staff was so nice I had a tear in my eye saying goodbye. ", "The swim up bar was a treat and the food and drinks were very cheap and first class. ", "I couldn't fault anything and wouldn't dream of staying anywhere else for a return trip!\n", "\nWe spent from the 15-22 Jan at this hotel we are a family of four with teenage sons aged 16 and 19 and my parents aged 72 and 81. We stayed in three deluxe rooms with two being interconnecting. The rooms were comfortable though a bit tired but more than adequate to sleep in.Breakfast was plentiful with many choices. favourites was the omelettes and the fresh bread selection especially the brioche when toasted with butter and mango jam. The grounds are beautiful and the pools are huge. We loved swimming at the beach and laying on the chairs watching over the sea. On our first night we ate at the Chess Club for my sons 16th birthday and I had prearranged a cake with the hotel from back home which they brought out after dinner with a three piece band and all the waiters singing Happy Birthday though he was embarrassed he loved it. The staff are very accommodating and willing to help you with anything. On most other nights we would catch the shuttle bus to Bali Collection where there is many choices to eat at very reasonable prices also a supermarket for stocking up on drinks and snacks. Another recommendation is to eat at Bum Bu Bali one of the best meals we had .\n", "\nWe went to Bali for our honeymoon in September 2012 and completely fell in love with the Nusa Dua Beach Hotel. We spent 6 nights there before transfering to the Aston Bali, which was such a disappointment in comparison that we left the Aston a night early to spend one last night at NDBHS even though our accomodation at the Aston was already paid for. The hotels decor and grounds were absolutely pristine and many relaxing hours were spent lying next to the Lagoon pool. the buffet breakfast selection and setting next to the ponds was incredible. My wife and I can't wait to return and are literally counting down the days to when we would be able to return to this incredible hotel. Thank you NDBHS, you really made our stay in Bali a memorable one!\n", "\nWe arrived home this morning from Nuca Dua Hotel and spa Bali. We booked and requested a non smoking poolside room. We arrived in at 1am from Perth. we were taken to our room at the back, garden view. The room was filthy dirty with something really nasty on the floor A spill of some kind. over all the room was dreadful, with broken slats into the bathroom from the bedroom, also a damaged shower head .Early the following morning I spoke to the Assistant manager who seemed put out by my complaint. He said\" You insisted on a non smoking room\" I asked if non smokers were penalized... I was told to return after breakfast, he would see what he could do....The hotel was not full at all. I believe they had about 60% occupancy. The assistant Manager took us to a pool side room on the ground floor, in the smoking section. Not exceptable, but we took it. He was trying hard to be pleasant, but not succeeding very well. Staff and grounds were lovely but we will never stay again at the Nuca Dua hotel.\n", "\nThe hotel has very nice interior design with just the right amount of Balinese artifacts without giving it an atmosphere of a temple. The coffee house where breakfast is served is by a pond which is so picturesque. The landscaped garden is really spectacular. The SPA is a bit pricy but worth the pampering. Try to get a garden room on the ground floor. Its lovely to have direct access to the gardens from your bedroom especially to go for your morning stroll prior to breakfast and to enjoy the view of the garden whilst having coffee on the patio.", "The hotel breakfast meats are pork free.\n", "\nMy wife and I just returned from Bali where we stayed at the Nusa Dua Resort and Spa, we stayed in a Palace Club room which opened on to beautiful gardens and pond full of Koi. ", " ", "The room was spacious and for the most part very clean except for a few small cobwebs on the bed head what looked like a small amount of mould in the shower cubicle. The ammentities were a bit of a let down being cheap generic shampoo and condtioner etc. they were plentiful though with shaving kit and tooth brush also supplied, a more premium brand would be far more fitting for a 5 star property though. We ended up buying shampoo from a local shop. ", "The Palace Club (like a corporate club) was excellent with the highlight no doubt being the excellent staff, nothing was too much trouble for them and they always had a warm greeting and smile on arrival. The food was also very good with breakfast, afternoon tea and canapes and cocktails served daily. Definitely worth paying the small amount extra.", "The leaisure facilities were also excellent with several beautiful pools (although they closed very early 7 pm for water treatment which could be done later especially considering it was such a great time to go for a swim). The resort is beach front and the sand along with the water was very clean. It did get to be annoying the amount of people that would constantly approach you to buy local wares (anything from plactic necklaces to sarrongs) while you were trying to relax or sell you another trip snorkeling, surely there has to be a better way of doing this? I also found it a little odd that I couldnt borrow or hire a pair of fins from the hotel and was told I needed to walk down to another resort laguna and that it would then be $10 an hour just to use them??? So hense I went snokeling sans fins. ", "Overall though the resort was excellent I'd give it 8/10 and I would definiatley go back, I cant say the same about the rest of Bali though, Kuta for one is simply filthy and you get swarmed upon by people trying to sell you something or simply to rip you off. Outside of the resort I found everyone to basically to be a liar and a con man. We also went to Jimbaran Bay and was honestly quite horrified at the condition or restauarnts and general hygiene, we felt far from safe walking down the street, especailly with groups of men all sitting on the side of the road looking menacingly towards us, I hoenstly thought we were a moment from being robbed or worse, we couldn't get a cab quick enough to get back to the resort.", "So the qestion is would I go back and it the answer is a qualified yes however I would just stay in the resort and that would be fine!\n", "\nThis Resort is great. Smaller and quieter than most family resorts which is great and although Nusa Dua is generally quieter than Kuta & Legian and a bit tucked away, the free shuttle to Bali Collection every hour from 10am to 10pm ,shopping and restaurants are very convenient to access. Old Nusa Dua is also just 10mins walk which is a small market with more great places to eat..talk about the best of both worlds. We will return without a doubt.\n", "\nStayed at this hotel for my honeymoon. It was a truly wonderful experience. The staff is so polite and courteous.. Specially the staff the the customer service desk deserve appreciation. They did their best to make us feel at home and gave us a room with a beautiful view. ", "The breakfast spread was a delight. The lush gardens and pools add to the beauty of the hotel. Overall, a perfect romantic place to visit with loved ones..\n", "\nFriendly staff Breakfast very nice. Swimming pools lovely and clean. ", "Rooms were spacious ", "Would prefer a balcony that was out of the weather so you could sit and read even if it was raining.", "All the furniture on the balcony was too wet to sit on.\n", "\nWe stayed in the Palace Club wing,was the same with a few new renovations,going for the simplistic feel. The same staff were there 9 yrs on, the diference is the buffets have gone to a fully serviced breakfast and help yourself to the parties and fruit. The afternoon tea is quite generous and you would pay the australian costing for this. The pool is the same but there is no atmosphere in the hotel it seemed as if everyone was lifeless,no one wanted to upset the other very boring,,the pool staff where very rude and since when does it take 4 staff to be sitting and could not careless attitude,this needs to be addressed, The Chess restaurant was very well priced and the menu great choices staff lovely,the pizza bar was very nice as well. It rained whilst we were there and we could not walk to any of the restaurants so room service had to do,but instead of opening the coffee shop and encouraging the hotel guests to go there they hotel was happy to see people clambering for a seat on the shuttle to the galleria..i thought this was quite odd. Good deals to be had at this hotel but the reason is the building going on next door goes on 24hrs a day and it is full on noisy and it is a distraction.\n", "\nHotel was spacious, clean and the hospitality was absolutely great. So very helpful.", "Rooms were very well maintained and the staff looking after them were terrific.", "Resturants were well priced and the meals all tasty.", "Breakfasts were unbelievable with a multitude of delights.", "Highly recommend this hotel and would Love to return anytime.\n", "\nWe have always LOVE staying @ Nusadua area when we holiday in Bali. This time round was no different. We stayed at Nusadua Beach hotel & Spa from 28/12-11/01'13..in a Deluxe 4 room.", "The greeting from the staff when we arrived round 10pm or so was very average with no cold towels to refresh nor a fresh welcome drinks that we often accustomed to by staying @ 5* hotel.", "When we arrived to our rooms, we were very impressed until my husband & I laid on our bed..I meani have slept on a Japanese Futon before & it was confortable but this so certainly NOT that.", "Because we were tired, we managed to sleep very uncomfortably but luckily for our sons, their beds were great..the next day we did mentioned to the staff but no action was taken!!.", "We loved the breakfast & the staff there was very courteous & friendly, the pool was wonderful but not enough sun deck chairs..the cocktails & food was great too.", "We had our NewYear @ the hotel as it was already costed into our package but was disappointed @ the presentation of the evening..the gym was small but enough, the recreational place that supposedly has games for kids was nt even working & they only had 2games..", "Tennis court was nice as well..", "All in all, the stay was average, would we go back again ?? Perhaps , only if we get a better bed or upgrade ...\n", "\nstayed here with my family on dec 2012, ", "+ good price", "+ nice location", "+ great breakfast!!", "+ lovely squirrels ♥ ", "+ clean private beach", "+ beautiful pool", "+ and the staff ? extremely helpful, excellent! ( it was late at nite,n i really need something to buy, but the arcade area already closed, i went to the receptionist then they said for urgent case they can open it for us, and they really open it for me!!) thanks!", "+ the funny thing is after the room boy explain the rooms facilities to my parents ,while my mom couldn't speak english, she only said \"yes - thank you\" :D\n", "\nThe resort bathrooms were the smallest we have ever experienced in Bali,unable to accomodate more than one person at any given time. The shower leaked over the floor and flooded the room whenever it was used. The rooms were also small for Bali.The sleep quality was poor, the beds were comfortable but the noise from surrounding rooms and the slamming exterrnal doors in particular were a problem for us. The noise from slamming doors started at 6.30 every morning which meant our family never slept past this time. The food was good but service rather impersonal particularly given we had a 2 week stay.", "On the plus side the pools were good and the resort surrounds impeccably clean. The beach was nice and the resorts proximity to other hotels very handy.\n", "\nI had attended a conference in Nusa dua in July 2012 and post the conference I had asked my family to join me for a couple of days. A true Balinese resort - great value for money - pleasing service - good food - lovely pool . Overall a great place to wind down. Oops i forgot - they have got a lovely spa. The place could do with a sprucing up , but I am not complaining. I recently stayed at Mulia Bali - a spanking new facility with a ultra premium price tag and it was a terrible experience( you may see my review on it elsewhere in this site). It was then I thought I should give Nusa Dua Beach Hotel & spa a thumbs up. ", "Strongly recommend.\n", "\nWent to Bali for a friends wedding in October 2011. Best trip ever. A group of about 30 of us stayed at the Nusa Dua hotel. The hotel is very traditional Balinese looking. The rooms were nice and clean and the grounds were beautiful. The breakfast buffet was excellent, the congee station was the best! Great hotel in Nusa Dua area and friendly staff.... say hi to Anum, a friendly waiter at the pool.\n", "\nOur first stay at this very traditional and beautiful Balinese Resort (and wont be our last) and loved every minute. Definitely recommend paying the extra for the Palace Club Rooms. The service from all the staff was exceptional and best wished to all the trainees who have been doing work placement at the Hotel - you have great role models! Loved the invitation to attend the General Manager's Cocktail Party - great to meet the GM - Urs and the amazing and very talented Aussie Chef - Geoff Clarke. Great swim up bar with fabulous cocktails!! Free shuttle bus to Bali Collection is always great at all the hotels in Nusa Dua. Looking forward to returning for more relaxation in 2013\n", "\nI am an Indonesian who stayed here in the event of reuniting with my old friends from Canada. And this hotel does not disappoint. It is the type of hotel where it does not look too upscale, but it is very vast. It is not a modern minimalist place, which is great because it still have a touch of Balinese influence to it without being too traditional. ", "We stayed in a room at the Spa wing and it was a huge room for the 3 of us. Everything was prepared immaculately for us; from 3 towels, 3 beds, 3 umbrellas, 3 of everything. It was perfect and the staff are super nice and friendly. ", "The only bad thing was the constant rainy weather. But it made us stay at the hotel more and discover every facilities it has. The spa section is perfect for people who wanted more solitude and enjoy free sauna, steam, even hot and cold jacuzzi. For people who are looking to do serious swimming, hit the spa pool. It is long-shaped and intended for lap pool. ", "However, if you are a family with children looking for some holiday time, this hotel also cater to your family needs. It has 2 children's pools and a koi pond. ", "The hotel is right by the beach so if you don't feel like pool time, go straight ahead and fool around in the ocean. The upkeep they have on the beach and their garden is amazing! ", "You can also jog following the tracks and do a little resort-hopping along the beach, as each hotels are connected through the tracks.", "Overall, it was a great and comfortable hotel without looking too pretentious.", "ps. Awesome and delicious breakfast buffet too!\n", "\namazing stay at the hotel. the warmth and receptivity of the staff started with the booking process and was really happy to get the rooms we wanted ..pool view and beach view with a well connected kids room (see tip).", "the resort has a very indonesian flavour to it and the staff are very warm and hospitable, catering to special requests quickly. food choices are a tad limited for indians and thats the one thing they can work to improve - though they are quick to get you stuff when asked , but nicer to see it on a menu upfront.", "the spa is amazing in that it is the only spa i have been too that plays the generic hotel music ", "in the spa - imagine getting a balinese massage listening to jingle bells ??!!! the staff are good but this is the real oddity.", " ", "overall a very happy stay and the strong ratings they get on tripadvisor are well justified\n", "\nStayed here for 3 weeks and loved every second of it! Kids had a blast! Very family friendly. Bali collection is a 15 minute walk and a great place to eat!", "Pool bar is an added bonus! Loved it and will definitely be back.\n", "\nFamily of four stayed in two double rooms interconnected. Rooms were the furthest away from the lifts which added extra time to go to and from the hotel rooms which was a bit of a pain, especially in the warm weather. ", "Rooms were very average, and clearly this part of the resort has not yet been renovated", "as the rooms were quite old and dated. However, the biggest complaint was that both bathrooms and toilets were never cleaned properly, nor did the bed linen ever smell fresh", "which made sleeping very unpleasant. We did report to housekeeping and duty managers", "but only temporary solutions each time, and the bad smells returned soon after. No offers by resort to offer any complimentary services to compensate for problems in the room.", "Buffet breakfast was very good as to be expected from Nusa Dua resorts, and room service was comparable to pricing within resort restaurants making it very convenient to dine in room", "especially with children. ", "Resort facilities including swimming pools, spa, tennis courts, bike hire, massage were all very good, but it was hard to look past the problems in the rooms hence we probably won't return here in the future.\n", "\nAbsolutely loved staying at this hotel as the staff were friendly and helpful throughout. One of my favourite hotels so far in Bali and on a par with the Westin. We checked out the Laguna also in Nusa Dua and plan to stay there next as this looks like another level higher again.\n", "\nArrived on the 23rd December with family - 3 people.. What a fantastic experience. Stayed at the Palace Suite, a little more expensive but well worth the perks. Staff were wonderful and attentive consistently. The whole Hotel had a beautiful and vibrant atmosphere for Christmas. Had 2 beautiful meals at the Raja's Balinese Restaurant. Will choose this hotel and Palace Club facilities again.", "Collins, Perth.\n", "\nI went with my best friend and decided on Nusa Dua beach because of the great recommendations. ", "It is gorgeous and comfortable. But everything turns quiet at 9pm. Which is a real bore for us as we are going to make babies. LOL.", "So we headed out to the beach (GORGEOUS soft white sand) and tried to fly our kite. We enjoyed though :)\n", "\nExcellent hotel in every aspect! Your stay there will be memorable as a tropical heaven surrounds you and service is more than perfect! If I was about to repeat my journy in Bali, I would certainly choose again Nusa Dua Beach Hotel & Spa.\n", "\nWe stayed from 27 December for 4 nights, 2 interconnecting rooms, 2 Adults and 2 Teenagers. Holidays always bring me pressure. ", "The research I do to pick the right hotel for my family takes me months. I can safely say I got it right again. While we were here we did the mandatory checking of the other hotels, Westin (next door) followed by The Laguana then Melia then around the bay The Hyatt. The Nusa Dua Beach Hotel has a more open feel and the pools are definitely the most newly renovated. I even went down to the Conrad Hilton and the beach down there is not as clean.", "Breakfast was delicious and plenty of selection. The rooms are new and all amenities supplied, free water in room. Staff so friendly and polite. The hotel has a bank, which is very handy. ", "Even though its wet season, we experienced sunny weather with only minutes of rain towards the afternoon or very late at night.", "If we are to return to Bali we would only stay at this lovely hotel.\n", "\nThe resort itself is nice, with multiple food options. The standards rooms aren't that great, we quickly upgraded to the palace suite, which was nicer but still didn't have that \"wow\" factor. At least you got into the palace club, where they had an really good breakfast and cocktail hour (all free). The big thing is Nusa Dua is a little sleepy, and more equipped for families with little kids. We went for our honeymoon and felt Seminyak is a way better area if you want upscale dining and a cooler beach atmosphere.\n", "\nWe had a very nice stay for two weeks in December. The hotel is totally renovated and gives an impression of a luxurious and stylish resort with high standard in rooms, area and restaurants. Very well equipped with high standard even on the beach area witch is not so common in many resorts on Bali. Very child friendly and maybe not perfect for a single couple in the high season if you want to have a quiet holiday. Superb and serviceminded staff!\n", "\nWe were married at this hotel in April 2008 and have returned twice since. We decided to spend Christmas here as it is our favorite place in the world. Staff as always were incredible, welcoming us \"home\" the minute we arrived. We decided to treat ourselves to a Palace Room and were thrilled with the room and value the Palace Club offers you. Afternoon tea everyday is fantastic, and evening cocktales are great! The price of alcohol has gone up in Bali so free cocktales and canapes for 1 hour and a half hours is great value! This hotel is as good as it gets, nowhere else compares. The staff is what makes this place what it is, genuine, kind, helpful and always happy! Its our home away from home and we are already planning our next trip back! We can't reccommend this hotel enough, its the best of the best! If we could give it a rating of 100 we would!\n", "\nI'm a Bali regular who was dissappointed. On arrival we were given a room where the stench of varnish was overpowering, the connecting door was open to a room being refurbished next door. The New room was ok but small. Staff throughout the hotel seemed to treat thier role as just a job, the only people who were outgoing and cheerful were the housekeeping team - now if only they could pass on their cheerfulness to others. The swimming pool was great but you have to be quick, people get down to the pool very early and 'book' loungers using towels, and then hardly turn up during the day. IOverall we felt like we treated as just another number. Our next trip we will be moving on to the Westin.\n", "\nThe NDBH is a pretty good hotel. Not brand new but very well kept. The rooms are very clean and of a moderately stylish appearance. The bathrooms look like they might have had a refurb relatively recently but whoever designed them needs to go back to design school. The bathroom effectively floods every time you take a shower. The gardens are lovely, the facilities and pools of a high standard, and overall we had a wonderful stay during Christmas 2012. I would stay here again, happily. However, two gripes: the food inhouse is generally unremarkable. Pretty good burgers at the Chess Bar and ditto for the pizza at the Italian restaurant. But what you really want in a restaurant in Asia is good Asian food. Sadly, both the Indonesian and the multi purpose Asian - Maguro - are a letdown. Which leads to the second gripe. I asked a staff member for a restaurant recommendation outside of the hotel but was told staff are not allowed to make such recommendations. Pity. Who would want to spend 7 nights eating only hotel food? Staff are permitted to help you get to where you want to go if you know where you want to get to! So, exit the hotel at beach front and walk 10 mins to the right. Eat at a beachside restaurant and bar called Kendi Kuning. Good grilled seafood. Alternatively, get the hotel to organise a car to take you to cafe Surya - 20 mins down the road in Tanjong Benoa. Great seafood. Very good value for money. Nusa Dua is a great place to stay in Bali away from the ugliness of Kuta. Stay at the NDBH. You'll like it. Especially if you're travelling with the family.\n", "\nThe beach and swimming pool areas were very nice which is probably what makes this hotel so popular. Otherwise I felt I was in a business hotel. The place is fairly large and run in a very industrial fashion. No free wifi is always an issue for me. Rooms fairly small despite being given a supposed double upgrade to a palace room. Aircon was good apart from it didnt seem to switch off. Not a hotel I`d go back to, but not terrible.\n", "\nWe resisted returning to the Melia Nusa Dua this year having read the recent reviews, which suggested a slip in standards. Instead we are currently three resorts down the beach at the Nusa Dua Beach Hotel, which got much better reviews following a makeover. This is a stunning resort. The gardens are immaculate, the pools are huge and beautiful and the staff are outstanding. The level of service, even for Bali, is amazing. We have been treated like VIP's since we arrived. We booked a premier room and have ocean and pool views. Breakfast is served in a lovely morning room, surrounded by fish pools, waterfalls and fountains. Best of all, guests have free access to the spa 'lap' pool, which is enormous. Heard the odd grumble about prices in the restaurants and bars - frankly, if you want this level of service, surroundings and safety, there is a price to be paid. Good to see the manager out and about a lot, ditto the Executive Chef. The standards here are really high and the attention to detail is what lifts it above other resorts we have visited. We will be back next year.\n", "\nEverything about this hotel is5 star,the staff, service,facility's etc,a few people complaining about the price of taxis from the hotel,yes there is a big difference in price,but consider this, you walk outside of the hotel save a couple of dollars and you may be getting into an uninsured and or unlicensed taxi, your staying in a 5 star hotel,why would you bother.", "There are four restaurants to choose from, all very nice,breakfast is buffet, and one of the best I have ever seen.", "The spa is amazing, and open 16 hours a day,also adults only, so a very peaceful place,there are also three other pools to choose from,one with a swim up bar.read more reviews if you wish, but you will love it here.\n", "\nI do not have much to say.. I think my heading itself explains everything. From the point of entering to the hotel, to the rooms, food, relaxation, facilities and everything... it just takes you to the level of comfort and relaxation. The hotel location is tailor made for people to just wind down and recharge your soul. We stayed their for 7 nights and seriously there was nothing to complain. The rooms were very clean, the food tastes good and there was a lot of variety and the staff was excellent in attending to your needs. The facilities were very high class and the prices are not that unreasonably expensive. The beach would have been a bit cleaner.. but hey, I ain't complaining. Overall a very good experience.\n", "\nThis was by far one of the best hotels we have stayed at in Bali and we have been to a few ,the staff were very friendly and helpful to our needs, the gardens and pool areas are beautiful . The food was excellent in all the restuarants in the hotel, prices are a little high but no more than what you pay in other 5 * hotels. The breakfast was great with just about everything that you could think of.This is a great hotel for a really relaxing holiday we would highly reccommend it.\n", "\nStayed at a couple of places in Bali and would definitely recommend this one. Lovely rooms, excellent breakfast, great pool, cheeky pool bar, good restaurants at reasonable prices, and lots of little cocktail bars all along the island at neighbouring hotels. One of the most relaxing holidays I've had!\n", "\nThe rooms were decent and we were upgraded after we had complained about the plumbing in the original room. The food was very good however and the facilities were top notch. The only disappointment was the beach facilities which were outdated. However it was an extremely enjoyable stay...\n", "\nHad a wonderful experience here..the staff were amazing and don't know how to say no.. Food was a little expensive but I didn't mind as the sevice was impeccable and the staff just so friendly and you could eat anytime of the day ..the pools were beautiful and the beach so close...will definitely be back as they made our stay just a wonderful experience :)\n", "\nVery clean hotel, lovely beach area's, pool area's where large, good for kids beach pool, breakfast included was very good, room was very spacious, but the best thing was the staff, the service was great, and they couldn't do enough for you.\n", "\nNusa Dua has to be one of the best locations in Bali to relax and have a great night time. Bali collection is super close (shops, restaurant/bars...fun). The area is secure and closed to the Bali traffic. The walk around the hotels is awesome. Perfect location. ", "The hotel itself was just what my wife and I where looking for. Big, roomy, with an OUTSTANDING balcony. Tons of rum and wine was shared on that balcony. Great views, and spacious area. Breakfast at the hotel as great (included). The pool and pool bar was great! Indonesian alcohol prices or though. The kids club is the best deal in this hotel. Free child care for kids 3 and up. You have the option of picking them up for lunch, or order room service (at a price) for them. The same ladies are available to baby sit for a small fee at night. Almost free baby sitting from 9-5 pm! They even take the kids to the pool (pool next to the pool bar). Great restaurants throughout, free wi-fi at the lobby, super clean hotel, AND GREAT SECURITY. ", "Talking about security, I left my safe opened one day, and left the room. The maid noticed, locked the room, and call the management. They immediately locked all access to the room until I personally went to the lobby. It was a bit of work for me to get in, but ALL my valuables were intact. I really trust the hotel staff! Did I mentioned that the area has a security checkpoint and the hotel has another?", "Bottom line, we'll return to this hotel soon. Great and safe location, attentive staff, and awesome grounds. Beautiful hotel!\n", "\nWe booked a deluxe room for our wedding anniversary. Room was wonderful, welcome flowers and champagne but overlooking the construction site next door that operated for 16 hours a day and spot lights 24hrs. So no sitting on the balcony. Room as far as possible from pool and beach. oh and the shower didn't work so washed off in the bath on the 1st night. All this despite very low occupancy. Staff are wonderful, resort beautiful and great breakfasts. Gym was one of the hottest ones I have ever worked out in and they had run out of drinking water. Shower rooms in the day spa missing toiletries or had broken bottles and again so hot almost impossible to get dry after your shower.\n", "\nWe got Nusa Dua Beach Resort as part of a package. I'll definitely go back there again. Amazing holiday, super friendly staff. Away from the hustle and bustle of Kuta. One of the best breakfast buffet's I've had. Most beautiful lobby, you instantly feel relaxed upon arrival.\n", "\nMaybe I'm not the target audience for this kind of place. I certainly only chose it for logistical reasons. Still, I can't imagine staying here again.", "It's basically a monster tourist factory, and the only connection to Balinese culture is that's it's physically located in Bali.", "I was also upset at having the most expensive meal of my whole trip here (at the Italian place by the pool, apparently the cheapest option) where: the food was beyond disgusting (and I'm not a picky person); service was appalling; they got our drinks wrong twice; service was very slow; they forgot one of our mains; you could see them picking something up from the freezer and briefly putting it in a microwave. I can understand having international restaurants here, but not the abysmal quality or high price.", "Main positive: I found the architecture beautiful and there's a clinic on site. ", "Other gripes: ", " - freezing aircon in the room (you can't turn it off - in the fight against climate change, they're on the side of climate change); ", " - lights outside your window stay on til midnight (same); ", " - awful loud music from the lounge permeates your room until midnight;", " - $25 for airport transfer (just step outside the complex and a taxi will do it for $10); ", " - agonisingly slow internet, available only in the lobby - surely this is unacceptable in 2012", " - big breakfast buffet with more unnatural food - eg we tried guessing what juices we were drinking but it was so tasteless and artificial couldn't get close.. ", " - bathroom door is very thin.", "I suppose if you just want your kids to have a swim in the pool and to get some sun, then it's OK, but a Balinese experience it ain't, and as Western experiences go it was unpleasant.\n", "\nWe stumble upon Nusa Dua Beach Hotel & Spa from booking.com and there was a good deal. Without any hesitation, we made our booking and looking forward our stay at here. We were surprised upon our arrival at the hotel, the hotel is HUGE (we didn't expect it because we made the booking at very last minute, thus didn't do much research on this hotel) and they have good services, spa, lounge, beach and many more. We spent half day to explore this area and the hotel. I love everything, every corner of this hotel. Greenish is every where, and the weather was really chilling.", "Breakfast was variety and good. We stayed for 3 days and throughout the days, we were happy with their services. Room was a bit far from the lobby but it doesn't matter to us. Is good to walk while we have the chance to pass by all the great scenery and greenish plant. Our room was big enough, with a balcony. It would be great if they have a bath tub. ", "Overall, it was definitely a good stay and we will come back again.\n", "\nWe spent 1 week at Nusa Dua Beach hotel in early Nov 2012 in a Deluxe room.", "Arrival - Naturally the security is high to enter the Nusa Dua area but fairly straightforward checks and the guards were very polite. As you enter the resort, the lobby and grounds look amazing. Check in process smooth enough and escorted to your room.", "Room - The room was a decent size for the 2 of us. Plenty of space to store our clothes and room for our 2 large size suitcases. The decor and general feel of the room is nice and ambient rather than standard decor from a chain hotel. ", "Biggest downside which probably stopped me giving 5 marks was the bathroom. Although it is spacious enough and kept me in a clean condition, the shower screen is tiny and as a result a lot of water ends up splashing on the other side of the bathroom. Becomes a pain after a while no matter how much you try to control the water pressure.", "Resort - Lovely pools and plenty of sun loungers...... a nice little pool basketball area too which I quite enjoyed. Other facilities were good as you would expect from a 5 star resort - games room, business centre etc.... The housekeeping and staff in general were very friendly wherever you walked. In particular the housekeeping were very polite and always left the room beautifully clean during the morning and evening visits.", "One other downside would be the Wi Fi coverage only being available in the lobby. Perhaps this is the usual amongst all the resorts but still found it quite a pain for a resort of this size.", "Dining - Breakfast buffet had a decent variety and the freshly cooked eggs/omlettes were tasty. Naturally, you do get a little bit bored after a few days but then isnt this the case with most breakfast buffets?", "We had lunch a few times from the pool bar;s etc.. the pizzeria was nice, and dinner at Raja's Balinese was lovely albeit a bit pricey but to be expected. Our other meals tended to be at Bali Collection which had a lot of options, but unfortunatley each place we chose resulted in just mediocre average meals. I do feel that we were very restricted in dining options being in Nusa Dua. The best meal of our entire trip was when we did a half day trip to Jimabaran Bay.", "All in all a great resort which ticked all the boxes for us in terms of relaxing and luxurious holiday with friendly people.", "I'm being picky but the bathroom situation, wifi availability and perhaps lack of too many local decent dining experiences stops me from giving 5 out of 5.\n", "\nNusa Dua Beach Hotel & Spa was an excellent place to stay. Our room was very clean, bed was super comfy. Bar fridge was always fully stocked! Air conditioning was amazing! Frangapanis on the balcony were beautiful and the little squirrels were a delight to watch on the balcony and around the garden. Great pools! The staff were super friendly always stopped to say good morning or hello without hesitation. Couldnt pick any faults, they were all very friendly. If i had to go back to Bali again one day i would definitely be staying here at Nusa Dua beach Hotel & Spa.\n", "\nI have stayed in this resort a few times in the past and have always loved the experience. This time I invited two of my friends from the UK and Hong Kong for their first holiday in Bali.", "We stayed for 4 nights and 3 days. Room rate was at USD 180 which I thought was alright given my good experience, recent good reviews and the fact that it is a 5-star resort.", "Locationwise, it is quite close from the Nusa Dua Resort gate (so it's easy to remember the way). Nusa Dua itself is a bit far off from other areas such as Kuta or Seminyak, but the area is very well kept, secure, clean and very nice.", "Upon checking in we were upgraded to the Royal Palace Club room. The lobby was very spacious and airy and decorated in a modern Balinese style. The staffs were very attentive and kind and gave us 3 welcome drink vouchers. We were placed in the room overlooking the fish pond on the ground floor that has a spacious balcony.", "Room was very spacious and decorated in a truly Balinese style. There is no wifi in the room but there is a high speed wired internet connection. TV is large and has great selection of international channels. The bathroom was very spacious with separate shower, bathtub, and toilet which were very handy given that there were three of us staying. In the morning we have a pleasant surprise to see some squirrels outside our garden (we eventually bought some peanuts and fed them, very funny experience).", "Breakfast was great with plenty of selections. The fish pond on the breakfast area was quite entertaining and I saw some kids and the staffs fed the fishes with leftover breads. There were many beautiful ornaments and a fountain - good photo spots for my tourist friends! There were two swimming pools, one with a mini basketball ring and a net (for watersport). The other one has a depth of 2.8 meters, which I truly liked, and there was a bar in the middle of the swimming pool too.", "The beach is nothing to boast about, it's very clean and quiet (hardly a wave), but it's good to relax by the beach or walk around the shallow lagoons. We walk to some other hotel/resort along the beach too.", "The resort is vast and the gardens are very beautiful and well kept, we nearly do not want to leave the resort!", "My friends definitely enjoy the experience and trust me, staying at a beautiful resort such as the Nusa Dua Beach Hotel definitely gives your Bali experience a good boost. I would recommend this to anyone who would like to enjoy traditional Balinese architecture and great hospitality, beautiful resort and take advantage of the swimming pool and the lovely garden.\n", "\nWe had our wedding at the Nusa Dua Beach Hotel and Spa back in September 2012 and we fell in love with the place. ", "The rooms were cleaned and mini bar was stocked everyday. We were amazed at how many rooms there were. The bed was so comfy and I really enjoyed my regular visit from the local squirrels. ", "Our wedding coordinator did a superb job and organised our wedding for us. The staff went the extra mile for us and regular made sure we were ok. The staff are so friendly and welcoming too.", "The food was lovely and you will find a wide range of food served for breakfast to suit everyone. ", "Staff can be found regularly cleaning, serving, helping guests, gardening or maintaining the resort. ", "We chose the right place for our wedding and stay as we though the other hotels in Nusa Dua area was too modern. Nusa Dua Beach Hotel has got the perfect balance of modern hotel whilst still maintaining the traditional Balinese style. ", "\n", "\nI went to this hotel over 10 years ago. It was an ok hotel in comparison with other beautiful five star hotels in Nusa Dua area. This year, after their renovation, I saw a different Nusa Dua Beach. The hotel is fresh, beautiful, with gorgeous buffet selection for breakfast. The guest room is very comfortable and spacious. The bathroom with rainfall shower is very nice and soothing. The service of the staff made our stay even more comfortable. We checked in very early in the morning. The staff at the front desk offered us to have breakfast first while waiting for the room to be ready. The night before they just had a large group staying in the hotel, so they were running out of clean room. It was just a nice gesture to let us in even we were 5 hours too early from the allowable check in time.\n", "\nand in case you missed it - recommended! This is by any measure a great property and a great experience. We stayed here a week and I’m having a hard time coming up with anything that was negative about the experience. From checking in, requesting another room which was immediately granted (no fault of the hotel), the pool, the restaurants, the food, the rooms and room service, the beds, the setting, the quiet music at the pool / lounge / bar, the service - and not the least the smiles at all times - it was a great and very relaxing experience. We were looking for a place to relax and kickback - and we got exactly what we were looking for. ", "I can only recommend this property. If and when we get to this part of the planet again will make an effort to come for a second stay.\n", "\nI’ve travelled to Bali for over thirty years, staying in Ubud, Lombok, Seminyak, Legian, and Nusa Dua, and this had to be one of the loveliest holidays yet. This was our 25th wedding anniversary. We actually MET on Bali. We had a beautiful ocean front room and were delighted.The staff are beyond lovely, they make you feel that each and everyone is an extra special guest. The Fitness Centre was never crowded and there are three pools to choose from. The grounds go on forever and we decided to hang around the property most of the time. You can walk along the beach in the evening to see what the other hotels are serving for dinner if you want a change or instead of going to Bali Collection. Bali Collection is overpriced for shopping and you do not want to go into Kuta. Repeat, you do not want to go into Kuta, it will spoil whatever beautiful Bali that is still preserved.\n", "\nNusa Dua is a bubble far removed from the \"real\" Bali. It would not be my first choice of places to stay on personal travel. But I was working, and the Nusa Dua Beach Hotel is a beautiful facility with outstanding service.\n", "\nI don't normally write reviews but I felt compelled to praise Nusa Dua Beach Hotel for giving us the most amazing honeymoon.", "We stayed for 6 nights in a deluxe room and were made to feel so special from the moment we arrived. ", "The room was lovely, bed was so comfortable, shower great and the air conditioning much welcomed after a week of travelling in the jungle in Sumatra!", "We loved both the pools and the beach and we thought the food was superb.", "Admittedly it is expensive, but nothing you wouldn't expect for a 4-5 star hotel in such a wonderful location.", "The staff were so attentive and welcoming and were definitely one of the main reasons this hotel is so special.", "We couldn't have imagined a more perfect setting for our honeymoon.\n", "\nStayed 3 nights:", "The Hotel grows on you the longer you stay. I cant even imagine how much money it would cost these days to build such as a hotel as the details in the woodwork, carvings, floors etc...are amazing. This is a richly constructed marvel.", "Very nice breakfast buffet, very nice rooms, very nice pool area...nice spa as well.", "On Tuesdays they have a buffer dinner with a traditional dance show which is fantastic.", "The restaurants are good but overpriced, especially the wines. IMO, prices should be at least 25% cheaper.", "My only negative would be the kids club...we had a serious issue which I will not get into, but this is NOT a hotel to trust your kids to...Club Med are the pros in this field.\n", "\nI stayed here in 2011 and the resort made a mistake by giving us a one bed room versus two beds. We had to stay in that room for one night. The beds can be separated. But the room configuration doesn't really allow for much room to do that. The resort then moved us the following day and we received a two bed room with an ocean view. absolutley stunning! very nice rooms. ", "unbelievable breakfast buffet! and all the restaurants were great.", "the entrance lobby is overwhelming as it's open and lush and elegant. it's surreal to be in such a beautiful place, the resort, the people, the island. ", "but it is the spa that there is not enough room for me to rave about. i went to Bali not knowing about the enormity of it's spa industry. talk about a surprise! when i came to relaize the prices vs. the value i was booking a spa appointment for the early a.m. and then late evening. the days were long with sight seeing. so this by far set the day up and allowed for a restful sleep. the 4 & 1/2 hr treatment was a spiritual and indulging experience. and the four hand massage after hours of walking in the late evening in an open air room was just fantastic! ", "the customer service exudes from each and every employee. ", "the location is within \"walking\" distance (depending who you are) to the market and some restuarants. ", "the beach wasn't anything to boast about. but walking in the water on the other side of the world is nothing to complain about ever! ", "Bali is a once in a lifetime trip. Ideally twice! The people do not have much so it's an enlighting experience for us folks form the states. But even though they don't have much, they seem to really figure out how to have everything! ", "LOVE BALI!\n", "\nOur stay over 5 days was excellent. The staff were extremley curtious and helpful. ", "Many thanks to you all who made our stay so enjoyable and relaxing. You have a well managed hotel in a great setting. My wife and I hope to return in the future.\n", "\nWe had our honeymoon last year in Bali and stayed here for 13 nights after being in ubud. This was our relaxation and it was everything we expected. We opted for the palace rooms which had their private gardens and dining clubs. We had certain perks, amazing breakfasts, free afternoon tea and cocktail hour. These were so good we arranged our days around it. The staff were fantastic. And we were sad to leave. The beach although not that picturesque was clean and lovely to stroll up and down in the evening.\n", "\nPerfect location set in beautiful grounds.Pool area and beach ideal and very well kept with no shortage of sun loungers. Breakfast was very good with a good selection to suit most tastes.The staff were extremely friendly and helpful and service was good although service at pool area was a bit slow and could have done with a few more staff.Booking in and out was quick and efficient..It is a beautiful hotel in a beautiful place ,very peaceful and relaxing.We have just had our second holiday there and intend to go again in the future.\n", "\nVery nice hotel, good prices and infraestructure, good amenities. very very good pool. nice beach in front of. We enjoyed very much! Excelente breakfast. the staff is very gentle! Just one thing, try to don t have your meals in the hotel restaurants, the quality is not good, and prices are expensive!\n", "\nStayed 9 night at Nusa Dua Beach. Upgraded to Palace Club was worth the money. Breakfast was very good, lots of pastries and fresh fruit along with hot items, eggs benny, omelets, pancakes and traditional foods. Afternoon tea was also great and the scones and sweets were very good and presented very nicely. Evening coctails (2) each and appys (6) were some of the best I have had in a long time. Had most of our evening meals at the resort, it was all very good. Chef Clark does a great job. We had the traditional duck one night and we also had the rice tasting menu all was very good. As you can tell it is all about the food, as I work as a cater. ", "The resort was very clean and the attention to the little detalis were great. The pools were nice, there was always a chair around the pool. ", "The SPA was wonderful we had two treatments. The last treatment was a 3 hour couples massage with a flower bath and refreshments. The ladies are very professional and the rooms are very clean and nicely decorated you feel very relaxed after ther treatment. Highly recommend the spa.\n", "\nthe hotel is beautiful and huge, everything from the landscaping to the many gardens scattered everywhere was nice. food is amazing, breakfast was really good. The place where you eat breakfast was wonderful. your surrounded by ponds with full of colorful koi fish. The staff were so friendly and helpful. the room was really nice. THE swimming pool was amazing me and my family spend allot of hours there swimming, they have so many activities around the pool area and the pool it self. They have 3-4 different pools each one being nicer than the other. Overall amazing hotel. I can say this was my favorite hotel in nusa dua and Iv seen the other hotels. Thank you Nusa dua Beach Hotel & Spa for making my trip and my families trip and eventful and happy one .\n", "\nBeing a fan of Nusa Dua, I've been looking for the winner across the beach line. Honestly, I never think Nusa Dua Beach would be my fave as I try it on 6th after Sheraton, Nikko, Novotel, Ayodya and Melia.", "It is not the grandest, nor the most luxurious room or best breakfast-buffet but I just love it. The hotel meets our family priorities are: price, beach, room, pools, room-to-beach distance. And of course, those chip'n dales are really adorable. ", "Service is excellent, DEFINITELY WILL RETURN.\n", "\nWe stayed for 3 nights in a Palace Club Suite. Our suite was lovely, big, clean and inviting. The king size bed was extremely comfortable and we slept extremely well. The balcony overlooked the pool and the beach. There was plenty of space for bags. The bathroom had both a bathtub and a separate shower, the shower had good water pressure although it had a rain shower head which I don’t particularly like.", "All the staff were friendly and helpful and each day our room was made in the morning while we were out. ", "Paying the extra for a palace club room was good value, especially as food & alcohol in particular was expensive for Bali. The palace club lounge had a lovely undercover outdoor area for complimentary breakfast, afternoon tea and evening drinks and canapés served between 5.30pm and 7.30pm.\n", "\nWe stayed in a deluxe room for four days. Our room was fine although others in our party had rooms that were extremely small and disappointing for the money paid. The breakfast was good, with a large selection of choices. The breakfast service was slow and at times seemed understaffed for the number of guests. This is a very large hotel. Drinks and food at the hotel are very expensive by any standard, anywhere in the world..... and compared to meals and drinks outside the hotel.... extremely expensive. There is a large selection of restaurants within a short cab drive from the hotel. Do not get a cab from the hotel they add 60% to the fare. Walk a 100 feet to the parking lot on your left and get a cab from the cabbies waiting in the parking lot. The grounds are very nice and well tended and the housecleaning staff was excellent. The internet is horrifically bad and wireless is virtually non existent in any of the rooms. You are in trouble if you have an Apple product. In order to get wireless you need to sit in the open, non air conditioned lobby. Ethernet connection is available in the room for $16 per day and the hook-up is terribly slow and we needed to spend over an hour on three separate days just to get a viable line in order to do any business that required download of files.. What a frustrating waste of time! This is really unacceptable for a luxury hotel of this caliber that also caters to business travelers as well as vacationers. Internet is a fact of life and certainly available in Bali, as we had excellent service in our other hotel.Although the grounds are nice, I did not feel that we received the value for what we paid...over $250 US per day just for the room. We would not return to this property, no matter how pretty the pictures.\n", "\nFrom the moment we arrived we were made to feel special. Everyone of the staff were courteous, helpful, friendly and kind.", "Our room was clean and modern with everything you could need for your holiday. The hotel has a couple of great pools to swim in and several restaurants catering for different tastes. The breakfast was amazing and the omelettes are a must to try. bars and restaurants were more expensive than elsewhere in Bali but I guess you pay for the wonderful surroundings and location. Other five star hotels are just a short walk away along the beach. Only a cheap taxi ride from the airport, $7-8 depending on the traffic so don't worry about per booking transfers. Highly recommended hotel\n", "\nStayed at the Nusa Beach Hotel on the 22nd Sept to the 29th Sept,2012 Loved the place. Staff always ready to help and always have a smile on their faces no matter how busy they were. The rooms were huge and very clean. Our room faced the garden view which in my opinion, was even better than the sea view. Each room has a balcony, so you can sit out and ejoy the beauty of the balinese landscaped gardens.I wish I had a garden like that! In the middle of the pond, there is a balinese gazebo complete with a sofa set where one can sit to enjoy watching the ducks \"gliding\"by or feed the fish in the pond.", "Restaraunts are good - Manguro has beautiful fusion food,.. try the Korean BBQ... you get wayu beef, so tender & juicy, among other meats which you cook on your own BBQ stove. Pizza there is just as delicious and of course, their Balinese food is fantastic. All for a reasonable price considering we were in a 5 star Hotel. Free WI FI Internet, lovely pools and great buffett breakfast. All in all, a great hotel with great service. will certainly go back again.\n", "\nJust returned from 10 days relaxing holiday at this hotel. We stayed in a deluxe double room which although not the biggest was adequate and clean.There was a balcony with chairs and tables that look out to the sea and pool area. The air conditioning in the room worked really well which was always welcome when returning to room after hot day.", "The staff at this hotel very always very friendly and helpful, without exception.", "The pool area was excellent with with an area of grass and trees between hotel pools and sandy beach. We spent most of our time here under the trees lying in the sun with just the gentle breeze off the sea. It was paradise!", "The beach is private and had very little bother from the small amount of authorized local sellers.", "There is a walk along the beach front past all the large hotels and if you follow this a little further there is a small shopping / restaurant area (Bali Collection), where you can buy the usual tourist souvenirs as well as a couple of supermarkets for snack etc.", "Taxis can be taken into Kuta (around 15km away) and cost around 9 USD.but take one from outside hotel, as hotel adds a large surcharge if booked with them.", "The Breakfast buffet was excellent. Lots to choose from and always plenty available.", "We plan to return again very soon.\n", "\n5 star hotels often charge a lot and they see their clients as $$$! Well, there is nothing wrong with offering excellent service and ask for the price but of course it is very important to offer such service with friendly staff and values. having stayed in such hotel you expect a high quality internet service not a free wifi in the lobby! the staff are not so warm compared to the other one which we stayed in Bali and not that much friendly. Many just expect how to make you a paying client and how to serve you at the maximum charge! the hotel was clean, beautiful and memorable but except the excellent breakfast we were not so happy with the other meals. The room was so cold even with having the A/C off! nobody could fix this problem!", "If you want to take the taxi from the hotel it costs you over 300% so ask the taxi control to call a taxi for you from outside.", " In my opinion, many 5 star hotels got used to high charges but gradually forget about their differentiation and usually they do nothing different than an ordinary hotel which is not expected to offer you much. At least in non 5 star hotels you don't pay much and don't expect much even but mostly they offer better services. If you give a tip to a bell boy he will be very glad and thankful but in 5 star hotels this is your duty!\n", "\njust returned home last night, we spent 4 lovely relaxing days at the hotel, there was enough for everyone to do, my older son (13) went wind surfing, played volley ball, swam, played ping pong, squash, billiards, we couldnt of asked for more, our youngest just swam all day! at night its just a short stroll to some lovely restaurants if you dont want to eat at the hotel, we did do one night where there was traditional dances and baba guling, soooo delicious. staff were absolutely lovely and our room was very practical for our family (duplex room for 4). we will definatly be returning and hopefully for longer as nusa dua is the best area of bali we have been to.thanks to all the staff for making our holiday a delight.\n", "\nStayed over 9 nights for doing some official works, I occupied a room and moved up to 3 times in different room, pleasantly! A great delicious breakfast -western and asian options available and a fantastic private beach with tranquil, warm, and glimmering sea water. And thankful, the hotel has a mini mosque, so it making easier for me to pray.\n", "\nThis was a short stay for our wedding anniversary. We stayed in a club room. Check in was late in the evening and staff were very welcoming. A lovely arrangement of flowers was in our room and staff all welcomed us with well wishes which was lovely at meals and in the club itself. Absolutely fantastic to be able to go to the club at any time and have a fresh squeezed fruit juice. Delicious :) Breakfast was very good although cocktails in the evening were fantastic, food was a little sparse. Afternoon high tea was lovely. Spa was pretty good though not too sure about the open rooms and would certainly be a problem getting to spa rooms in the rain. The pool area attached to the spa was a welcome retreat from the bustle in other areas. Meals there were very good. Meals at Chess on the beach also great and was lovely just to sit in the cool breeze and see the ocean. Our stay was slightly tainted by the illness of my father who passed away the day after our return so possibly another stay may be in order to fully appreciate the hotel. We did go there independently recently in October to have another look whilst staying at another hotel and enjoyed the two meals we had on the beach so we may be back very soon. Thank you Nusa Dua beach hotel.\n", "\nJust returned from our second visit. The service and the hotel staff were fantastic and I really belive this has to be one of the best value for money resorts in Nusa Dua. We were only staying in the deluxe rooms which more than catered for our requirements. We had most meals at the hotel which were incredible. Spent a lot of time at the spa pool and made the most of the sauna, cold plunge pool etc. - really invigorating. Plenty to do for all. If you are wanting to just relax and are not into the rest of the hustle and bustle of Bali, this is perfect. A very big thank you to all the friendly staff, especially on the one day when I was not feeling too well and was sent flowers and had follow ups the following day to check on me.", "Highly recommended.\n", "\njust returned from 12 nights at the nusa dua beach hotel and spa.great service good food, make sure you book breakfast with your package its well worth it fills you up for the day as there is nowhere local to just nip out for breakfast. Steer clear of the market in ubud its full of rats. there's a lot of building work on the roads so traffic is very bad. hundreds of scooters, 4 on each!!\n", "\nWe went here for our honeymoon. The room was perfect. The grounds and view from the room of the lake and gardens was serene. Was pleasantly surprised by the ducks and squirrals that live on the grounds. The staff were super friendly without being over the top and intrusive. Breakfast was great and plenty of it (a la carte as well as buffet if you are still hungry) - Western and asian/indonesian options available. Delicious freshly squeezed fruit frappes all day. Afternoon tea - free. Cocktails and canapes - free. Once they found out we were on our honeymoon they gave us some complimentary drinks in our room. There is a morning room service and a turn-down service in the afternoon. The pool is heated and huge. 15 min walk to shopping centre (bali collection which is more western in that the prices are fixed and there is no aggressive sales people) and art museum. Take a 2 min walk to the road outside the resort and get a better rate on cabs. We hired bikes for about $7aus for an hour for two. There are about 5 resturants in the resort. We ate at two, there is one which is authentic Bali fare which was ok but would have been nice if they told us we would be paying $3 per bottle of water and $10 for corkage. The beach is pretty poor and in August has lots of sea urchins (?) and no waves at all. But the pool was great so no big loss. All in all I loved this place and I guess it's true when they say 'you get what you pay for', because at $300 a night I would want to have a perfect stay :)\n", "\nWe stayed at the Nusa Dua Beach Hotel & spa from 15th to 21st September for our silver wedding anniversary. We chose the Hotel as we had spent part of our honeymoon there 25 years previously! Obviously we were concerned that things would have inevitably changed over the years but it was all for the good! We were greeted with smiles when we checked in, and shown to our room which was very well appointed with a lovely view from the balcony. We were surprised to be presented with champagne & a beautiful flower arrangement and a card with best wishes from the Hotel, such a nice touch which we really appreciated and made us feel very special. Breakfast at the hotel was plentiful & varied with something for everyone. The grounds were beautiful & spotless. Staff were always pleasant & courteous, from the front desk to the room attendants, the gardeners & maintenance staff we couldn't fault them. ", "The beach was beautiful, the only downside was so much seaweed! ", "It was nice to be able to walk along the beach via the pathway which goes all the way down to the end of the beach passing all the neighbouring Hotels. We stopped to have a drink & sandwich at the Pirates Cove restaurant which was very nice & very reasonable. ", "We would definitely recommend the Nusa Dua Beach Hotel & Spa and can't wait to return!\n", "\nBeautiful resort with very friendly staff. Breakfast buffet excellent though got a bit boring after 7 days. Only fault, beds way too hard. Spacious rooms. Excellent location if you are keen to walk. Always transport at hand if you need. Great location. Only a short stroll to local restaurants. Had a great stay there, would definitely recommend\n", "\nJust returned from staying in a Palace Suite for 7 days.Our second time at this Hotel amazing surroundings, staff,food and accomodation.The Palace afternoon teas and evening cocktails are special overlooking a picture perfect garden and lake.We would highly reccomend this Hotel and we will definately return next year to once again be enveloped in the warmth of the beautiful Balinese people at this hotel.\n", "\nTotsl relaxation is the order of the day, friendly and helpful staff, clean rooms in great location .quiet area, walking distance to shops and restaurants although plenty to choose from within resort, . Will definitely be going back.!\n", "\nJust as it says on the hotel website, we went for our nieces wedding and what a setting it was lovely tropical oasis surrounded by beautiful flowers and greenery, There are two lagoon pools one with the idea of a beach setting, the temperatures were heavenly just like getting into a warm bath. The rooms are very spacious with a very large bed!! walk i shower with complimentary toiletries. tea and coffee making facilities. lovey balcony to seat on to take in the views of the sea and beach and of course the gardens. The hotel also provides a buffet breakfast which was fabulous with made to order eggs and omelettes, plenty variety of pastries, cereals, fruit ,yoghurts it caters for everyones taste. There are different resturants that do a variety of local balinese cuisine and italian. And if you want to get married there what a fantastic venue, and the food for the receptions yum!!Friendly staff, free transfers to the local shopping mall\n", "\nWe just got back yesterday after spending a week at this resort in the Palace Club. We al had an amazing time and was very impressed by the resort and staff. I am a very frequent traveller to Bali, (this would be trip 51) so I do have very high expectations. In the past I have spent alot of time at the Westin resort however, although beautiful it no longer has a club and def. is going towards families with small children.", "The Nusa Dua has just completed a renovation which I thought was done well. The Palace Club was amazing, beautiful set up and excellent service. I thought they could have had a few nuts or cheese on offer during the day, however this is a very minor thing.", "Cocktails were great so was the afternoon tea. One staff member in the Club really stood out with her service and friendly nature. Her name was Supadmi and I truly have to thank her because she went out of her way with my family and our friends to make the stay memorable.", "Overall I will def. be back next year and would highly recommend this resort.\n", "\nPro(s)", "1) Nice landscape", "2) Ideal for family vacation", "3) Good service", "Con(s)", "1) A bit gloomy especially with few Balinese carvings in the room", "2) Quite a distance from the city", "3) Room was quite run down (at that time)\n", "\nWe stayed at the Nusa Dua for a week in a Club Room, the room was very good, restaurants very good and the staff were delightful. If you cant relax here you might as well give up. But dont be seduced by stating in the hotel as there is so much to see and do in Bali you have to get out and see it.", "Surfing, Volcano, Coffee Plantations, Bars, Temples get out there and take a look. The wonderful thing is when you return youcan lick back and relax all in all Bali is beautiful the hotel is very good.\n", "\nThe hotel has amazing architecture with a touch of Bali in everyway with even the staff dressed in true Balinese attire. Its a big beach property. The grand entrance, lobby, breakfast area, the restaurants, the rooms...everything is perfect!!! there is a beautiful temple in the hotel gardens and they perform pooja there every evening. ", "We booked a premier room, located on 1st floor...the rooms are spacious and clean. the balcony had amazing garden,fountain and pond views. ", "The breakfast area was gorgeous too with the lovely sound of slowly flowing water, fishes swimming around in the pond, greenery all around. the breakfast was perfect too with so much to choose from. wide selection of cold & hot food. ", "There are 3 pools:one has a bar, one has a volleyball net, and the 3rd a basket ball thingy. Too much fun to play pool volleyball.", "The hotel has loads of facilities like beach volley, table tennis, lawn tennis, water sports counter, squash, gym,water aerobics, yoga and much more. most of the activities are paid tho except the gym,table tennis and beach volley. ", "The food was good but obviously expensive 'cz of this being a 5 star. Wine was super & unreasonably expensive!!! ", "All in all, amazing hotel. The area of Nusa Dua is only 5* hotels and its a beautiful area absolutely neat & clean, private and away from the hustle bustle of Kuta, Legian and Seminyak.", "They are too crowded but ur the party types then those are the areas for you, sply Kuta.\n", "\nLarge resort in balenesian style, we booked the premier deluxe room and had a nice comfortabel room with a terrace. View on swimming pool and a little bit further the sea. Staff, room, pool, breakfast was all good.", "Personally I would only stay in nusa dua to relax after a trip in bali. This hotel is perfect to spend your stay and relax. I would also recommend the indonesian restaurant, prices are western but you get high quality food and a nice dining experience.\n", "\nNusa Dua is a quieter location away from the hustle and bustle. There is ample security at this resort making you feel safe and secure.", "If you want peace, this is the place to stay. If you are looking for a party-like holiday with clubbing/barring, hustle and bustle, stay in Kuta.", "Loved this hotel from the minute I got there. There was a very warm welcome and greeted by very polite staff. Checked in quite late in the day, arrival admin was completed very quickly.", "Stayed in the Premier Room, was fantastic view of the pool and part of the beach, beautiful. The guest relations couldn't do enough, i think her name was Yemi, she was exceptional with advice on things to do and did everything she could to make this a relaxing break for us.", "The room was large enough to spread out, ample for all needs. ", "There were 2 main pools in addition there were child/baby friendly pools, so expect some comotion, but peaceful enough. ", "I found the Spa facilities lovely, there is a spa pool located near the front end of the hotel, near the gym. It has relaxing music while you are swimming - lush. Also used the gym with plenty of equipment, there are also squash courts, pool tables, tennis courts, you wont be disappointed. The staff there are also very friendly and will be happy to be at your service.", "We were so relaxed here that we ended up missing our flights back! The hotel were (Guest Relations) were kind enough to help out wherever they could when we were having to check out at speed.", "The only negative was leaving this place.\n", "\nNusa Dua area is an excellent location. The rooms were fantastic and clean. The Breakfast was as i expected. Being a vegetarian there was range of food we could have for breakfast. The only negatives was that i got charged to go and clean up a wound at the hotel clinic which incurred playing volleball. I did not expect to get charged for that. I thought the hotel food prices were quite pricey so we went to an Indian restaurant every single day.\n", "\nThis is my third time at this hotel. I stay in the palace wing which is excellent. The staff can't do enough for you. The rooms look out over beautiful gardens and fountains. It is a very relaxing place, where you can do as much or as little as you want. The restaurants are excellent. I would thoroughly recommend this hotel to anyone.\n", "\nDespite the title we did have an overall enjoyable stay, credit to the build of the hotel and location. We went with my parents and our 2 kids (4 yrs and 2 yrs). Our room was spacious and had all of the modern convenience. View wasn't too bad either (garden view). A big plus was that our bath towels were changed twice a day (a god send in a hot climate when you like a clean room to come to after creating a mess after the pool or beach visit). Also, the grounds were amazing in terms of architecture, tradition and landscaping. Nusa Dua Beach.... priceless location (we stayed at the Westin next door a year ago and this is our second visit in 2 years).", "HOWEVER, the staff at the breakfast area and around the poolside area were so nonchalant and rude, that sometimes you didn't know whether to laugh or be exasperated.", "We found that we practically had to wear flashing lights and make frantic gestures to get someone's attention at the breakfast buffet. When that didn't guarantee their undivided attention, you had to physically get up and block their path of zombie like inattention. Sometimes they would turn their back to you halfway when you were still talking to them. Unbelievable! All this just to order tea and coffee and to remind them that we need milk for our beverages!", "There was one incident by the poolside when I ordered a meal and drinks. When he came with empty glasses without ice, I politely asked him if we could have some ice. He paused, looked at me in disbelief that I was making him go back to the bar for another journey and said to me, \"I asked you whether or not you wanted ice or not and you said no.\" I apologised for the miscommunication whilst he glared at me. He came back again with the ice. I thanked him and then I said I had forgotten to ask for drinking straws for the kids, but don't worry, just bring it with the food later. That was a big no no. He actually stood there with his hands on his hips, let out an exasperated sigh and then shook his head in disbelief that this imbecile of a tourist couldn't remember everything in one go. He acted like I had just asked him to massage my feet and spoon feed me by the pool side. I thought I was paying the resort for a service - someone should remind him of that small fact. Wish we had taken down his name. ", "Oh and I have to mention the bath/shower unit. Whoever designed it should be shot. Every time we showered, water would flow onto the side and onto the floor. And it wasn't a new age funky open shower concept. No one likes to go to the toilet slipping on tiles and squelching on a oversaturated bath towel mat. My parents room had the same problem. And I was talking to other guests at the resort - same problem.", "Gecko Kids Club was interesting. At any one time there were maybe one or two kids there. 2-3 very nice ladies would staff it. On one particular occasion my daughter was excited that a baking class would be scheduled. We got there, but as there was only one other girl there, the ladies explained that there would be no baking class as that would only happen if there were more than 5 kids there. I got news for you lady - you never have more than 5 kids there! So my daughter ended up doing scintillating jigsaw puzzles for the whole hour. Another time a sand castle competititon was scheduled, but guess what, only my daughter was there - no prizes for guessing what she spent the next hour doing. The ladies explained to us that there was no point doing a competition with only 1 kid there. Read my lips - IMPROVISE and show some INITIATIVE!!!!", "Obviously we compared our stay with the Westin Nusa Dua and can say honestly, the service and Kids Club at the Westin is miles ahead. We will definitely return to Nusa Dua again in the near future. Will it be the Westin or Nusa Dua Beach Hotel? Great service and Kids Club VS excellent pool, surroundings, garden and culture. I guess it will boil down to future reviews and whether the Summit can manage their staff better as well as price/deals. ", "Food tip - eat at Kendi Kuning next to Club Med and visit the Bali Connection (Bebek Bengil).\n", "\nAfter reading reviews, this seemed like the place to stay. I'm glad I believed the reviews. We walked down the beach and checked out other hotels on our first day and were happy to have chosen the Nusa Dua each Hotel and Spa. Great pools, bars, restaurants, friendly staff, and great location.\n", "\nFrom the moment we arrived we were treated like royalty. We opted for a Palace Room which included a great choice of breakfast items, afternoon tea bewteen 3-5pm and cocktails and hor d'oeuvres between 5.30-7.30pm. The hotel is located in the Nusa Dua area of Bali and has its own stretch of private beach.\n", "\nI used to stay for nearly 20 years in Nusa Dua at several very top hotels. It is now the 4th times in 3 years that I staid in this hotel. I have seen the renovation and Now I can confirm that this place one of the best resort in Nusa Dua. Epecially when you book for the Club part.", "Thanks to the management\n", "\nMy husband and I spent 3 nights in a palace club room at Nusa Dua Beach hotel a week ago. We were awed by the world-class service provided in that hotel! The staff truly go out of their way to help make one's stay a truly memorable one, the food is very good. As members of the palace club, we were entitled to afternoon tea with lots of yummy cakes, and had free cocktails in the evening. We ate at the Chess bar one night and it was the most romantic candlelit dinner on a beach we had ever had..... I had 2 excellent balinese massages at the SPA. The treatment was divine! One night , we ordered room service and that was equally delicious! Thre pesto fettucine were refined and tasty! Overall, it was an idyllic short holiday at a fantastic and truly world class resort! I couldn't flaw this hotel at all...... Keep excelling and thanks to all the staff for a fabulous stay!!!!!!!!!!!!!!!!!!!!!!!!!\n", "\nWe stayed in this hotel 3 years ago, spent our honeymoon there and it was the perfect choice. It has the largest beach of all hotels from Nusa Dua, beautiful gardens, pools, people are very nice and friendly, the food was great, rooms are very clean.", "We hope to come back some day with our daughter.\n", "\nThe Nusa Dua beach hotel is the perfect get away in bali The hotel has all the facilities you need the hotel's design is beautiful the executive club was great with views on a garden with a lake a wide variety of restaurants best hotel i been to in Bali .", " Breakfast was a bit of a disaster because flies and bugs were invading the open buffet which i could not dare to eat from , but you can still order your eggs and waffles to be done .\n", "\nAn unbelievable venue, depicting the true Balinese culture in all it glory from hand carved wood to hand chiseled statues. A truly majestic resort, with rooms newly renovated surrounded by a plethora of plush gardens and stunning grounds.", "The ambiance here was one of serenity and luxury. Nothing is too hard for the staff and service is excellent, attention to detail above and beyond. I felt I was the most important person on earth!", "The spa is outstanding and services there are unrivaled world wide...you'll be pampered beyond belief", "The food and cocktails are of top quality... delectable, delicious & divine....you'll truly be gobsmacked by the unbelievable selection at breakfast! 4 restaurants to choose from serving mouthwatering creations", "This place has all the amenities needed for a fantastic holiday...whether it be for a weekend or 6 1/2 weeks (like me)....", "If your sporty, a spectacular jog along this stunning beach front, it has an up to date gym which has well maintained equipment, air-conditioned , and is supervised by trained staff.There are many well organized fun sporting activities to join in with.", "For the chaps or business orientated there's WIFI available, (although in selected areas), and internet available in the rooms.", "If you're with your family, an incredible kids club (gecko Club), with fabulous staff - a huge variety in activities that will keep your children amused & intrigued, especially Culturally! Baby sitters available and bikes to hire..pools galore for varying age groups.", "A breathtaking Hotel which en-captures the Balinese culture at its best respectful, sublime, exotic and divine..I highly recommend!", "If you haven't guessed I'll be going back for my 5th visit... MY HEAVEN ON EARTH...enjoy!\n", "\nThis is a mega resort with personal service. Every guest I spoke to at the resort has stayed on multiple occasions and I can see why.", "The resort caters for the sports lover as well. Tennis courts, squash courts, beach volley ball, table tennis, pushbikes, gym, lap pool etc. ", "Thank you to the great team of Nusa Dua Beach Resort.\n", "\nStaffs are very, very friendly and are ready to help and make recommendations regarding local sight seeing hot spots. They possess a yes-attitude, if possible, which is essential to any tourists.", "Facilities in hotel are great. Spacey and plenty of options to choose for.", "Rooms are alright in hardware-wise. However, it could be even better if it was cleaned before admitted for tourists. The first day I moved in, I felt little bit dusty in the room. The second day I could feel the difference as cleaner had made the room during daytime. However, that night I found dead body of an insect and hundreds of ants surrounding it. So... in that sense, i felt a bit awkward. I cleaned it up myself anyway.\n", "\nCame here for 4 days. Gorgeous hotel, staff really courteous, friendly and helpful. Right on the beach but with 4-5 great pools. Breakfast is excellent and covers evey continent. rooms are. A good size but bathrooms a little small. Every room has a balcony, great views... We asked for a pool view which also included view of the sea.", "Forgot to take the do to disturb sign off the door and went out for the day, came back at 11pm to find a note telling us to contact us on our return and they'd come and do the room ....which they did. We brought in some wine and food to have on balcony and they went and got us wine glasses, plate cutlery, napkins etc.", "Lovely terrace bar to sit in the evenings looking ov the ocean .. Can't fault it\n", "\nHi,", "I was in Indonesia for some business purpose, my stay was arranged at Nusa Dua Beach Hotel.Was a very pleasent stay, below are extracts of my visit:", "Reaching:", "Had prebooked hotel transfer through my organizers, it was roughly 20-30 drive from Denpasar Airport(Nearest International Airport).", "Reception: ", "Recepition people were very curtious, however it might happen that you'll have to explain twice your point. Also its open area and hence no aircon.", "Room:", "Was OK, facilities were good, though seems construction was bit old. Also, my room was facing another hotel, try to ask for a room either facing see or pool for a much view. ", "room service and house keeping was excellent.", "Had some trouble using the wired internet, but the admin guy was quick to solve the problem & get me connected.", "Golf:", "Its a heaven for golfers,10 mins walk takes you to nearest golf course. Can rent clubs as well. ", "Nightlife:", "its dead after sun, so people wanting to have good nightlife must be ready to travel at least 40min to nearest spot \"Kuta\", where nightlife was actually good. Hotel staff can arrange cab.", "Currency:", "This was a shocker, I ordered some beers & my bill was in some millions, until you realize thats in the local currency.\n", "\nWe booked to stay here for 7 nights following a 12 day visit to UK, we were looking for a beach holiday and relaxation. I am pleased to say that this was exactly what we got! Due to flight delays, we arrived at 2am and were greeted with smiles and courtesy. Within 10 mins of arrival, we were checked and in our room. The room was spacious and clean, which was nice after 29 hour travel!", "Waking up the 1st day, opening the doors, greeted with the garden view. The grounds were extremely well maintained and so peaceful! We were in a Palace Club Room and had use of the Palace Club lounge, which was great. Extremely friendly and polite service during Breakfast, our names were remembered every day. Perfect poached eggs every morning. Afternoon Tea and Evening cocktails/canapés were sampled more than once! Really nice.", "We asked what one Balinese Dish shoud we try, we were told the Duck special at Raja's. This was exceptional! So tender, did not need a knife at all! The flavour was amazing! The seafood curry at Chess is another recommendation. The portion is generous, we shared a portion between 2 of us!", "The spa is also amazing! We spent time at the spa pool, then using the jacuzzi/steam room. Came away feeling so relaxed! The perfect day package was amazing and included a 3 course lunch!", "There is a program of activities and you can be as active as you want, which suited us. The beach and pools were perfectly maintained.", "We were so relaxed throughout the stay, that we did not want to leave. We would definitely recommend this hotel and would consider re-visiting this hotel.\n", "\nAfter 3 weeks of backpacking in South East Asia, we wanted to relax on Bali and chose this hotel to do so. Unfortunately, that was probably our worst memory of that wonderful trip (we ended up not enjoying being in Bali despite the beauty of the island).", "Some of the issues encountered: booking only recognized by the supervisor after a long discussion, insisting cleaning staff despite the not disturb sign on the door, poorly managed restaurant (eg. were obliged to quit the table because of another booking made by another couple earlier on), apparently not enough tables for all guests for breakfast.", "Five stars for such an hotel is, to our mind, clearly overrated.\n", "\nWe (2 adults, 2 children at the age of 18 and 14 years) stayed for 10 nights in 2 interconnecting rooms in July.", "Check in/out was very fast and pleasant. We were offered some refreshments and were able to see a few rooms before we choosed one. On our last day we got a late check out till 5PM f.o.c. Great service!", "Rooms: the hotel was renovated in 2011/2012. The rooms are nice but a little damped. In spite of putting the AC high the rooms still stayed this way. I know this is Asia but we didn't experience the same in other hotels. Also I think it's a pitty that although housekeeping did a great job in cleaning the main parts of the rooms, they forgot to clean small corners. There were lots of little spots of dust in the room and bathroom. I hope the hotel will improve these. The lay out of the rooms were lovely though, and gave you the Balinese feeling. The view from our balcony was like a dream (gardenview rooms).", "Service was great especially in the restaurants and reception. At breakfast they remembered our names and preferred coffee. The duty manager ( I believe his name was Mr. Yudinaya) was great. All the staff made us feel very welcome. We were sorry to leave after 10 nights....", "Breakfast was of a high quality. I liked the way they changed items every day. Never had to wait a long time at the eggs station. Fruitselection was great. They had a western corner offering about 6 dishes, Asian corner also 6 dishes. Great choice in different kind of bread, rolls and pastries. The breakfast restaurant was in a very beautiful setting. So relaxing....Wow I wish we were still there!", "Pool/beach: very nice. Never had a problem in finding chairs no matter what time. They have 3 pools and it is lovely to walk around the beach path.", "Location: Well we thought it would only be around 30 minutes by taxi to go to Seminyak or Kuta but boy were we wrong. Because of many roadworks Bali suffers from heavy traffic jams. It take about 2 hours to visit Kuta! We didn't like Bali Collections and we found it very difficult to find a good Indonesian restaurant in the neighbourhood. all the food was way too much western style and missed the Indonesian authentic taste. In fact we ate the best at the hotel itselve (Sotto ayam and also the bami goreng is very nice at Chess) and also at Bumbu Bali (Satay was nice, also the gado gado and great Indonesian desserts). The beach is the nicest at Nusa Dua but the surrounding are a little boring. Not much to do compared to Sanur for instance.", "This hotel is a great choice if you want to relax at a beautiful beach and being served by the most welcoming staff you can imagine!\n", "\nWe have been to Bali eight times and have tried other 5 Star hotels in Nusa Dua however none have even come close to matching the experience we get at the Nusa Dua. We now happily choose to stay there EVERY time we visit Bali. It is a very large hotel which is almost always full yet the staff still have a special way of making us feel as though we are the only guests staying there. The staff and management are friendly, professional and extremely helpful. Nothing is too much trouble. The rooms are exquisite as are the pools. The buffet breakfast is to die for. There is an amazing gym,tennis courts etc. We play squash every morning after breakfast in a beautiful air conditioned court which helped work off the breakfast lol. The spa is amazing with an endless list of packages available along with a private pool which does not allow alcohol, children under 12yo and most important smoking enabling you to relax in a child and smoke free environment. We cannot recommend this hotel enough trust me you will NOT be disappointed and like us you will make this your home away from home.\n", "\nVery nice hotel,wonderfull breakfast(We stayed 3 weeks and i gained 4kg).Big resort and from our room at the top floor was 10 minutes walk to reach the pool and the beach.Very good spa,tennis,squash and a small fitness.Very friendly staff.\n", "\nWe flew from New Zealand to stay at the hotel for 12 nights, we booked a Palace Club room for the stay. When we arrived we were ushered to the club for check in which was very fast and we were shown to a lovely ground floor room which had plenty of space and lots of cupboards and drawers. The room had two sets of doors, both with locks, one glass, the other with wooden louveres. This meant that at night we were able to have the glass ones open and wooden ones letting in the breeze which meant we escaped having to use air con at night, just lovely.", "One of the reasons we booked the hotel is because it is older and has a strong Balinese influence, it is not just another generic resort (we could have stayed closer to home and got that!). When you arrive you see an amazing Balinese entrance that is unlike anything else we saw. The whole hotel has lots of different bits and pieces such as amazing pots and structures that remind you where you are, we find that very pleasant. The grounds are beautiful and really well looked after. ", "The rooms are cleaned and tidied properly every day, they really were spotless, and for us it was truly lovely that the person from housekeeping who did our turndown each evening remembered our name and which room we were in wherever he saw us in the hotel and always had a cheery word. All the staff without exception were very friendly, always greeted you and asked if everything was OK, they were never pushy.", "My wife used the spa a number of times and always came away with a smile on her face pronouncing herselfd very satisfied with the treatment.", "The food was very good in all the restaurants, and everyone should go to Raja's and have the signature 'Duck' dish, it was beautiful and so soft it was carved with a spoon!", "The club was another high point for us, the staff are really gracious and look after you the whole time, the breakfasts are really nice, both a buffet and a menu, with a good selection of fresh juices and according to my wife the best selection of organic teas she has ever tasted, with her personal favourite being the 'Asian Breakfast'. The afternoon tea was also lovely as it was served as a full 3 platter, sandwich, scones and cakes with tea or juices etc. Then came the evening cocktails and food, beautiful, I had my fair share of Martini's sitting outside looking over the lovely garden and ponds, lovely way to finish the day. The management were also very friendly and often came around and had a chat.", "So in conclusion - would we go back again, and would would recommend this hotel to anyone else - the answer is YES on both counts. Thank you to everyone who helped us have a beautiful 12 day holiday.\n", "\nRight after a big celebration, my husband and I had a little detour to Bali island. Nusa Dua Beach hotel used to be a sweet old hotel with character back in the 90s. However, coming back to Bali and staying in Nusa Dua Beach Hotel changed my perception about the old hotel. It apparently just finished their total face off and now is in par with other new developments in the area. The room was spacious, the breakfast was sumptious and plenty. The only let down is the level of service almost stay in the mid of 80s or 90s. They could upgrade the level of service as the upgraded their face already.\n", "\nDespite being the most expensive part of our holiday nusa dua was also the most relaxing and this was a lot to do with the environment of the hotel. We stayed in a club suite room which was a little more spacious as we were travelling with an 18 month old. Beaches, pools and restaurants were all fantastic!! Thank you For being the only place in Bali where we could order duck without a 24 hour pre-order! Palace club breakfasts were delicious! We were a bit disappointed that we were not made aware of the dress codes for the early evening cocktails before our arrival! Although I guess we could have gone shopping and purchased something appropriate we were kinda over the shopping bit after 12 days and were just wanting to relax, so unfortunately we missed out on this part of our package. We did manage to catch one afternoon tea on our last day which was fabulous and I was bitterly disappointed I did not get there every day. Staff at th hotel went above and beyond! Particularly the housekeeping boys who always asked if we were ok and if we needed anything for the room. So friendly!! We did not use the spa or sporting facilities except for some bikes one afternoon but there looked like there was plenty to do!! Would absolutely return to this hotel.\n", "\nSpent one evening at the hotel and booked the palace club room. The service in the club lounge is impeccable, with true balinese grace. I had the pleasure of meeting the new General Manager who spent time with guests. Stay here if you come to Bali. It's an older hotel with so much charm and beauty.", "Thank you to the Palace Lounge staff for a memorable stay at the Nusa Dua. You set the bar for service and kindness.\n", "\nStayed in a Palace Club Suite and absolutely loved it. More room then we needed as we were always out by the pool. Very relaxing and with shopping a short scenic walk away, we have everything at out finger tips. Did not leave the Nusa Dua strip for the whole 15 days. Definately upgrade to having the Palace Club Privileges as it saves you more than what you paid on drinks/food etc. Highly recommended. Definately do the Spa promotion for the month whilst there, you will enjoy and appreciate it. Can't seem to stop people holding the sun lounges but as we were out there early and stayed there, it didn't seem to bother us but gave us something to watch when people either came back or trying to find one.\n", "\nIt was our second stay at this hotel. It was more than we expected, we had a very confortable room at the palace club section of the hotel with all the many advantages.", "Two days before leaving I failed sick, I could not fly back home I was admited to the Nusa Dua BIMC", "hospital for an emergency operation. I received top care in this very modern hospital.", "The hotel was wonderfully caring, I received the visit of the hotel management and some of their very", "kind staff, they brought me fruits and they prayed for my recovery. My wife was offered the use of their private transport. On my return to the hotel I was sincerely welcome, and we were offered a very generous prolongation stay at the hotel till I could fly back.", "I am very greatful to the management of that hotel as well as all of their kind staff.", "Michael du Maurier Sydney\n", "\nThis was our First trip to Bali. We stayed at Kuta for 3 Nites and arrived here at Nusa Dua beach Hotel & Spa for a Truly Amazing Vacation ! The staff were very Friendly and Attentive all thru our stay. Be it while checking or Breakfast, Pool side Restaurants or even during their Dinner With Traditional Bali Dance. It was a truly amazing experience. My 6 Year old Son and 2 year old Daughter didnt want to return back to Japan from there after spending 4 days here. The private beach is really clean and peaceful, the pool very relaxing, the breakfast spread is too good. They have various activities for the kids and adults and we can just laze around. Lots of trees and greenery around you can take a walk, swim, play tennis, Table Tennis etc etc. We took a Glass Boat ride and visited the Turtle farm, did some beach sports etc etc. Definitely i would recommend this place to my family and friends and also visit it very shortly and whenever i need a good relaxing break !!\n", "\nThis was my forth trip to Bali-Nusa Dua but my husband's and children's first time. I must admit my husband was very hesitant to travel to Bali; once he arrived at the Nusa Dua Beach Resort his idea of Bali changed. We had the most amazing and relaxing stay ever. The staff were very cutious and attentive; the hotel offers many activities for children and adults therefore we could just laze around the pool/beach or get up and be active. I enjoyed my yoga and jogs along the main pathway, my children loved playing tennis, soccer on the beach, bike riding and ping pong was the highlight of this holiday. My five year old was so at home he would order lunch and drinks for the family on the beach or by the pool. My husband enjoyed the cocktails, food, breakfast especially and the array of tv channels. I highly recommend this resort for families looking to have an easy relaxing and care free break!\n", "\nWe came to hotel without making booking and friendly bellboy help us with our luggage to reception desk.It only took tree minutes get a room and what a room.Nice kingsize bed and many closets to our clothes.A flatscreen tv on the wall with 60 differents channels.Nice view overlooking garden and the beach.Dinner was nice but i must say it was littlebit overpriced.Breakfast was great.It has everyting you need no mather where you from!If you want to go somewhere else eat or go to shopping theres a bus going to collection a shoping gallery every hour.The staff is great ,always smiling . All around in the gardens there were tame squirrels, they took food from your hand! Nice, clean beach.We really love this hotel!\n", "\nWe stayed in a Deluxe Room for six nights. The room was great it had everything we needed. It would be great if a DVD player was included however the TV had a variety of Satalite channels to chose from. ", "The best part of the entire stay was the breakfast. The food options and quality were amazing. The setting was gorgeous and the staff were friendly. Perfect start to the day! ", "The pool area was great and the drinks in the pool bar were delicious! The only concern we had was that people would go put their towels down and then go for breakfast so if you didn't get down early it was difficult to find a chair by the main pool. There were other chairs though on the grass and on the beautiful beach so it wasn't too much of an issue.", "The restaurants at the hotel were all lovely. ", "The lobby bar was a great place to finish the day. The staff were friendly, the drinks were great and the location is charming. ", "Overall amazing experience! I would stay there again in a second!\n", "\nWe went for our honeymoon and stayed here for 4 nights.. The hotel was amazing.. the staff was very friendly.. Always greeting you with a lively smile.. The rooms were not very big but were very clean and very well maintained.. Huge variety in breakfast!!! ", "We had a fantastic time at Nusa Dua for our honeymoon. The hotel has beautiful grounds and location is great right on a private beach. The staff at Nusa Dua were really helpful and went out of their way to make it a special and memorable holiday.Thank you for a memorable holiday and making it special for our honeymoon.\n", "\nWe recently spent 10 days at the resort and wanted for nothing. The staff were very friendly and the hotel service was excellent. The resort offers a real Balinese feel with its gardens and surrounds unlike other resorts in Nusa Dua that seem more western in style. We'll be back again and again\n", "\nIn July 2011 we stayed in the Nusa Dua Hotel for the 4th time. In all aspects, a hotel with more than worthed four stars. Why? This year they (Peter Scholz: residence manager) showed us an excellent way of solving our two problems. ", "A question/problem or complain is always possible. We discussed ours and by doing that the staff had the opportunity to deal with it. By doing that we really experienced that this hotel deserves it’s five stars. We hearthly recommend this hotel because of it’s relaxed and quiet atmosphere, nice beach and very nice and polite staff. ", "Paul & Ingeborg", "The Netherlands\n", "\nI have been going to Bali for 15 years and it is time to salute the Hotel and the staff of this wonderful establishment. First of all it is the only original Balinese hotel in Nusa Dua, all the others are international copies. The staff is ever so friendly and you really feel at home here, where you are sincerely taken care of.", "I would like to thank Mr Peter Scholz the Resident Manager, who runs a very efficient operation and is always ready to go off his way to help you in whatever problems you may have. A very dedicated professional. The Palace Club is a very special place in the hotel. It is managed by Mr. I Gusti Made Sunada. A very warm and caring person, a real Balinese. His Staff has a special, personal touch to make everybody feel welcome and happy. The service is outstanding. That is why all the returning guests keep coming back and are a somewhat of a family within the hotel. Everybody has a true smile here and the atmosphere is very relaxing and friendly. Fantastic, very personal service.", "A special thanks to Mr. Geoff Clark, the executive chef and the head of the culinary team. I have never seen a chef more dedicated to his work. He is always present and takes an exceptional care of the restaurants at the hotel. The food quality and taste is just a wonderful experience.", "So to summarize, I would recommend this hotel to anybody, who is considering a visit to Bali. From the moment you step in front of the lobby, you are greeted with a true Balinese hospitality, and it is magical. So welcome to this kingdom of happiness, relaxation and rejuvenation. Believe me, when it is time to leave, you just want to hide and stay longer. Enjoy !\n", "\nOne of the coolest one in Bali.......everything from welcome greetings to the end is absolutely perfect. I would say this hotel is worth staying and it will give you absolute value for money. If you want to stay in a quiet place with private beach, pools and cocktails within a reasonable price, this one is perfect. I loved the friendly staffs, location, living quality and food.", "A great one and highly recommended.\n", "\nWe were very impressed with the Nusa Dua Beach Hotel. The staff were easy to communicate with, very friendly and helpful. The buffet breakfast is top notch and the beach restaurants for lunch or dinner were casual with delicious meals. ", "We had dinner once at the Asian restaurant which is quite upmarket yet we were made to feel very comfortable and relaxed with an excellent meal and wine. The head waiter was very helpful A bit expensive to dine there every night but in comparison to restaurants at home actually quite reasonable.", "The beach is tidal, luckily for us high tide was from midday till late afternoon, not so great if you wanted an early morning swim. The pools are excellent, very clean with staff continually cleaning the surrounds and grassed areas.", "Over-all we had a wonderful experience here and would definitely stay here again if we return to Bali at some stage.\n", "\nHands down, this is one of the best hotels we've stayed in. It's gorgeous, big, right next to the beach and the staff is outstanding (special shout out to Asri and Mr. Karma). The breakfast is also super yummy and the Koi Carp fishes in the lobby are awesome. They feed right from your fingers and some even jump on the pond's ledge. It's like seeing Darwin's theory in action!\n", "\nWe had a fantastic time at Nusa Dua for our 25th Wedding Anniversary. The hotel has beautiful grounds and location is great right on a private beach. The staff at Nusa Dua were really helpful and went out of their way to make it a special and memorable holiday especially the Guest Relations staff, Minako, Yoni and Dhini.Thank you for a memorable holiday and making it special in every way.", "I would choose this hotel again as it has Balinese culture architecture and the setting is beautiful the moment you enter the resort. It has a feeling of tranquility and peacefulness.", "They have a free shuttle that goes to Bali Collection which is a good shopping complex with lots of restaurants and shops. ", "Amazing holiday.\n", "\nWhen I arrived, I couldn't believe that the hotel was built on 1983! It looked (and felt) like its only built couple of years ago!", "Check in was prompt and we loved the Pacific King room we're staying in. We had garden view and every morning the squirrels would come and play on our balcony. Lucky I have some peanuts so I get to hand-fed them everyday, they are very friendly!", "Swimming pool was clean, so is the overall hotel area. Staff were very helpful and friendly. Spa facility was nice. Cool lounge area. Big garden. It was great!", "However, we didn't quite enjoy the breakfast. Selections are huge but it's not that tasty (compared to another hotel I was staying in the other days). The combinations of one dishes to another is somewhat confusing.. doesn't taste too well together.", "The bathtub in the room should be installed the other way around. I could't lie down while watching the TV in the bedroom because of how its installed. But not too worry..", "The hotel's taxi is a ripoff, I paid A$8 just for a 5 minutes ride!! So if you're staying there just ask them to call a metered taxi to come pick you up, its heaps cheaper (only A$1.5)!", "I read some good reviews on the pizza, so I thought I'd try it... But when I got one it was very bad. Almost uncooked pastry at the bottom and all the toppings are too wet. I would prefer Pizza Hut or Domino's. And the garlic bread is the WORST. It's so garlicky! And its more like a garlic cracker, its certainly NOT a bread. Not sure why the other reviewers enjoyed it, probably I got unlucky?", "No free wi-fi in the room. And when we wanted to use the internet on the business centre they were going to charge us A$3.3 for internet and A$1 for 1 page printing. They try to make money wherever they can.", "My tips if you want to save from spending, is to get metered taxi for transport (as mentioned above). Go to Bali collection, The Bay or Kendi Kuning for cheaper lunch/dinner. Kendi Kuning is actually within walking distance through the beach (10 mins walk) and the owner would happily pick you up.", "My other tips is if you're planning to enjoy sunset, don't stay on this side of the island as there's no sunset here. Also, there's literally no wave on the beach shore, which is probably good if you have small kids who want to play in the water safely and freely.", "Overall, we had a great experience staying in the hotel. And definitely would recommend anyone to stay here.\n", "\njust an overnight stay for me and my son was enough to tell myself that i should've booked for at least 2 more nights. after spending 3 nights in ubud (which was not bad at all) one would certainly be swept away with the massive and elegant layout of this resort. the balinese frontage/structure as you enter the complex was already a sight to behold. check-in was a breeze and room already made available. we booked just a standard room and was impressed with it's size and cleanliness. i wasted no time in going around the resort as i felt our length of stay to be insufficient to cover much ground. the pool area was fantastic and was separated from the white sand beach by a sprawling open-air restaurant. food served in the resort was excellent and in good proportion. shuttle service to the nearby bali collection shopping arcade was available for free. service was prompt and courteous. the whole nusa dua area was so impressive because it gave us the feeling of security and exclusivity... a gated subdivision comprising of huge resort complexes. as we had a 9am flight, the hotel assured us of an early opening of the breakfast buffet and also made available for us an airport transfer. if you are looking for a vacation with a resort-like atmosphere and service... you need not look further away from nusa dua beach hotel & spa.\n", "\nIt's a great place to spend your holiday here. The hotel provides good balance between fun and tranquility wrapped in a very comfortable staying and perfect people to help and greet you around. The pool were very nice. The breakfast is an extra-ordinary one to enjoy every morning.", "The Nusa Dua area is quite far from the other tourism locations in Bali. However, you can find many options of recreational activity provided by the hotel and local area. This place is perfect for gateway or for the honeymoners.\n", "\nWe stayed here for 9 nights with our children aged 5 and 7. There was no doubt in our minds that we made the perfect choice in accommodation. The hotel and it's surroundings are beautiful - well looked after and very clean. We stayed in the family room on the ground floor near the pools - plenty of room for all of us with the kids having their own room with bunks and our room separated by a wall and door next to it. The breakfast spread was unbelievable - it was hard to know when to stop eating! The pools were amazing and never overcrowded and all staff were very friendly and helpful. Only used the kids club once which the kids seemed to enjoy but they preferred to be in the pool! Drinks and food in the hotel are extremely over priced as are the spa services - Bali collection which is only a 2 min taxi ride ($1) or 10 min walk away is the place to eat and cheap massages and beauty treatments available in spas at the main gates of Nusa dua also walking distance ($8-$10) for one hour massage. For someone who is extremely fussy I really can't fault this hotel - it was the perfect resort for a relaxing, stress free holiday in the warm sun!\n", "\nA big hotel with local architecture", "And own the private beach", "But further the management should giving us free internet access.. Housekeeping 2 times enter the room and realize that there is a guest inside the room. Avoid something like this happened again please\n", "\nExactly Balinese style. The resort will remind you, you are in Bali every time you wake up. The resort structure is very Balinese, you can have good background shoot. However, the resort seem is a little old, maybe this is Bali style. ", "There are nothing in Nusa Dua, but the weather is pretty nice, whole day in breezy and comfortable. You cannot swim and surf there, as there are full of algae near to sea shore. However, the hotel would provide everything you need, of course the charges is a bit high but you get high quality services also. ", "Would recommend for those wish to rest and relax, or honeymoon couple.\n", "\nWe recently stayed 6 nights at the Nusa Dua Beach Hotel & loved every minute. We booked a deluxe room for 4, which was 2 adjoining rooms on the 2nd floor that overlooked the main pool & had views of the beach. The views each morning from the balcony of palm trees swaying in the breeze was paradise.", "Our daughter celebrated her 5th birthday while we were there & the Eka from Guest services did a fantastic job organizing a large chocolate cake for a party in the Gecko Kids Club to enjoy. They even provided some small gifts to make our girl's birthday a very special one.", "Meals were of a very good quality (the Mee Goreng at Chess was superb) & the breakfast plentiful with great service. Getting the shuttle to Bali Collection for dinner is highly recommended unless your budget is unlimited though!", "The staff overall were brilliant & I can't speak highly enough of them. ", "We are already looking forward to returning next year & hopefully for many years to come.\n", "\nhi stayed at this hotel for seven days i was so impressed with the hotel facilities and staff everything done with a smile .the breakfast selection was awesome the room we were in was great .the personal touch was great after only one day most staff remembered our names.Starting the day with 20 laps of the lap pool then to a great breakfast, hire a bike and go for a ride down the promenade a bit of bargaining with the locals back to the hotel to the pools and a few bintangs, awesome, of the hotels we stayed at over our 3 weeks away from nz this hotel would have been the best for service and friendly staff. even peter the manager took time to stop and introduce himself. would reccomend this hotel to anyone who is looking for a hotel in the nusadua area .we will certainly stay here again .", "cheers alan mcgill and of course the lovely Marie\n", "\nWe have just returned from a 15 night stay at The Nusa Dua Beach Resort & Spa and if you're looking for somewhere to 'recharge the batteries' - look no further! All the staff were friendly & helpful. The pools were well maintained and never seemed overcrowded. The rooms were thoroughly cleaned every morning & again a quick clean in the evening. The breakfast buffet has a huge range of options, covering every taste. The Gecko Kid's Club is run by women who genuinely seem to love their job and have a great choice of daily events. I have nothing but great things to say about this hotel and can't wait to return soon.\n", "\nMy husband and I had a great one week holiday in this hotel last year. It was a best hotel I have ever seen. The balinese architectural of hotel was amazing. Room was large enough and the cleanliness was excellent ,our room was cleaned perfectly twice a day. Their staff were really polite and helpful, always smiling. The best thing regarding this hotel was their excellent service ,everything you asked was in your hand in few minutes. It had very nice beach with wounderful view. Altogether it was perfect hotel specially for couples. Strongly recomended.\n", "\nWe have made several trips to Bali before but never stayed in nusa dua. This trip we decided to and were very thankful. It was great. The kids had a great time at the hotel as did my husband and I. There is very little to do except relax which is just what we wanted. The hotel has everything you need, and Bali collection is very close for other restaurant options. The hotel is very welcoming of children even the palace club area which we used daily. I would highly recommend this hotel.\n", "\nThis is our 4th visit in 5years,we always enjoy coming back to the Nusa dua hotel.we enjoy the palace club,where the senior ladies welcome us back,and service is great,the rooms have been updated,the grounds are beautiful ,always relaxing and safe,Palace Club is worth the xtra.\n", "\nWe spent 3 or 4 nights at this hotel last November. It was our second stay at this hotel and we can't wait to go back again. We were there for the first time in 2004 and had a good experience then but weren't sure if we would go back. After checking reviews and prices of the different hotels, we decided to book Nusa Dua Beach Hotel again and we didn't regret our choice. The second time was even better than the first! ", "The hotel grounds was well maintained and looked exactly the same, if not better, than it did then. The spa was also very beautifully kept. And the best of all was that the rooms have been refurbished and are now a blend of modern comfort with traditional details, like the rest of the hotel. ", "We chose this hotel mainly because of its lovely beach. The sandy beach (light brown sand) is wide and clean, with lots of deck chairs but yet not too closely placed. The vendors kept their distance unless you beckoned them to approach. ", "For those who prefer the pool, the hotel also has a couple of large beautiful pools, which are great for swimming. My favourite is actually the smaller but still sufficiently large pool at the spa. It is quieter and beautiful plants lined the side of that pool with relaxing music playing in the background, creating the most tranquil atmosphere for total relaxation. The deck chairs here were also better quality and the spa staff even brought complimentary water and snacks to the deck chairs. Bubble baths and steam baths are also conveniently located in the spa's dressing room. ", "The quality of the food was also really high. We had two dinners outside, in Nusa Dua city and those couldn't compare with the quality of the dinners we had in the hotel. We ordered room service once - the nasi goreng was one of the best I've had in Bali - and ate at the traditional Indonesian restaurant another night. As that was my birthday dinner, we dined at the special pavilion in the middle of the pool, with a dedicated waiter. The food was absolutely delicious and the birthday cake which they arranged was great too. ", "From a price-quality perspective, it is hard to beat this hotel. We definitely look forward to going back again!\n", "\nthis hotel rocks was my second visit to bali was in grand hyatt but this hotel was just amazing huge resort lets you unwind the beach is great and the food was great too .the exec chef came too my rescue when i just didnt get a nice taste of my egg and made a nice flavoured one for me just by my looks the chef asked me if he could get a one from his bag.the best place to relax and unwind\n", "\nWe stayed at the Nusa Dua Beach Resort for 7 nights. This is located in the south of Bali, the area is nice and quiet and away from all the hustle and bustle. The surrounding area is also very clean and well maintained. The hotel is nice and clean with many helpful and friendly staff and there is plenty of security about.", "We had breakfast every morning and sitting by the small pond was very pleasant, there is a great selection and also items like poached egg can be ordered if you like. ", "We didn’t have dinner in the hotel but at local restaurants near by like Bumbu Bali (Indonesian) and Queen’s (Indian) and also at the Bali Collection (not that great though). These places offer a free shuttle service and the hotel staff are happy to call them for you."]