["Very nice place.friendly service.perfict position. Clean. Food .few different place to eat and romantic dinner very nice on beach .we have very time.we come with are 3 years old child.we in join stay in this hotel from day one", "Just spent 8 days on a luxury escapes offer with my husband & 16 yo daughter . This was our second visit to nusa dua beach hotel and Was essentially thoroughly relaxing. The team at the Chess /pool bar were amazing! Very friendly helpful and nothing was too much trouble. Widdy made us feel very welcome whilst been professional & efficient, we will keep fond memories of our daily visits .", "Only problem we had was with the passport which contains your benefits. The food was limited only when you ordered & towards the end of our stay a seperate menu was produced making us feel inferior, the drinks were portrayed incorrectly & not honoured as portrayed in the passport book . I inadvertently lost my book on the second last day & replacing was a huge issue as they couldn't work out what was left & told me all was basically utilised (which I knew was incorrect) however they were adamant. I did however end up finding & I still had 5 lunches & 3 dinners left . There was no apology for the issues & upset our last day .", "With that aside I would come back but in hindsight would keep a copy of my book each day as proof & get receipts for each transaction.we also had someone inadvertently place purchases to our room but the boys at chess bar picked up, so u really need to check each day on your tab or pay as you go. Overall though we will likely go back wiser and look forward to another relaxing holiday", "The service staff of the hotel was very friendly and went all out to help.", "My spa appointment was booked on the 1st day when I arrived. However, there was some changes to the itinerary that I cant make it to the spa on the 3rd day. The helpdesk lady was very helpful. It was near to impossible to change as the 3rd day is a Saturday and the spa booking was full. However, the spa manager was receptive to accept my idea of having massage in my own hotel room via the helpdesk lady. Kudos to them!", "One point that the hotel can improve on is perhaps the breakfast menu. For the 4 days we stayed, we had the nearly the same international breakfast spread everyday. It would be really fantastic if the menu is varied every other day. Thanks!", "An absolutely fantastic hotel!!! From the staff to the resort and facilities!! I can not think of a thing to fault and will be back for sure. This was our second stay and have had 3 other families stay here because of our recommendation. We can't wait to return :D", "Wow if you are looking for paradise in Bali look no further a different experience to Kuta resorts much quieter area in general but plenty for us to do kids love the kids club the traditional dress photos of the kids are priceless.", "The restaurant area by the beach is truly lovely and a walk along the path at the beach at night is sure to stir up some romance.", "Once again like all resorts in Bali I recommend a ground floor room with a pool or beach view after all it's a shame to come all that way and not fully enjoy your time.", "A lovely hotel and our second visit. The atmosphere is very relaxing and the staff are great. It has everything that you need. This was our second time at the hotel and it did not disappoint.", "Great to see the hotel's General Manager out and about, interacting with guests and making sure everything was up to scratch.", " ", "This was our second trip to this hotel and the main attraction was the staff who are helpful, hospitable and have a high regard for customer service. The hotel itself has beautiful, luscious grounds which are well laid out and relaxing. The hotel is more towards the Balinese architecture which is aesthetically pleasing. All services and food outlets are great with a wide choice. The hotel has a homely feel and the biggest attraction is the private spa area away from families for some extra quiet and privacy. Loved it and will be returning again. "]
